{
    "title": "en.wikipedia.org_wiki_Vicky_the_Viking",
    "url": "https://en.wikipedia.org/wiki/Vicky_the_Viking",
    "transformers_text": "Vicky the Viking , known as Wickie und die starken Männer ( listen ⓘ ) in Germany and Austria and Chiisana Viking Bikke ( 小さなバイキング ビッケ ) in Japan, is an animated television series which tells the adventures of Vicky, a young Viking boy who uses his wits to help his Viking fellows. It is based on the novel Vicke Viking (1963) written by the Swedish author Runer Jonsson . It premiered on the West German TV channel ZDF on 31 January 1974 and aired in various countries. In 2013–2014, the series also existed in 3D animation produced by Studio 100 .\n\nVicky is a small boy with shoulder-length reddish-blonde hair who lives with his parents Ylva and Halvar, the latter being the chief of the small village of Flake. Vicky is not a typical Viking boy, being naturally fearful and not particularly strong. However, he impresses with his pronounced intelligence, with which he regularly supports adults and friends in seemingly hopeless situations and helps them find a solution. Together with Halvar and his ship's crew of more or less strong men, Vicky experiences dangerous and humorous adventures each episode. Initially he must assert himself against the crew's skepticism, but he quickly develops into an essential figure whom the Vikings cannot go without.\n\nThe script was developed from the children's book Vicke Viking (1963) written by the Swedish author Runer Jonsson , who won the Deutscher Jugendliteraturpreis (German Children's Book Award) for it in 1965. The Japanese animation studio Zuiyo Enterprise Company (from which Nippon Animation was formed) adapted the original version (1972–1974) and developed from it an 85-minute-long movie (original title: Chiisana Baikingu Bikke) as well as the series with 78 episodes, each 25 minutes long. The animation of the first episodes was commissioned by Zuiyo Eizo to Mushi Production , directed by Chikao Katsui. Following the failure of the latter, Zuiyo Eizo continued the production of the series alone hiring director Hiroshi Saitô. Later Zuiyo Eizo will split into Zuiyo Co., and Nippon Animation which will complete the rest of the episodes with director Kōzō Kusuba, while Zuiyo will maintain the rights to the series (copyright has been registered in 1972). [ 1 ]\n\nResponsible for the German dubbing was Eberhard Storeck, who spoke as one of the characters (Snorre) himself. The music in the German version was composed by Christian Bruhn and Karel Svoboda . The text of the title song (Hey, hey, Wickie! Hey, Wickie, hey! ...) was written by Andrea Wagner. The German version also features new brief portions of animation. The English dubbing was largely poor, with characters talking endlessly to fit the lip movements of the characters, not pausing for a breath or using verbal punctuation. In the years that followed this was not uncommon for some voice actors who dubbed Japanese-produced series, up to the 1990s' anime boom in the West.\n\nThe series was produced for the German TV network ZDF and Austrian TV network ORF . In the United Kingdom, it was shown on ITV .\n\nA modern television 'remake' is entitled Vic the Viking .\n\nOn March 24, 1978, a feature-length film edited from episodes of the animated series was released in West Germany. [ 2 ] [ 3 ]\n\nGerman director Michael \"Bully\" Herbig filmed a live action adaptation of the series called Wickie The Mighty Viking (aka \"Wickie und die starken Männer\"). It was produced by Christian Becker of Rat Pack Filmproduktion for a 2009 release. [ 4 ] Vicky is portrayed by Jonas Hämmerle. Günther Kaufmann portrays Sven , the antagonist of the Vikings. The Vikings of Flake are portrayed by Jörg Moukkadam ( Faxe ), Mike Maas ( Gorm ), Christian Koch ( Snorre ), Nic Romm ( Tjure ), Patrick Reichel ( Ulme ) and Olaf Krätke ( Urobe ). [ 5 ]\n\nThe film premiered on 9 September 2009, in Munich. [ 6 ] On its opening weekend, it grossed approximately $5,595,895. [ 7 ] On 3 October, during a show of Wetten, dass..? , Herbig was presented with the Goldene Leinwand award for the film's viewership of three million within its first 18 weeks. The film sold nearly 5 million tickets in Germany, for a total gross revenue of approximately $40,582,384.\n\nFollowing the success of the first film, a sequel, Wickie auf Großer Fahrt , was released on 29 September 2011.\n\nA CG animated film Vic the Viking: The Magic Sword was released on December 8, 2019. [ 8 ]",
    "tf_idf_text": "vicky viking know wickie und die starken mnner listen germany austria chiisana viking bikke japan animate television series tell adventure vicky young viking boy us wits help viking fellow base novel vicke viking write swedish author runer jonsson premier west german channel zdf january air various country series also exist animation produce studio vicky small boy shoulderlength reddishblonde hair live parent ylva halvar latter chief small village flake vicky not typical viking boy naturally fearful not particularly strong however impress pronounce intelligence regularly support adult friend seemingly hopeless situation help find solution together halvar ship crew less strong men vicky experience dangerous humorous adventure episode initially must assert crew skepticism quickly develop essential figure viking cannot without script develop childrens book vicke viking write swedish author runer jonsson deutscher jugendliteraturpreis german childrens book award japanese animation studio zuiyo enterprise company nippon animation form adapted original version develop minutelong movie original title chiisana baikingu bikke well series episode minute long animation first episodes commissioned zuiyo eizo mushi production direct chikao katsui follow failure latter zuiyo eizo continue production series alone hire director hiroshi sait later zuiyo eizo split zuiyo nippon animation complete rest episode director kusuba zuiyo maintain right series copyright register responsible german dub eberhard storeck speak one character snorre music german version compose christian bruhn karel svoboda text title song hey hey wickie hey wickie hey write andrea wagner german version also feature new brief portion animation english dubbing largely poor character talk endlessly fit lip movement character not pause breath use verbal punctuation year follow not uncommon voice actor dub japaneseproduced series anime boom west series produce german network zdf austrian network orf unite kingdom show itv modern television remake entitle vic viking march featurelength film edit episode animated series release west germany german director michael bully herbig filmed live action adaptation series call wickie mighty viking aka wickie und die starken mnner produce christian becker rat pack filmproduktion release vicky portray jonas hmmerle gnther kaufmann portrays sven antagonist viking viking flake portrayed jrg moukkadam faxe mike maas gorm christian koch snorre nic romm tjure patrick reichel ulme olaf krtke urobe film premier september munich open weekend gross approximately october show wetten das herbig present goldene leinwand award film viewership three million within first week film sell nearly million ticket germany total gross revenue approximately follow success first film sequel wickie auf groer fahrt release september animate film vic viking magic sword release december"
}