{
    "title": "528 12 \"Excitement Blow-out! Sanji's Life Under Threat!\"Transliteration: \"Kōfun Bakuhatsu! Sanji Seimei no Kiki!\" (Japanese:興奮爆発！サンジ生命の危機！) Naoyuki Itō Jin Tanaka December 18, 2011(2011-12-18) February 27, 2022",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_15",
    "transformers_text": "528 12 Excitement Blow out Sanji's Life Under Threat Transliteration K fun Baku hats u Sanji Sei mei no Kiki Japanese Nao yuki It J in Tanaka December 18 2011 2011 12 18 February 27 2022 Nami has survived by landing on another part of Fish man Island Using his Coup De Vent technique Franky rescues Robin and regroups with Nami Meanwhile the five Med aka Mermaid Quintuplets in form the others that a royal ship is arriving When the royal ship finally arrives with the three princes F uk a boshi Man boshi and Ryu boshi Sanji is forced to hide from them However Sanji suffers a massive nosebleed rendering him unconscious and the three princes have the Ammo Knights attack Luffy and the others Meanwhile Zoro awakens in another part of the island and are suddenly confronted with another group of the Ammo Knights When Chopper asks the others if the fish men can donate blood to Sanji Hammond and the others appear and refuse his offer Using Gear Second Luffy attacks the pirates and uses his Hak i technique on the Sea King Luffy Kei mi and the others depart with the royal princes ' ship F uk a boshi tells the mermaids that Luffy is a well known pirate as he can not go through immigration and they were going to give Jim bei's message before Luffy departed",
    "tf_idf_text": "excitement blow sanjis life threat transliteration fun baku hat sanji sei mei kiki japanese nao yuki tanaka december february nami survive land another part fish man island use coup vent technique franky rescue robin regroups nami meanwhile five med aka mermaid quintuplet form others royal ship arrive royal ship finally arrive three prince boshi man boshi ryu boshi sanji force hide however sanji suffers massive nosebleed render unconscious three prince ammo knight attack luffy others meanwhile zoro awakens another part island suddenly confront another group ammo knight chopper ask others fish men donate blood sanji hammond others appear refuse offer use gear second luffy attack pirate us hak technique sea king luffy kei others depart royal prince ship boshi tell mermaid luffy well know pirate not immigration go give jim beis message luffy depart"
}