{
    "title": "546 30 \"A Sudden Tragedy! A Gunshot Shuts Down the Future!\"Transliteration: \"Totsuzen no Higeki! Mirai o Tozasu Kyōdan\" (Japanese:突然の悲劇！未来を閉ざす凶弾) Aya Komaki Tomohiro Nakayama May 6, 2012(2012-05-06) May 1, 2022",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_15",
    "transformers_text": "546 30 A Sudden Tragedy A Gunshot Shuts Down the Future Transliteration To tsu zen no Higeki Mira i o To z as u Ky dan Japanese Aya Ko maki Tomohiro Nakayama May 6 2012 2012 05 06 May 1 2022 At the Ryu gu Palace Van der De cken proposes to marry her by using the Tamatebako in an attempt to make S hira hoshi age Otohime returns to Fish man Island with a signed paper from the Celestial Dragons supporting her cause The queen persuades the island's residence to sign her petition She later tells F uk a boshi Man boshi and Ryu boshi that the one who called the Sea Kings was S hira hoshi and she cannot control this ability yet The queen has the three brothers promise that they would protect their sister at all costs Later most of the signatures are burned Just as Otohime attempts to save the rest of the signatures however she gets shot through the heart by an unknown assailant killing her Before succumbing to her wounds the queen requests her family will not resent the assassin and have bravery to achieve their goal",
    "tf_idf_text": "sudden tragedy gunshot shut future transliteration tsu zen higeki mira dan japanese aya maki tomohiro nakayama may may ryu palace van der cken propose marry use tamatebako attempt make hira hoshi age otohime return fish man island sign paper celestial dragon support cause queen persuades island residence sign petition later tell boshi man boshi ryu boshi one call sea king hira hoshi cannot control ability yet queen three brother promise would protect sister cost later signature burn otohime attempt save rest signature however get shot heart unknown assailant kill succumb wound queen request family not resent assassin bravery achieve goal"
}