{
    "title": "556 40 \"Unveiled! The Secret Weapons of the Sunny!\"Transliteration: \"Hatsu Hirō! Sanī-gō no Himitsu Heiki!\" (Japanese:初披露！サニー号の秘密兵器！) Naoyuki Itō Jin Tanaka July 15, 2012(2012-07-15) June 5, 2022",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_15",
    "transformers_text": "556 40 Unveiled The Secret Weapons of the Sunny Transliteration Hats u Hi r San g no Him its u He iki Japanese Nao yuki It J in Tanaka July 15 2012 2012 07 15 June 5 2022 The battle rages on between the Straw Hats and the New Fish man Pirates Sanji and Zoro are competing over who can take down the most fish men Franky decides that this is the perfect time to test out his new vehicles with Us opp Chopper and Nami volunteering to be the pilots Hor dy who is getting increasingly frustrated over seeing fish men getting beaten by humans orders his remaining men to attack S hira hoshi but their attempts are thwarted by the efforts of Robin and Brook Franky then comes riding out of the Thousand Sunny on his newest weapon Kuro sai FR U IV and tramples many of the fish men with it Us opp Chopper and Nami also arrive with another new weapon Brac hio Tank V and take down many of the large fish men Angered by these string of defeats Hor dy unleashes his trump card Suru me and orders it to attack Luffy However Luffy tames Suru me again and orders it to protect S hira hoshi Luffy then rejoins the fight",
    "tf_idf_text": "unveiled secret weapon sunny transliteration hat san iki japanese nao yuki tanaka july june battle rage straw hat new fish man pirate sanji zoro compete take fish men franky decides perfect time test new vehicle opp chopper nami volunteer pilot hor get increasingly frustrate see fish men get beaten human order remain men attack hira hoshi attempt thwart effort robin brook franky come rid thousand sunny new weapon kuro sai trample many fish men opp chopper nami also arrive another new weapon brac hio tank take many large fish men anger string defeat hor unleashes trump card suru order attack luffy however luffy tames suru order protect hira hoshi luffy rejoins fight"
}