{
    "title": "558 42 \"The Noah Closing In! The Fishman Island Facing Destruction!\"Transliteration: \"Noa Sekkin! Gyojin-tō Kaimetsu no Kiki!\" (Japanese:ノア接近！魚人島壊滅の危機！) Tetsuya Endō Tomohiro Nakayama August 5, 2012(2012-08-05) June 12, 2022",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_15",
    "transformers_text": "558 42 The Noah Closing In The Fish man Island Facing Destruction Transliteration No a Sek kin Gy oj in t Kai mets u no Kiki Japanese Tetsuya End Tomohiro Nakayama August 5 2012 2012 08 05 June 12 2022 King Neptune watches in shock over the sight of the giant ship Noah as F uk a boshi asks what is so important about a relic of the past but the king replies that the ship must not be damaged no matter what Luffy and Hor dy continue their fight with Luffy getting the upper hand with Hak i and Hor dy's attacks being ineffective against Luffy Then the ship Noah looms over the plaza and everyone who is fighting in the plaza now notice it As the ship gets closer Wadatsumi falls from the ship and on to the plaza He shouts at Van der De cken to stop the ship or he'll die Van der then shouts out his desire to kill S hira hoshi and everyone in Fish man Island because of her rejection Hor dy is furious over Van der De cken's betrayal S hira hoshi is worried that the ship will kill everyone and so decides to use herself as a lure to divert Noah's course away from Fish man Island Luffy decides to follow her to protect her while Hor dy grabs on to the giant chains to get revenge on his supposed ally",
    "tf_idf_text": "noah close fish man island face destruction transliteration sek kin kai mets kiki japanese tetsuya end tomohiro nakayama august june king neptune watch shock sight giant ship noah boshi ask important relic past king reply ship must not damage matter luffy hor continue fight luffy get upper hand hak hor dy attack ineffective luffy ship noah loom plaza everyone fight plaza notice ship get close wadatsumi fall ship plaza shout van der cken stop ship hell die van der shout desire kill hira hoshi everyone fish man island rejection hor furious van der ckens betrayal hira hoshi worry ship kill everyone decides use lure divert noahs course away fish man island luffy decides follow protect hor grab giant chain get revenge suppose ally"
}