{
    "title": "563 47 \"A Shocking Fact! The True Identity of Hordy!\"Transliteration: \"Shōgeki no Jijitsu! Hōdi no Shōtai!\" (Japanese:衝撃の事実！ホーディの正体！) Naoyuki Itō Jin Tanaka September 9, 2012(2012-09-09) July 10, 2022",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_15",
    "transformers_text": "563 47 A Shocking Fact The True Identity of Hor dy Transliteration Sh geki no Ji jitsu H di no Sh tai Japanese Nao yuki It J in Tanaka September 9 2012 2012 09 09 July 10 2022 On Fish man Island Jim bei and Sanji battle Wadatsumi who inflates in anger crushing his allies Sanji provokes him to grow even larger Meanwhile Neptune's soldiers apologize for failing to protect him and the Minister of the Right officially joins the fight against the New Fish man Pirates allying with the Straw Hats and Jim bei Hammond enslaves human pirates but Robin frees them and defeats Hammond with her Double Clutch technique The freed slaves rebel against the New Fish man Pirates The Minister of the Left orders an island wide evacuation Hor dy's true i den tidy is revealed to be a monster shaped by his environment He claims that Fish men like him are consumed by hatred fearing it will fade so they reject peace and seek to justify their actions against humans When asked what humans did to him Hor dy simply replies nothing believing he and his allies were chosen to punish humans Their hatred he states is baseless and empty With bloodshot eyes and maniacal laughter Hor dy charges at Luffy and S hira hoshi",
    "tf_idf_text": "shock fact true identity hor transliteration geki jitsu tai japanese nao yuki tanaka september july fish man island jim bei sanji battle wadatsumi inflate anger crush ally sanji provokes grow even large meanwhile neptune soldier apologize fail protect minister right officially join fight new fish man pirate ally straw hat jim bei hammond enslaves human pirate robin free defeat hammond double clutch technique free slave rebel new fish man pirate minister leave order island wide evacuation hor dy true den tidy reveal monster shape environment claim fish men like consume hatred fear fade reject peace seek justify action human ask human hor simply reply nothing believe ally choose punish human hatred state baseless empty bloodshot eye maniacal laughter hor charge luffy hira hoshi"
}