{
    "title": "567 51 \"Stop, Noah! Desperate Elephant Gatling!\"Transliteration: \"Tomare Noa! Kesshi no Erefanto Gatoringu!\" (Japanese:止まれノア！決死の象銃乱打！) Takahiro Imamura Jin Tanaka October 7, 2012(2012-10-07) July 24, 2022",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_15",
    "transformers_text": "567 51 Stop Noah Desperate Elephant Gatling Transliteration Tom are No a Kes shi no Ere fan to Gator in gu Japanese Takahiro Imamura J in Tanaka October 7 2012 2012 10 07 July 24 2022 After defeating the New Fish man Pirates the Straw Hat Pirates are relaxing and waiting for Luffy The citizens of Fish man Island are cheering for him to destroy Noah and thus saving them While some citizens evacuate the island some recall how White beard also saved the island at a point in the past and how Luffy reminds them of him Luffy keeps attacking Noah intent on destroying it while Neptune laments being unable to keep the promise with Joy Boy stating there is no choice but to destroy it As Luffy continues to destroy the Noah S hira hoshi intervenes and successfully stops Luffy from destroying the ship He realizes that Noah has been brought to a halt by a group of Sea Kings Luffy is rendered unconscious from the wound and falls into the ship The Sea Kings acknowledge the strength of Luffy's will Luffy has won Noah has stopped and the battle is finally over",
    "tf_idf_text": "stop noah desperate elephant gatling transliteration tom kes shi ere fan gator japanese takahiro imamura tanaka october july defeat new fish man pirate straw hat pirate relax wait luffy citizen fish man island cheer destroy noah thus save citizen evacuate island recall white beard also save island point past luffy reminds luffy keep attack noah intent destroy neptune lament unable keep promise joy boy state choice destroy luffy continue destroy noah hira hoshi intervenes successfully stop luffy destroy ship realize noah brought halt group sea king luffy render unconscious wound fall ship sea king acknowledge strength luffys luffy noah stop battle finally"
}