{
    "title": "578 62 \"Z's Ambition! Luffy vs. Shuzo!\"Transliteration: \"Zetto no Yabō-hen - Rufi tai Shūzo!\" (Japanese:Zの野望編 ルフィVSシューゾ！) Tetsuya Endō Hirohiko Kamisaka December 23, 2012(2012-12-23) August 28, 2022",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_15",
    "transformers_text": "578 62 Z's Ambition Luffy vs Shuzo Transliteration Z et to no Ya b hen Ru fi tai Sh zo Japanese Z VS Tetsuya End Hiro hi ko Kami saka December 23 2012 2012 12 23 August 28 2022 Shuzo orders his men to be launched at the island like torpedoes and sacrifice themselves for him He then attacks Pan z Fry and Lily Luffy faces off against Shuzo but starts to be overpowered by Shuzo and Alpaca cino Lily attempts to go inside Shuzo to explode him by growing to full size but he senses her intentions using Hak i uses Luffy as a shield so that she ends up inside Luffy instead Lilly then takes advantage of the situation and turns Luffy into a giant with a combination of her ability and Luffy's rubbery form Luffy defeats Shuzo and his pet alpaca and the group gets to eat the heavenly food from Pan z Fry before parting ways with Lilly Pans Fry and setting off for another adventure in the New World Meanwhile A in is talking with Zephyr where it is revealed to him that Shuzo lost A in takes the blame but Zephyr does not care since neither Shuzo nor his men will tell the marines anything Therefore they begin their assault on the first island in the New World which leads to Film Z",
    "tf_idf_text": "ambition luffy shuzo transliteration hen tai japanese tetsuya end hiro kami saka december august shuzo order men launch island like torpedo sacrifice attack pan fry lily luffy face shuzo start overpower shuzo alpaca cino lily attempt inside shuzo explode grow full size sens intention use hak us luffy shield end inside luffy instead lilly take advantage situation turn luffy giant combination ability luffys rubbery form luffy defeat shuzo pet alpaca group get eat heavenly food pan fry part way lilly pan fry set another adventure new world meanwhile talk zephyr reveal shuzo lose take blame zephyr not care since neither shuzo nor men tell marine anything therefore begin assault first island new world lead film"
}