{
    "title": "en.wikipedia.org_wiki_Wikipedia_Contents_Portals",
    "url": "https://en.wikipedia.org/wiki/Wikipedia:Contents/Portals",
    "transformers_text": "Wikipedia's contents: Portals\n\nPortals complement main topics in Wikipedia, and expand upon topics by introducing the reader to key articles, images, and categories that further describe the subject and its related topics. Portals also assist in helping editors to find related projects and things they can do to improve Wikipedia, and provide a unique way to navigate Wikipedia topics.\n\nAt present, there are 551 portals.\n\nGeneral reference Culture and the arts Geography and places Health and fitness History and events Human activities Mathematics and logic Natural and physical sciences People and self Philosophy and thinking Religion and belief systems Society and social sciences Technology and applied sciences\n\nThe arts\n\nFood\n\nRecreation and entertainment\n\nContinents\n\nRegions\n\nCountries\n\nTerritories\n\nProvinces and states\n\nCounties\n\nCities\n\nSupranational\n\nImpact of human activity\n\nBiological science\n\nPhysical sciences\n\nAbrahamic religions\n\nDharmic religions\n\nTraditional religions\n\nOther\n\nSociety",
    "tf_idf_text": "wikipedias content portal portal complement main topic wikipedia expand upon topic introduce reader key article image category describe subject related topic portal also assist help editor find related project thing improve wikipedia provide unique way navigate wikipedia topic present portal general reference culture arts geography place health fitness history event human activity mathematics logic natural physical science people self philosophy think religion belief system society social science technology apply science art food recreation entertainment continent region country territory province state county city supranational impact human activity biological science physical science abrahamic religion dharmic religion traditional religion society"
}