{
    "title": "en.wikipedia.org_wiki_Tokyo_One_Piece_Tower",
    "url": "https://en.wikipedia.org/wiki/Tokyo_One_Piece_Tower",
    "transformers_text": "Tokyo One Piece Tower was an indoor theme park for the popular Japanese manga series, One Piece . It opened on March 13, 2015 [ 1 ] inside Tokyo Tower . After its opening, it underwent a partial renovation and reopened on June 18, 2016. [ 2 ] It offered several games and attractions based on characters of the Straw Hat Crew from One Piece , entertainment shows, merchandise shops and themed restaurants, and seasonal events and campaigns.\n\nThe park closed permanently on July 31, 2020, due to the impact of the COVID-19 pandemic on its management. [ 3 ] [ 4 ] [ 5 ]\n\nThe park was themed as Tongari Island (トンガリ島) in the New World; after the Straw Hat Crew landed there, they created games and attractions for their fans with the islanders. The island's leader is Tongari Den Den Mushi who frequently appeared as the guide in some attractions and the website. Tongari (トンガリ) means \"pointed\" or \"sharp\" in Japanese and it refers to the shape of Tokyo Tower.\n\nIn 2016, it ranked 7th in TripAdvisor 2016 Traveler's Choice Top 10 Amusement Parks [ 6 ] in the Japan region.\n\nAn experiential attraction where the famous scenes of Straw Hat Crew adventure from the manga series were projected onto a 360 degree omnidirectional screen. It was located on the third floor, the entrance floor of One Piece Tower, and was the first attraction to welcome visitors to the island.\n\nA walkthrough attraction that followed the history of the protagonist, Monkey D. Luffy and his fellow characters. It was located on the 5th floor. There were life-size statues of characters, miniatures, and exhibition panels.\n\nThere was a movie theater with a wide screen at the end showing an original short film only available at Tokyo One Piece Tower.\n\nAn interactive game based on one of Straw Hat Crew, Roronoa Zoro located on the fourth floor. Inside was a Dojo that Zoro established and the players must slash down cannons fired from the screen in front to defeat Marines with a sword using Zoro's skills.\n\nAlso, Zoro's and other characters' swords and weapons were displayed on the wall inside this attraction.\n\nAn interactive attraction based on the navigator of Straw Hat Crew, Nami located on the fourth floor. It was a casino game where the players bet a certain amount of Berries, the world currency in One Piece, for a three-point match to win a jackpot. The winners with over a certain amount of Berries received a VIP card.\n\nAn interactive game based on one of Straw Hat Crew, Usopp located on the fourth floor. Players shoot the Marines with a slingshot, Usopp's iconic weapon for a given time. The last enemy was the World Government.\n\nAn interactive walkthrough attraction guided by one of Straw Hat Crew, Tony Tony Chopper located on the fourth floor. The whole attraction imitated the interior of Straw Hat Crew's second ship, Thousand Sunny. It included the kitchen and dining, Nami and Robin's bedroom, and other facilities inside Thousand Sunny.\n\nAn interactive game based on one of Straw Hat Crew, Nico Robin located on the fourth floor involving the whole park. The players were given one Transponder Snail to find many ancient characters hidden all over the park to finally discover Poneglyph in the ancient remains.\n\nAn area dedicated to the shipwright, Franky on the fourth floor. There was a pinball machine called \"Franky's Ball Run\" in the shape of Franky, a colorful children’s area with toys, and a small cafe called Franky's Cola Bar offering light meals and beverages.\n\nA haunted house based on one of Straw Hat Crew, Brook. The players were given one salt ball (塩玉) to defeat zombies roaming inside the haunted house.\n\nThere were numerous photo spots inside the park including characters’ life-size statues, portraits, special exhibitions, etc.\n\nOne Piece Live Attraction original entertainment show where live One Piece characters unfolded an adventurous story on stage. The theater was located on the 5th floor. Approximately four to six shows were held every day. [ 8 ] The storyline changes seasonally.\n\nA merchandise shop inside the park on the third floor offering exclusive goods and items with original designs only at Tokyo One Piece Tower.\n\nA One Piece official merchandise shop outside the park on the first floor of Tokyo Tower offering One Piece goods and items. There were exclusive items only on sale at Tokyo Tower.\n\nA small cafe inside the park managed by cola lover Franky. It offered various light meals and beverages, and some tables and chairs to rest.\n\nA library cafe located on the first floor of Tokyo Tower that offered foods and beverages inspired by different characters and stories from One Piece. It had more than six hundred books and comics from the world related to ONE PIECE, including original manga series, for visitors to read freely while they eat and rest.\n\nIt offered special monthly birthday menus for a certain character from One Piece. Also, it often collaborates with other events such as Ichiban Kuji [ 9 ]\n\nIt is open from 10 a.m. to 10 p.m.\n\nA restaurant run by Straw Hat Crew's cook, Sanji located on the ground floor of Tokyo Tower beside Cafe Mugiwara. It offered various meals in buffet style from 11 a.m. to 3 p.m. (maximum 70 minutes stay) and a la carte style from 3 p.m. to 10 p.m. including a course menu and special events related menus.\n\n\"ORESAMA (俺様)\" is a narcissistic way of saying \"me\" in Japanese and the first personal pronoun Sanji refers to himself in the One Piece series. His statue stood between Mugiwara Cafe and Sanji's ORESAMA Restaurant.\n\nThe interiors imitated various items or scenes from ONE PIECE such as a mast, prison bars, etc. for visitors to indulge in the world of ONE PIECE.",
    "tf_idf_text": "tokyo one piece tower indoor theme park popular japanese manga series one piece open march inside tokyo tower open underwent partial renovation reopen june offer several game attraction base character straw hat crew one piece entertainment show merchandise shop theme restaurant seasonal event campaign park close permanently july due impact covid pandemic management park theme tongari island new world straw hat crew land create game attraction fan islander island leader tongari den den mushi frequently appear guide attraction website tongari mean point sharp japanese refers shape tokyo tower rank tripadvisor traveler choice top amusement park japan region experiential attraction famous scene straw hat crew adventure manga series project onto degree omnidirectional screen locate third floor entrance floor one piece tower first attraction welcome visitor island walkthrough attraction follow history protagonist monkey luffy fellow character locate floor lifesize statue character miniature exhibition panel movie theater wide screen end show original short film available tokyo one piece tower interactive game base one straw hat crew roronoa zoro locate fourth floor inside dojo zoro establish player must slash cannon fire screen front defeat marine sword use zoros skill also zoros character sword weapon display wall inside attraction interactive attraction base navigator straw hat crew nami locate fourth floor casino game player bet certain amount berry world currency one piece threepoint match win jackpot winner certain amount berry receive vip card interactive game base one straw hat crew usopp locate fourth floor player shoot marine slingshot usopps iconic weapon give time last enemy world government interactive walkthrough attraction guide one straw hat crew tony tony chopper locate fourth floor whole attraction imitate interior straw hat crew second ship thousand sunny include kitchen din nami robin bedroom facility inside thousand sunny interactive game base one straw hat crew nico robin locate fourth floor involve whole park player give one transponder snail find many ancient character hide park finally discover poneglyph ancient remain area dedicate shipwright franky fourth floor pinball machine call frankys ball run shape franky colorful childrens area toy small cafe call frankys cola bar offering light meal beverage haunt house base one straw hat crew brook player give one salt ball defeat zombie roam inside haunt house numerous photo spot inside park include character lifesize statue portrait special exhibition etc one piece live attraction original entertainment show live one piece character unfold adventurous story stage theater locate floor approximately four six show hold every day storyline change seasonally merchandise shop inside park third floor offer exclusive good item original design tokyo one piece tower one piece official merchandise shop outside park first floor tokyo tower offer one piece good item exclusive item sale tokyo tower small cafe inside park manage cola lover franky offer various light meal beverage table chair rest library cafe locate first floor tokyo tower offer food beverage inspire different character story one piece six hundred book comic world relate one piece include original manga series visitor read freely eat rest offer special monthly birthday menus certain character one piece also often collaborate event ichiban kuji open restaurant run straw hat crew cook sanji locate ground floor tokyo tower beside cafe mugiwara offer various meal buffet style maximum minute stay carte style include course menu special event related menu oresama narcissistic way say japanese first personal pronoun sanji refers one piece series statue stand mugiwara cafe sanjis oresama restaurant interior imitate various item scenes one piece mast prison bar etc visitor indulge world one piece"
}