{
    "title": "en.wikipedia.org_wiki_Tottemo!_Luckyman",
    "url": "https://en.wikipedia.org/wiki/Tottemo!_Luckyman",
    "transformers_text": "Tottemo! Luckyman ( Japanese : とっても! ラッキーマン , Hepburn : Tottemo! Rakkīman ; lit. \"Absolutely! Luckyman\") is a Japanese manga series written and illustrated by Hiroshi Gamo . It was serialized in Shueisha 's shōnen manga magazine Weekly Shōnen Jump from August 1993 to July 1997, with its chapters collected in 16 tankōbon volumes. The series follows the adventures of a bizarre superhero named Luckyman and his fights against various aliens and other enemies threatening the Earth.\n\nA 50-episode anime television series adaptation by studio Pierrot was broadcast on TV Tokyo between April 1994 and March 1995. Two video games Game Boy and Super Famicom consoles have been released, and the titular character Luckyman has been featured in the \"Jump\" crossover video games Jump Ultimate Stars and J-Stars Victory VS .\n\nYōichi Tsuitenai is the unluckiest boy in his hometown. One day, his luck truly ran out when he was crushed by an alien spaceship, killing him. But in this time of need, he was discovered by Luckyman, a cosmic superhero, who gives him the superpower of being extremely lucky. Now Yōichi, as Luckyman, must defend the Earth from aliens invading to conquer it, with the help of his sidekick, Endeavorman, their friend Superstarman, and three others, Victoryman, Friendshipman, and Geniusman.\n\nThe Best 16 Super Heroes ( ナイナイシックスティーン , Nai Nai Shikkusutīn ) , is an elite team of 16 special heroes assembled by the chairman of the Hero Committee, an organization for super heroes, located on a hero-populated planet called the Hero Star. The team is formed up of the main team of six heroes selected by the Chairman as elites to fight aliens on Earth, and 10 contestants from the 1053rd Hero Tournament that all won. \" Nai Nai ( ナイナイ ) \" is an onomatopoeia for the sound created when the 16 heroes all fire their beams at something.\n\nThe Hand Squadron Finger Rangers ( お手手戦隊指レンジャー , Otete Sentai Yubi Renjā ) are the five villains in Yotchan's team. They fight in cylindrical metal suits, each of a different color, and act as fingers for a giant hand. Eventually, these characters all die, except for Geniusman, Speedman, and Yotchan.\n\nWritten and illustrated by Hiroshi Gamo , Tottemo! Luckyman debuted with a one-shot in Shueisha 's shōnen manga magazine Weekly Shōnen Jump on April 12, 1993, and was later serialized in the same magazine from August 16 of that same year to July 7, 1997. [ 2 ] Shueisha collected its chapters in sixteen tankōbon volumes published between February 1994 and October 1997. [ 3 ] [ 4 ] Shueisha re-published the series in eight digital volumes, released on June 29, 2012. [ 5 ] [ 6 ]\n\nA 50-episode anime television series, animated by studio Pierrot and directed by Osamu Nabeshima [ ja ] , was broadcast on TV Tokyo from April 6, 1994, to March 23, 1995. [ 7 ] [ 8 ]\n\nA video game, titled Tottemo! Luckyman: Everyone Loves Lucky Cookie!! ( とっても! ラッキーマン ラッキークッキーみんな大好きー!! , Tottemo! Rakkīman: Rakkī Kukkī Minna Daisukī!! ; \"Absolutely! Luckyman: Everyone Loves Lucky Cookie!!\") , was developed by Bandai and released for the Game Boy on September 22, 1994. [ 9 ] Another video game, titled Tottemo! Luckyman: Lucky Cookie Roulette Assault!! ( とっても! ラッキーマン ラッキークッキールーレットで突撃ー!! , Tottemo! Rakkīman: Rakkī Kukkī Rūretto de Totsugekī!! ; \"Absolutely! Luckyman: Lucky Cookie Roulette Assault!!\") , also developed by Bandai, was released for the Super Famicom on June 30, 1995. [ 10 ]\n\nLuckyman was featured as a playable character in two Jump crossover fighting games, Jump Ultimate Stars for the Nintendo DS , released on November 23, 2006; [ 11 ] and J-Stars Victory VS for the PlayStation 3 , PlayStation 4 and PlayStation Vita , released on March 19, 2014, in Japan, [ 12 ] and in June 2015 in Europe and North America. [ 13 ]",
    "tf_idf_text": "tottemo luckyman japanese hepburn tottemo rakkman light absolutely luckyman japanese manga series write illustrated hiroshi gamo serialize shueisha shnen manga magazine weekly shnen jump august july chapter collect tankbon volume series follow adventure bizarre superhero name luckyman fight various alien enemy threaten earth episode anime television series adaptation studio pierrot broadcast tokyo april march two video game game boy super famicom console release titular character luckyman feature jump crossover video game jump ultimate star jstars victory yichi tsuitenai unluckiest boy hometown one day luck truly ran crush alien spaceship kill time need discover luckyman cosmic superhero give superpower extremely lucky yichi luckyman must defend earth alien invade conquer help sidekick endeavorman friend superstarman three others victoryman friendshipman geniusman best super hero nai nai shikkusutn elite team special hero assemble chairman hero committee organization super hero locate heropopulated planet call hero star team form main team six hero select chairman elites fight alien earth contestant hero tournament nai nai onomatopoeia sound create hero fire beam something hand squadron finger ranger otete sentai yubi renj five villain yotchans team fight cylindrical metal suit different color act finger giant hand eventually character die except geniusman speedman yotchan write illustrated hiroshi gamo tottemo luckyman debut oneshot shueisha shnen manga magazine weekly shnen jump april later serialize magazine august year july shueisha collect chapter sixteen tankbon volume publish february october shueisha republish series eight digital volume release june episode anime television series animate studio pierrot direct osamu nabeshima broadcast tokyo april march video game title tottemo luckyman everyone love lucky cookie tottemo rakkman rakk kukk minna daisuk absolutely luckyman everyone love lucky cookie develop bandai release game boy september another video game title tottemo luckyman lucky cookie roulette assault tottemo rakkman rakk kukk rretto totsugek absolutely luckyman lucky cookie roulette assault also develop bandai release super famicom june luckyman feature playable character two jump crossover fight game jump ultimate star nintendo release november jstars victory playstation playstation playstation vita release march japan june europe north america"
}