{
    "title": "en.wikipedia.org_wiki_From_TV_Animation_-_One_Piece__Grand_Battle!",
    "url": "https://en.wikipedia.org/wiki/From_TV_Animation_-_One_Piece:_Grand_Battle!",
    "transformers_text": "From TV Animation - One Piece: Grand Battle! [ a ] is a Japanese fighting video game developed by Ganbarion and published by Bandai . It is the first game in the One Piece: Grand Battle series and the second game to be based on the One Piece manga and anime . This game's introduction uses the theme song \"We Are!\" [ b ] from the One Piece anime .\n\nA boy named Monkey D. Luffy goes on a journey to become king of the pirates. During his journey he fights many foes and little by little gathers a strong and stable crew. This game is based on the East blue saga and Whiskey Peak Arc in the One Piece anime.\n\nThe gameplay involves two characters fighting it out in a 3D arena with items and obstacles. Items can be used to help the player beat the other character and obstacles only get in the way of the characters. In Event Battle, once the player has beaten enough enemies, each character's rival will appear. Event Battle is completed when the rival is defeated.\n\nThis game had gotten a Gold Reward at the PlayStation Awards 2002 since it had shipped over 600,000 copies after its first year. [ 2 ]",
    "tf_idf_text": "animation one piece grand battle japanese fight video game develop ganbarion publish bandai first game one piece grand battle series second game base one piece manga anime game introduction use theme song one piece anime boy name monkey luffy go journey become king pirate journey fight many foe little little gather strong stable crew game base east blue saga whiskey peak arc one piece anime gameplay involve two character fight arena item obstacle item use help player beat character obstacle get way character event battle player beat enough enemy character rival appear event battle complete rival defeated game gotten gold reward playstation award since shipped copy first year"
}