{
    "title": "en.wikipedia.org_wiki_Cowa!",
    "url": "https://en.wikipedia.org/wiki/Cowa!",
    "transformers_text": "Cowa! (stylized in all caps ) is a Japanese manga series written and illustrated by Akira Toriyama . It was serialized in Shueisha 's Weekly Shōnen Jump from 1997 to 1998, with the fourteen chapters collected into a single tankōbon volume. The story follows the child monsters Paifu, José and Arpon, and the human Maruyama, as they travel to get medicine to save their town from a deadly flu. Viz Media released the single volume in North America in July 2008. Cowa! was generally well-received by critics, and was nominated for the 2009 Eisner Award for Best Publication for Kids .\n\nPaifu, a mischievous monster boy, lives in harmony with his friend José and rival Arpon. This tranquil village life is interrupted by the spread of a Monster Flu ( お化け風邪 , Obake Kaze ) , which kills monsters within a month. The doctor reveals that the cure can be created by a witch that resides at the top of Horned-Owl Mountain. Due to the adult monsters being sick, Paifu, José and Arpon volunteer to make the trip with the help of Maruyama, a human who lives near the town and is widely feared due to rumors that he killed a man. Paifu tricks him by telling him that the town will pay him a million yen in exchange for his accompaniment. During the trip, the children encounter several thugs, whom Maruyama easily defeats, and they soon learn that this is a former sumo wrestler .\n\nIn the last village before reaching the mountain, Maruyama stops to buy food. At that moment, Paifu witnesses an assault on an old man and stops the assailant. As they are about to reach Mount Owl, Arpon suddenly falls ill. Their search for someone to take care of him leads them to the family of the man who was assaulted, who gladly agree to take care of Arpon. When the group reaches the forest around the mountain, they encounter Baroaba, whom they manage to defeat when Paifu learns to whistle, the monster's weakness. When Baroaba realizes that they are going to see the witch, he helps them reach her house. Before entering they are greeted by the witch's servant, an oni named Leonardo, who grants them entry only after they answer a riddle. The group retrieves the medicine and begins their descent down the mountain, during which Maruyama accidentally slips and falls; Paifu narrowly saves his life by learning to fly.\n\nOn the way back, Maruyama is disappointed to learn that Paifu lied about the monetary reward, but decides that Paifu's rescue was sufficient compensation. The group's return is heralded with a party, but Maruyama leaves, claiming not to enjoy such activities. Paifu takes the opportunity to explain to everyone what has happened, and together they manage to fix an old ghost ship to present to Maruyama, fulfilling his wish to obtain one with the promised money.\n\nCowa! has its origins in Bubul of Demon Village ( 魔人村のBUBUL , Majin-Mura no Buburu ) , a one-shot Akira Toriyama drew for the revived Jump Readers' Cup competition in 1997. [ 6 ] Toriyama, who had done only a few one-shots since finishing Dragon Ball in 1995, won handily; it was his first win since Pola & Roid took the top spot in 1981. After winning, Toriyama said he was thinking of creating a \"more developed\" form of Bubul of Demon Village . [ 6 ] He re-tooled the character designs and setting of the one-shot to suit a new series, as detailed in the issue before Cowa! ' s start. [ citation needed ]\n\nDespite previously claiming to be done with weekly serials, Toriyama decided to draw Cowa! when he learned his editor would be Kazuhiko Torishima and that he could do things his own way. [ 7 ] Unlike both Dr. Slump and Dragon Ball , where he never skipped an issue, he drew Cowa in a three-weeks-on, one-week-off pattern, which afforded him time to rest and work more slowly. Toriyama stated he wanted to draw everything himself, forgoing the customary use of an assistant, even though he had pain in his arm. [ 7 ] The story came about from wanting to take a storybook type approach and have the main character be an \"unlovable grumpy guy.\" [ 7 ]\n\nWritten and illustrated by Akira Toriyama , Cowa! was serialized in Weekly Shōnen Jump magazine from issue #48 of 1997 to #15 of 1998. The fourteen chapters were collected into one tankōbon volume that was released on May 1, 1998 by Shueisha . [ 8 ]\n\nViz Media licensed Cowa! for English release in North America on July 1, 2008. [ 9 ] Their graphic novel edition retained the first chapter in color. [ 1 ] It has also been released in other countries, such as in France by Glenat , Spain by Planeta DeAgostini , South Korea by Daewon C.I. and Malaysia Comics House .\n\nAbout.com 's Deb Aoki listed Cowa! as the \"Best New All Ages Manga\" of 2008, calling it \"clever and charming enough to entertain adults as well as younger readers.\" [ 10 ] Anime News Network 's Carl Kimlinger disagreed, claiming the plot is not complex enough to appeal to adults. He also wished Viz would have kept the other few chapters that were originally colored as such instead of just the first, as those particular ones were hard to follow in black and white. However, he wrote that \"Makoleen's character elevates what might have been a simple children's adventure to a gentle fable about acceptance and understanding.\" and praised the humor. [ 1 ] A.E. Sparrow of IGN gave the series an 8.6 out of 10 and referred to it as a \"self-contained mini-epic.\" On the humor he said \"the jokes come at you unapologetically and you're either going to catch them or write them off.\" [ 11 ] Viz Media's English release of Cowa! was nominated for the Eisner Award for Best Publication for Kids in 2009. [ 12 ]",
    "tf_idf_text": "cowa stylize cap japanese manga series write illustrated akira toriyama serialize shueisha weekly shnen jump fourteen chapter collect single tankbon volume story follow child monster paifu jos arpon human maruyama travel get medicine save town deadly flu viz medium release single volume north america july cowa generally wellreceived critic nominated eisner award best publication kid paifu mischievous monster boy live harmony friend jos rival arpon tranquil village life interrupt spread monster flu obake kaze kill monster within month doctor reveals cure create witch resides top hornedowl mountain due adult monster sick paifu jos arpon volunteer make trip help maruyama human life near town widely fear due rumor kill man paifu trick tell town pay million yen exchange accompaniment trip child encounter several thug maruyama easily defeat soon learn former sumo wrestler last village reach mountain maruyama stop buy food moment paifu witness assault old man stop assailant reach mount owl arpon suddenly fall ill search someone take care lead family man assault gladly agree take care arpon group reach forest around mountain encounter baroaba manage defeat paifu learn whistle monster weakness baroaba realize go see witch help reach house enter greet witchs servant oni name leonardo grant entry answer riddle group retrieve medicine begin descent mountain maruyama accidentally slip fall paifu narrowly save life learn fly way back maruyama disappointed learn paifu lie monetary reward decide paifus rescue sufficient compensation group return herald party maruyama leave claim not enjoy activity paifu take opportunity explain everyone happen together manage fix old ghost ship present maruyama fulfil wish obtain one promise money cowa origins bubul demon village bubul majinmura buburu oneshot akira toriyama draw revive jump reader cup competition toriyama do oneshots since finish dragon ball handily first win since pola roid take top spot win toriyama say think create developed form bubul demon village retool character design set oneshot suit new series detail issue cowa start citation need despite previously claim do weekly serial toriyama decide draw cowa learn editor would kazuhiko torishima could thing way unlike slump dragon ball never skip issue draw cowa threeweekson oneweekoff pattern afford time rest work slowly toriyama state want draw everything forgo customary use assistant even though pain arm story come want take storybook type approach main character unlovable grumpy guy write illustrated akira toriyama cowa serialize weekly shnen jump magazine issue fourteen chapter collect one tankbon volume release may shueisha viz medium license cowa english release north america july graphic novel edition retain first chapter color also release country france glenat spain planeta deagostini south korea daewon malaysia comic house aboutcom deb aoki list cowa best new age manga call clever charm enough entertain adult well young reader anime news network carl kimlinger disagree claim plot not complex enough appeal adult also wish viz would keep chapter originally color instead first particular one hard follow black white however write makoleens character elevates might simple childrens adventure gentle fable acceptance understand praised humor sparrow ign give series refer selfcontained miniepic humor say joke come unapologetically youre either go catch write viz medias english release cowa nominate eisner award best publication kid"
}