{
    "title": "en.wikipedia.org_wiki_One_Piece__Pirate_Warriors_(video_game)",
    "url": "https://en.wikipedia.org/wiki/One_Piece:_Pirate_Warriors_(video_game)",
    "transformers_text": "One Piece: Pirate Warriors [ b ] is an action video game developed by Omega Force and published by Bandai Namco Games for PlayStation 3 . [ 3 ] It was released on March 1, 2012, in Japan, September 21, 2012, in Europe and September 25, 2012, in North America. [ 4 ] The game was developed in commemoration of the 15th anniversary of the One Piece manga by Eiichiro Oda and its anime adaptation . Pirate Warriors was also the first title in the One Piece video game franchise which was released on a PlayStation system since One Piece: Grand Adventure in 2006.\n\nAs with the rest of the franchise, Pirate Warriors follows the adventures of Monkey D. Luffy , a young boy who accidentally eats the Gum-Gum Fruit and organizes a diverse crew of pirates called the Straw Hats to search for the titular treasure. On his journey, Luffy makes several new friends, and battles a wide variety of villains. A sequel, One Piece: Pirate Warriors 2 , was released in March 2013.\n\nPirate Warriors is an action game incorporating elements from both the Dynasty Warriors series and the One Piece series. [ 3 ] The game's story mode, Main Log , allows the player to play through the storyline. The Adventure mode uses Luffy to play through the events of the One Piece series and the battle mode allows the player to use characters in battles. [ 5 ] In Another Log , the player can play through a character's storyline. With it are several stories exclusive to the game. [ 6 ]\n\nThe game features a total of 13 playable characters. Other characters from the series also appear as non-playable enemies .\n\nThere are 16 chapters in Main Log mode. The cut-scenes were reused in One Piece: Pirate Warriors 3 and re-rendered in One Piece: Pirate Warriors 4 .\n\nThe concept and development for Pirate Warriors began with a meeting between Tecmo Koei producer Hisashi Koinuma and Namco Bandai producer Koji Nakajima. Nakajima read the One Piece manga and also played the Dynasty Warriors video games during his youth. The producers eventually realized that an action game involving Luffy fighting with sailors in a video game would be interesting. Koinuma said that the developers wanted to \"express the charm of original author Eiichiro Oda 's manga art as best as we can\". Koinuma also wanted a \"look that worked well in the game\" and to make it \"approachable while still allowing video game experts to put their own techniques into it.\" [ 7 ]\n\nAccording to Shin Unozawa, vice president of D3 Publisher , the game's title was originally just One Piece Musou before Eiichiro Oda himself changed it. [ citation needed ] Oda was also very impressed by the quality of the character models when he first saw the demo movie, believing the game's cinematics to be on par with those seen in a full budget movie. As a result, he turned down the development team's request to illustrate the game's cover image, believing that the models alone were enough to showcase the game. [ citation needed ]\n\nThe game was first announced in the early September issue of the Weekly Shōnen Jump magazine. The announcement featured screenshots of Monkey D. Luffy , highlighting the game's mechanics. [ 8 ] In September 2011, Namco Bandai Games issued a press release announcing that the game would be developed by Tecmo Koei's Omega Force division. [ 9 ] Pirate Warriors was first shown at the 2011 Tokyo Game Show convention along with One Piece: Gigant Battle 2! New World . [ 10 ]\n\nIn late December 2011, Namco Bandai filed a trademark in Europe for Pirate Warriors . [ 11 ] In early February 2012, the company also filed the Pirate Warriors trademark in the United States. [ 12 ] On February 13, Namco Bandai announced that the development of Pirate Warriors was finished at their press conference and showed another trailer of the game. Namco Bandai president Shin Unozawa revealed that the game had 500,000 pre-orders. At the same event, Serina of SDN48 cosplayed as Boa Hancock. [ 13 ] On April 11, 2012, Namco Bandai revealed that Pirate Warriors would be released for North America on September 25, 2012, and Europe on September 21, 2012, with plans for digital download on the PlayStation Network and distribution plans with retailers. [ 1 ]\n\nThe game was released on March 1, 2012, in Japan. In the early December issue of Weekly Shōnen Jump , it announced that Pirate Warriors would be bundled in Japan with the Treasure Box, a collector's edition which includes the game's soundtrack, 15 collectible pins, a serial code to download nine custom themes featuring individual members of the Straw Hat Pirates, and a book featuring character and CG-rendered artwork and environments from the game's production. [ 14 ] Namco Bandai and Tecmo Koei also confirmed that the game would be bundled with a gold PlayStation 3 with a print of Luffy and the Pirate Warriors logo on it. [ 15 ] Sony Computer Entertainment president Hiroshi Kawano revealed that the PlayStation 3 was used as a pressing process. [ 13 ] [ 16 ]\n\nA sequel, One Piece: Pirate Warriors 2 , was released for PlayStation 3 and PlayStation Vita in Japan on March 20, 2013. The PlayStation 3 version was later released in Europe on August 30, 2013, and as a digital-only release in North America on September 3, 2013. [ 17 ] A third game, One Piece: Pirate Warriors 3 , was released for PlayStation 3, PlayStation Vita, PlayStation 4 , and Microsoft Windows on March 26, 2015, in Japan, and later for Nintendo Switch on December 21, 2017, in Japan. [ 18 ] And a fourth game, One Piece: Pirate Warriors 4 , was released for PlayStation 4, Xbox One , Nintendo Switch, and Microsoft Windows on March 27, 2020.\n\nThe game received \"mixed\" reviews according to the review aggregation website Metacritic . [ 19 ]\n\nThe game was rated 36 out of 40 by the Japanese gaming magazine Famitsu . [ 21 ] The game was a huge success in Japan, in its first week it sold over 655,774 copies [ 29 ] and by December 2012, the game has shipped over 1.2 million units worldwide. [ 30 ]",
    "tf_idf_text": "one piece pirate warrior action video game develop omega force publish bandai namco game playstation release march japan september europe september north america game develop commemoration anniversary one piece manga eiichiro oda anime adaptation pirate warrior also first title one piece video game franchise release playstation system since one piece grand adventure rest franchise pirate warrior follow adventure monkey luffy young boy accidentally eat gumgum fruit organize diverse crew pirate call straw hat search titular treasure journey luffy make several new friend battle wide variety villain sequel one piece pirate warrior release march pirate warrior action game incorporate element dynasty warrior series one piece series game story mode main log allow player play storyline adventure mode use luffy play event one piece series battle mode allow player use character battle another log player play character storyline several story exclusive game game feature total playable character character series also appear nonplayable enemy chapter main log mode cutscenes reuse one piece pirate warrior rerendered one piece pirate warrior concept development pirate warrior begin meet tecmo koei producer hisashi koinuma namco bandai producer koji nakajima nakajima read one piece manga also play dynasty warrior video game youth producer eventually realize action game involve luffy fight sailor video game would interest koinuma say developer want express charm original author eiichiro oda manga art best koinuma also want look work well game make approachable still allow video game expert put technique accord shin unozawa vice president publisher game title originally one piece musou eiichiro oda change citation need oda also impressed quality character model first saw demo movie believe game cinematics par see full budget movie result turn development team request illustrate game cover image believing model alone enough showcase game citation need game first announce early september issue weekly shnen jump magazine announcement feature screenshots monkey luffy highlight game mechanic september namco bandai game issue press release announcing game would develop tecmo koeis omega force division pirate warrior first show tokyo game show convention along one piece gigant battle new world late december namco bandai file trademark europe pirate warrior early february company also file pirate warrior trademark united state february namco bandai announce development pirate warrior finish press conference show another trailer game namco bandai president shin unozawa reveal game preorders event serina sdn cosplayed boa hancock april namco bandai reveal pirate warrior would release north america september europe september plan digital download playstation network distribution plan retailer game release march japan early december issue weekly shnen jump announce pirate warrior would bundle japan treasure box collector edition include game soundtrack collectible pin serial code download nine custom theme feature individual member straw hat pirate book feature character cgrendered artwork environment game production namco bandai tecmo koei also confirm game would bundle gold playstation print luffy pirate warrior logo sony computer entertainment president hiroshi kawano reveal playstation use press process sequel one piece pirate warrior release playstation playstation vita japan march playstation version later release europe august digitalonly release north america september third game one piece pirate warrior release playstation playstation vita playstation microsoft window march japan later nintendo switch december japan fourth game one piece pirate warrior release playstation xbox one nintendo switch microsoft windows march game receive mixed review accord review aggregation website metacritic game rat japanese game magazine famitsu game huge success japan first week sell copy december game ship million unit worldwide"
}