{
    "title": "en.wikipedia.org_wiki_Hima-Ten!",
    "url": "https://en.wikipedia.org/wiki/Hima-Ten!",
    "transformers_text": "Hima-Ten! ( Japanese : ひまてん! , Hepburn : Himaten! ) is a Japanese manga series written and illustrated by Genki Ono [ ja ] . The series began publication in Shueisha 's Weekly Shōnen Jump magazine in July 2024. It has been compiled into five tankōbon volumes as of September 2025 [update] .\n\nThe series follows Tenichi Iemori, a 16-year-old high school student who works part-time as a house cleaner. On his first day as a second-year student, Himari Yoshino, a popular model who owns a popular makeup line, transfers to his school. He then discovers that he was hired to clean Himari's apartment on a regular basis, as contrary to Himari's public persona, she is unable to keep her place clean.\n\nHima-Ten! is written and illustrated by Genki Ono [ ja ] , who previously made the manga series Full Drive [ ja ] in 2017. It began serialization in Shueisha 's Weekly Shōnen Jump magazine on July 8, 2024. [ 4 ] [ 1 ] The series is also published in English on Manga Plus and Viz Media 's website. [ 5 ] The series' first tankōbon volume was released on November 1, 2024. [ 6 ] To promote the series, three voice comics covering the first three chapters, featuring Shūichirō Umeda as Tenichi and Miku Itō as Himari, respectively, were posted on the official Shōnen Jump YouTube channel. [ 2 ] [ 3 ]\n\nThe following chapters have not been collected into a tankōbon volume yet. They initially were published in Weekly Shōnen Jump .\n\nThe series has been nominated for the 11th Next Manga Awards in the print category in 2025. [ 13 ]",
    "tf_idf_text": "himaten japanese hepburn himaten japanese manga series write illustrated genki ono series begin publication shueisha weekly shnen jump magazine july compile five tankbon volume september update series follow tenichi iemori yearold high school student work parttime house clean first day secondyear student himari yoshino popular model own popular makeup line transfer school discovers hire clean himaris apartment regular basis contrary himaris public persona unable keep place clean himaten write illustrated genki ono previously make manga series full drive begin serialization shueisha weekly shnen jump magazine july series also publish english manga plus viz medium website series first tankbon volume release november promote series three voice comic cover first three chapter feature shichir umeda tenichi miku himari respectively post official shnen jump youtube channel follow chapter not collect tankbon volume yet initially publish weekly shnen jump series nominate next manga award print category"
}