{
    "title": "en.wikipedia.org_wiki_2025_Malagasy_protests",
    "url": "https://en.wikipedia.org/wiki/2025_Malagasy_protests",
    "transformers_text": "Government of Madagascar\n\nPro-Rajoelina groups\n\nNo centralized leadership\n\nAndry Rajoelina Christian Ntsay Mamy Ravatomanga [ 11 ] Jean Herbert Andriantahiana Rakotomalala [ 12 ] Richard Ravalomanana Angelo Ravelonarivo [ 12 ]\n\nProtests have occurred across Madagascar since September 2025, focused in the capital of Antananarivo . The protests were triggered by frequent water and power outages in the city. Homes of high-profile politicians have been targeted. The protests have also spread to other cities across Madagascar. [ 14 ]\n\nSince 25 September, 22 people including protesters and civilians have been killed due to both security forces' response or due to looting and general disorder. Commercial areas and public facilities of major cities have experienced looting and vandalism. After removing his energy minister on 26 September, Malagasy President Andry Rajoelina announced the dissolution of the government of Prime Minister Christian Ntsay on 29 September. [ 15 ] [ 16 ] On 6 October 2025 he appointed military general Ruphin Zafisambo as the new Prime Minister. [ 17 ] On 11 October, units of the Madagascar Armed Forces carried out a coup d'état in support of the protests. [ 18 ]\n\nLocated off the coast of East Africa in the Indian Ocean, Madagascar has long been one of the poorest countries in the world. The World Bank estimated that in 2022, 75% of the country lived under the poverty line, out of a country of 30 million. [ 19 ] Incumbent President Andry Rajoelina — who has dominated the country's politics since its 2009 political crisis , and was recently re-elected in 2023 [ 20 ] in a vote that faced significant boycotts from the opposition — has been blamed for much of the country's recent economic woes. [ 21 ] [ 22 ]\n\nThe capital of Antananarivo regularly sees widespread power outages and water cuts that last for up to 12 hours at a time [ 23 ] while the government simultaneously invests in high-profile projects, such as the $152 million cable car in Antananarivo spanning 13 kilometers, widely criticized as irrelevant to citizens' basic needs but defended by Andry Rajoelina while referring to the same criticism the Eiffel Tower received at the beginning of the project. [ 24 ]\n\nPresident Andry Rajoelina , who also holds French nationality, has become a focal point of public resentment due to his family's visible wealth and privileges. His daughter Ilona Rajoelina is often seen wearing designer brands, while his son Arena Rajoelina reportedly attends the elite EHL Lausanne hospitality school, opportunities unavailable to the majority of Malagasy citizens due to its high cost of enrollment. [ 25 ] Viral TikTok videos by pages such as GasyBaddhie and BasedMerina denounce their luxurious lifestyle, drawing parallels to international examples such as Shrinkhala Khatiwada , former Miss Nepal and daughter of an ex-health minister, whose travels and elite status sparked public backlash. [ 26 ]\n\nThe protests are rooted in a combination of historical grievances and recent triggers. On 15 September 2025, Transparency International helped organize a small rally known as Democrasia Mainty in Ambohijatovo, Antananarivo . [ 27 ]\n\nOn 18 September 2025, politicians Clémence Raharinirina and Baba Faniry Rakotoarisoa publicly called for mass protests in front of the Senate in Anosy to denounce chronic power outages, water cuts, and systemic corruption in public utilities. [ 28 ] Their movement was named Tsy Manaiky Lembenana (\"We Refuse to Be Trampled\") and Leo Delestage (\"Fed up with load shedding\"), [ 29 ]\n\nFollowing this, a Facebook page named Gen Z Madagascar emerged as the primary organizing hub for the movement, rapidly gaining over 100,000 followers in five days. [ 30 ] Its logo draws inspiration from the manga One Piece , replacing the traditional straw hat with a Malagasy-style hat. [ 19 ] [ 23 ]\n\nThe previous day, September 24, 2025, was marked by the absence of President Andry Rajoelina and his delegation, who were in New York City for the 80th session of the United Nations General Assembly , where he delivered a speech. [ 31 ] On the same day, the local government of the capital had banned protests on the grounds that they could lead to unrest. Nevertheless, demonstrations took place in the capital, Antananarivo, as well as in provincial towns such as Toamasina , Antsirabe , Toliara , and Antsiranana on September 25, 2025. Since 5:30 a.m. (EAT) on September 25, a large gendarmerie unit was present in the capital, cordoning off certain areas. Protesters were therefore unable to reach their meeting place. [ 29 ] [ 32 ] Protestors were thus unable to go to their dedicated meeting ground. [ 33 ]\n\nThousands of young people attempted to gather at Ambohijatovo, historically designated as the \"Place of Democracy\" by Andry Rajoelina himself in 2009. Police blocked all access points, preventing assembly. Protesters then tried to reach the square from multiple neighborhoods, including Antsahabe, Faravohitra, Anosy, and Ambatonakanga, but each route was met with heavy police presence with tear gas bombs and rubber bullets. Despite these obstacles, the city saw widespread marches of students chanting slogans such as \"Mitsangana ry Tanora\" (a nationalist rally song) and \"Andry Rajoelina Masosopory\", a parody of Andry Rajoelina's election campaign song in 2018. Starting from the second week, it was the \"Miala pory Rajoelina (Step down, Rajoelina)\" that became more popular, referred by some as \"the official hymn of the protest\". [ 34 ] Protestors flew Malagasy flags as well as flags featuring the Straw Hat Jolly Roger from the One Piece franchise. [ 33 ]\n\nAt 10:45 (EAT), the first shots of tear gas were used by police, led by Colonel Tojo Raoilijon. Police used tear gas and rubber bullets throughout the day. [ 33 ] Protestors set up barricades and burned tires and rocks. Three homes of politicians close to Rajoelina were set ablaze by rioters, including the house of Senator Lalatiana Rakotondrazafy and MP Naivo Raholdina . [ 35 ] Looting at various retail, bank, and appliance establishments in Antananarivo began to take place in the afternoon, beginning in Anosibe with the burning of a train station. Looters set ablaze a hotel, a bank, and stations of the country's cable car system. [ 33 ] [ 36 ] According to a hospital source, five people died, all bearing AK-47 gunfire wounds, and an unknown number were injured. [ 32 ] Outside of the city, the offices of Jirama , the national electricity and water provider, were attacked by protestors. [ 33 ] The rally in Antsirabe and Toamasina also devolved into looting and vandalism. [ 29 ] [ 37 ]\n\nMost looters were affiliated with the TMH group, led by Fidy, with participants from the districts of Andavamamba and Anosibe. However, videos also showed unaffiliated individuals looting furniture, freezers, and arcade equipment. Antananarivo police prefect Angelo Ravelonarivo announced a curfew lasting from 7 p.m. (EAT), to 5 a.m. the next day. [ 33 ] Despite the protests initially dispersing, they spread into various parts of the capital. National Police chief Jean Herbert Andriantahiana Rakotomalala warned that authorities would \"take firm preventive...measures against those tempted to break the law.\" [ 14 ] [ 20 ]\n\nIn Antsirabe , protesters gathered at the city's train station at around 10 a.m. before being dispersed with tear gas by police. By noon, looting had began to occur against commercial buildings in the city, with limited police presence as most officers had been redeployed to Antananarivo. [ 38 ] Around 4 p.m., the death of Jean-Jacques Rabenirinia, the member of parliament for Betioky from the opposition group Firaisankina and dean of the National Assembly, was announced, after he succumbed to his injuries from an accident. His vehicle had been struck by a truck at a barricade erected by protesters. [ 39 ]\n\nDuring his address starting at 7:30 p.m., live from New York City (where he was attending the United Nations General Assembly ), Andry Rajoelina announced the dismissal of Jean-Baptiste Olivier, the Minister of Energy and Hydrocarbons, under the pretext that he \"was not doing his job\". [ 40 ] Rajoelina further condemned the violence which occurred after the protests as \"acts of destabilisation\", [ 41 ] and accused opposition politicians of taking advantage of the protests in an attempt to orchestrate a coup. [ 42 ]\n\nSix people, including a university student, were reportedly killed in clashes with police across Antsiranana. Thirty people were also injured. [ 43 ]\n\nProtesters continued to gather in Antananarivo , with some wearing colored straw hats as a symbol. [ 41 ] Rajoelina returned from New York, and summoned a meeting of military and police commanders to deploy military and security forces to secure fuel stations and storage, along with commercial areas. [ 44 ]\n\nThese protests took on a more specifically student and high school student character, with gatherings organized in six major cities across Madagascar. Student protesters complained of difficult living conditions and demanded the right to equitable study conditions, specifically calling for the same opportunities as the children of Malagasy leaders who study abroad. In Antananarivo, security forces pushed back the protesters using AK-47s and tear gas all along General Charles-de-Gaulle Avenue in Tsiadana, up to the Ankatso campus of the University of Antananarivo . This crackdown sparked additional outrage due to the presence, along this avenue, of the Mpitsabo Mikambanana 24/24 private hospital, one of the most prestigious medical institutions in the country. [ 45 ]\n\nCurfews ranging from 7/8 p.m. to 4/5 a.m. were announced outside Antananarivo, Mahajanga , Toamasina , Antsirabe and Toliara . [ 46 ]\n\nStudent associations called for a general mobilization, and demanded the release of protesters arrested on 27 September on top of their initial denouncement of the water and electricity cuts. [ 47 ] As the group of students marched from the University of Antananarivo campus towards the Ambohijatovo neighborhood, they were blocked by security forces who attempted to disperse and push back the protesters with tear gas. Protesters also began demanding the resignation of Rajoelina. [ 48 ]\n\nAs protests continued, Rajoelina announced that he would dissolve the government (under Prime Minister Christian Ntsay ), and provided a three-day period for choosing a new Prime Minister. [ 15 ] [ 16 ] MP Antoine Rajerison [ mg ] was arrested by security forces. [ 48 ] The curfew in Antananarivo was adjusted to 8 p.m. to 4 a.m. [ 49 ]\n\nAccording to the United Nations Commission on Human Rights chairman Volker Türk , 22 people had been killed and 100 injured throughout the course of the protests, including both those killed by security forces and those killed in the looting and general violence by looters and gangs. The Malagasy Ministry of Foreign Affairs rejected this figure. [ 50 ]\n\nProtesters called for another rally to be held in Antananarivo starting on 11 a.m. EAT. [ 51 ] Thousands of protesters gathered in Antananarivo's Ambohijatovo Square, with some protesters having travelled from provincial towns to join the protest. [ 52 ] In one incident, Senate President Richard Ravalomanana 's car was accosted by protesters, which led him to disembark from his vehicle and pursue the protesters on foot. [ 53 ] There were also reports of violence against journalists including Mendrika Razafindratsima and Leonardjo Andriamparany, brutalized by GSIS forces in the afternoon in Ambohijatovo. [ 54 ]\n\nProtests spread to other cities and towns, including Toliara , some 925 kilometres (575 mi) south of Antananarivo . [ 3 ] The government accused the demonstrators of vandalism and of promoting a coup d'état . [ 3 ] Opposition leader Rivo Rakotovao announced that his party and allies will not join any government under the leadership of Rajoelina and asked him to step down. [ 3 ] [ 55 ]\n\nLabour unions began joining protests, and calls were made for a general strike. Protests on 1 October were relatively contained by police forces, and violence was much lower than in the previous days. [ 56 ] [ 57 ] Rajoelina met with foreign diplomats at the presidential palace on 1 October, and presidential spokesperson Lova Ranoromaro claimed that protesters had largely dispersed \"without a clear leader emerging\". [ 57 ] Pro-Rajoelina groups began announcing that they would hold counter-protests. [ 58 ]\n\nCounterprotesters only numbered in the hundreds, lower than what President Andry Rajoelina hoped for. Barely any had clothing with his portrait. [ 59 ]\n\nPolice used tear gas on hundreds of protesters. A march was stopped by a barricade. One man was hospitalized. The United Nations criticized the police and the usage of live ammunition. [ 60 ]\n\nPresident Andry Rajoelina offered talks, but the protesters rejected them as long as protests are being suppressed. [ 61 ] President Andry Rajoelina called the protests a coup. [ 62 ]\n\nStun grenades, tear gas and rubber bullets were used on protesters. [ 63 ]\n\nA contingent of the Malagasy military ( CAPSAT ) mutinied and called for the military to back and protect the protestors, encountering little resistance as it took control of central Antananarivo. [ 64 ]\n\nCAPSAT announced it had seized control of all military forces. [ 65 ] President Andry Rajoelina fled the country. [ 66 ]\n\nRajoelina issued a decree dissolving the National Assembly that was scheduled to launch impeachment measures against him. [ 67 ] Despite this, the National Assembly proceeded to impeach him with 130 votes in favor and one blank vote. At the same time, protests were held in Antananarivo denouncing Rajoelina as a French stooge over his dual citizenship and support from Paris. Several protesters carried Malagasy flags and the Straw Hat Pirates' Jolly Roger flag from the manga series One Piece . [ 68 ] After the vote, Colonel Michael Randrianirina declared that all state institutions were being dissolved, except for the National Assembly. [ 69 ] [ 70 ]\n\nColonel Michael Randrianirina was inaugurated as interim president. [ 71 ]\n\nPresident Michael Randrianirina appointed businessman Herintsalama Rajaonarivelo to be his prime minister, however this action was met with criticism from Gen Z Mada, who claimed that it was done in a \"non-transparent\" manner and \"without consultation\". [ 72 ] The opposition to the appointment stemmed from the questionable connection Rajaonarivelo had with the previous administration. [ 72 ]\n\nThe Council of Christian Churches in Madagascar (FFKM) issued a statement calling for an end to violence, looting, and destruction of property, while also noting that \"the population must enjoy its most basic rights, those of having electricity and drinking water\". [ 73 ] African Union Chairperson Mahamoud Ali Youssouf called for restraint and calm. [ 74 ] Pope Leo XIV released a statement decrying violence and asking for social harmony, the promotion of justice and the common good. [ 3 ]\n\nReporters Without Borders denounced \"police violence against at least three journalists\" on 25 September, [ 75 ] and Amnesty International condemned the \"unlawful and excessive force used by state security officials\" and called for investigations into the deaths. [ 76 ] The United Nations secretary general expressed sadness at the violence. [ 77 ]\n\nOn 13 October 2025, French president Emmanuel Macron expressed concern over the political crisis in Madagascar, emphasizing the need to respect the constitutional order and institutional continuity, supporting the actions of the African Union and SADC, and warning against any use of youth for political or military purposes. He commented on reports that President Andry Rajoelina had boarded a French military plane to Réunion before leaving for another destination with his family, stating, \"I cannot confirm anything today,\" while speaking to the press from Sharm El-Sheikh, Egypt, during a summit on the Gaza peace agreement. [ 78 ] [ 79 ]\n\nOn 26 September, school officials in Antananarivo announced that schools in the city would be closed until order was restored. In much of the city, schools were closed early on 25 September when tear gas began to seep into the schools. [ 80 ] Gas stations were also closed in Antananarivo after a surge of panic buying by drivers. [ 81 ] Supermarkets and modern retail stores were also closed in fear of looters for several days, resulting in shortages of packaged products such as diapers and bottled water. Losses due to looting at retail stores were projected in the billions of ariary . [ 82 ] Local newspaper Midi Madagasikara warned of potential mass layoffs due to losses caused by the looting. [ 83 ]\n\nA large number of flights to and from Antananarivo's Ivato International Airport were cancelled, leaving many international tourists stranded. [ 84 ] Air France has suspended flights between Paris and Antananarivo from October 11 to October 13, inclusive. [ 85 ]",
    "tf_idf_text": "government madagascar prorajoelina group centralize leadership andry rajoelina christian ntsay mamy ravatomanga jean herbert andriantahiana rakotomalala richard ravalomanana angelo ravelonarivo protest occur across madagascar since september focus capital antananarivo protest trigger frequent water power outage city home highprofile politician target protest also spread city across madagascar since september people include protester civilian kill due security force response due loot general disorder commercial area public facility major city experience loot vandalism remove energy minister september malagasy president andry rajoelina announce dissolution government prime minister christian ntsay september october appoint military general ruphin zafisambo new prime minister october unit madagascar arm force carry coup dtat support protest locate coast east africa indian ocean madagascar long one poor country world world bank estimate country live poverty line country million incumbent president andry rajoelina dominate country politics since political crisis recently reelect vote face significant boycotts opposition blame much country recent economic woe capital antananarivo regularly see widespread power outage water cut last hour time government simultaneously invest highprofile project million cable car antananarivo span kilometer widely criticize irrelevant citizen basic need defend andry rajoelina refer criticism eiffel tower receive begin project president andry rajoelina also hold french nationality become focal point public resentment due family visible wealth privilege daughter ilona rajoelina often see wear designer brand son arena rajoelina reportedly attend elite ehl lausanne hospitality school opportunity unavailable majority malagasy citizen due high cost enrollment viral tiktok video page gasybaddhie basedmerina denounce luxurious lifestyle drawing parallel international example shrinkhala khatiwada former miss nepal daughter exhealth minister whose travel elite status spark public backlash protest root combination historical grievance recent trigger september transparency international help organize small rally know democrasia mainty ambohijatovo antananarivo september politician clmence raharinirina baba faniry rakotoarisoa publicly call mass protest front senate anosy denounce chronic power outage water cut systemic corruption public utility movement name tsy manaiky lembenana refuse trample leo delestage feed load shed follow facebook page name gen madagascar emerge primary organize hub movement rapidly gain follower five day logo draws inspiration manga one piece replace traditional straw hat malagasystyle hat previous day september mark absence president andry rajoelina delegation new york city session unite nation general assembly deliver speech day local government capital ban protest ground could lead unrest nevertheless demonstration take place capital antananarivo well provincial town toamasina antsirabe toliara antsiranana september since eat september large gendarmerie unit present capital cordoning certain area protester therefore unable reach meeting place protestors thus unable dedicated meeting ground thousand young people attempt gather ambohijatovo historically designated place democracy andry rajoelina police block access point prevent assembly protester try reach square multiple neighborhood include antsahabe faravohitra anosy ambatonakanga route meet heavy police presence tear gas bomb rubber bullet despite obstacle city saw widespread march student chant slogan mitsangana tanora nationalist rally song andry rajoelina masosopory parody andry rajoelinas election campaign song start second week miala pory rajoelina step rajoelina become popular refer official hymn protest protestors fly malagasy flag well flag feature straw hat jolly roger one piece franchise eat first shot tear gas use police lead colonel tojo raoilijon police use tear gas rubber bullet throughout day protestors set barricade burn tire rock three home politician close rajoelina set ablaze rioter include house senator lalatiana rakotondrazafy naivo raholdina loot various retail bank appliance establishment antananarivo begin take place afternoon begin anosibe burn train station looter set ablaze hotel bank station countrys cable car system accord hospital source five people die bear gunfire wound unknown number injured outside city office jirama national electricity water provider attack protestors rally antsirabe toamasina also devolve loot vandalism looter affiliate tmh group lead fidy participant district andavamamba anosibe however video also show unaffiliated individual loot furniture freezer arcade equipment antananarivo police prefect angelo ravelonarivo announce curfew lasting eat next day despite protest initially disperse spread various part capital national police chief jean herbert andriantahiana rakotomalala warn authority would take firm preventivemeasures tempt break law antsirabe protester gather citys train station around disperse tear gas police noon loot begin occur commercial building city limited police presence officer redeploy antananarivo around death jeanjacques rabenirinia member parliament betioky opposition group firaisankina dean national assembly announce succumbed injury accident vehicle strike truck barricade erect protester address start live new york city attend united nation general assembly andry rajoelina announce dismissal jeanbaptiste olivier minister energy hydrocarbon pretext not job rajoelina condemn violence occur protest act destabilisation accuse opposition politician take advantage protest attempt orchestrate coup six people include university student reportedly kill clash police across antsiranana thirty people also injure protester continue gather antananarivo wear colored straw hat symbol rajoelina return new york summon meet military police commander deploy military security force secure fuel station storage along commercial area protest take specifically student high school student character gathering organize six major city across madagascar student protester complain difficult living condition demand right equitable study condition specifically call opportunity child malagasy leader study abroad antananarivo security force push back protester use aks tear gas along general charlesdegaulle avenue tsiadana ankatso campus university antananarivo crackdown spark additional outrage due presence along avenue mpitsabo mikambanana private hospital one prestigious medical institution country curfews range announce outside antananarivo mahajanga toamasina antsirabe toliara student association call general mobilization demand release protester arrest september top initial denouncement water electricity cut group student march university antananarivo campus towards ambohijatovo neighborhood block security force attempt disperse push back protester tear gas protester also begin demand resignation rajoelina protest continue rajoelina announce would dissolve government prime minister christian ntsay provide threeday period choose new prime minister antoine rajerison arrest security force curfew antananarivo adjust accord united nation commission human right chairman volker trk people kill injured throughout course protest include kill security force kill loot general violence looter gang malagasy ministry foreign affair reject figure protester call another rally hold antananarivo start eat thousand protester gather antananarivos ambohijatovo square protester travel provincial town join protest one incident senate president richard ravalomanana car accost protester lead disembark vehicle pursue protester foot also report violence journalist include mendrika razafindratsima leonardjo andriamparany brutalized gsis force afternoon ambohijatovo protest spread city town include toliara kilometre south antananarivo government accuse demonstrator vandalism promote coup dtat opposition leader rivo rakotovao announce party ally not join government leadership rajoelina ask step labour union begin join protest call make general strike protest october relatively contained police force violence much lower previous day rajoelina meet foreign diplomat presidential palace october presidential spokesperson lova ranoromaro claim protester largely disperse without clear leader emerge prorajoelina group begin announce would hold counterprotests counterprotesters number hundred lower president andry rajoelina hop barely clothe portrait police use tear gas hundred protester march stop barricade one man hospitalize united nation criticize police usage live ammunition president andry rajoelina offer talk protester reject long protest suppress president andry rajoelina call protest coup stun grenade tear gas rubber bullet use protester contingent malagasy military capsat mutiny call military back protect protestors encounter little resistance take control central antananarivo capsat announce seize control military force president andry rajoelina flee country rajoelina issue decree dissolve national assembly schedule launch impeachment measure despite national assembly proceed impeach vote favor one blank vote time protest hold antananarivo denounce rajoelina french stooge dual citizenship support paris several protester carry malagasy flag straw hat pirate jolly roger flag manga series one piece vote colonel michael randrianirina declare state institution dissolve except national assembly colonel michael randrianirina inaugurate interim president president michael randrianirina appoint businessman herintsalama rajaonarivelo prime minister however action meet criticism gen mada claim do nontransparent manner without consultation opposition appointment stem questionable connection rajaonarivelo previous administration council christian church madagascar ffkm issue statement call end violence loot destruction property also note population must enjoy basic right electricity drinking water african union chairperson mahamoud ali youssouf call restraint calm pope leo xiv release statement decry violence ask social harmony promotion justice common good reporter without border denounce police violence least three journalist september amnesty international condemn unlawful excessive force use state security official call investigation death united nation secretary general express sadness violence october french president emmanuel macron expressed concern political crisis madagascar emphasize need respect constitutional order institutional continuity support action african union sadc warn use youth political military purpose comment report president andry rajoelina board french military plane runion leave another destination family state cannot confirm anything today speak press sharm elsheikh egypt summit gaza peace agreement september school official antananarivo announced school city would close order restore much city school close early september tear gas begin seep school gas station also close antananarivo surge panic buying driver supermarket modern retail store also close fear looter several day result shortage package product diaper bottle water loss due loot retail store project billion ariary local newspaper midi madagasikara warn potential mass layoff due loss cause loot large number flight antananarivos ivato international airport cancel leave many international tourist strand air france suspend flight paris antananarivo october october inclusive"
}