{
    "title": "en.wikipedia.org_wiki_TV_Asahi",
    "url": "https://en.wikipedia.org/wiki/TV_Asahi",
    "transformers_text": "JOEX-DTV (channel 5), branded as TV Asahi [ a ] , and better known as Tele Asa ( テレ朝 ) , is a Japanese television station serving the Kanto region as the flagship station of the All-Nippon News Network . It is owned-and-operated by the TV Asahi Corporation [ b ] , a wholly-owned subsidiary of TV Asahi Holdings Corporation [ ja ] [ c ] , itself controlled by The Asahi Shimbun Company . Its studios are located in Roppongi , Minato, Tokyo . TV Asahi is one of the \"Big Six\" broadcasters based in Tokyo, alongside Nippon Television , TBS , TV Tokyo , NHK General TV , and Fuji Television .\n\nAfter NHK General TV , NTV , and Radio Tokyo Television were launched in 1953 and 1955, TV has become an important medium in Japan. [ 1 ] : 9–10 However, most of the programs that were aired at that time were vulgar which caused well-known critic Sōichi Ōya to mention in a program that TV made people in Japan \"a nation of 100 million idiots\"; those criticisms already gave birth to the idea of opening an education-focused TV station. [ 1 ] : 11 On February 17, 1956, the Ministry of Posts and Telecommunications issued frequency allocations, and the Kantō region obtained three licenses in total. Among the three, one of them is used by NHK Educational TV , while the other two were open for private bidding. Among those bidders are film production companies Toho and Toei Company , radio broadcasters Nippon Cultural Broadcasting and Nippon Broadcasting System , and educational publishing group Obunsha [ ja ] . [ 1 ] : 11–13 On July 4, 1957, the Ministry of Posts and Telecommunications later decided to unify those applications into Tokyo Educational Television (as its tentative name) which was later obtained on July 8. [ 1 ] : 19–20\n\nOn October 10, 1957, Tokyo Educational Television held its first shareholders meeting and changed its company name to Nippon Educational Television Co., Ltd. (NET) . [ 1 ] : 22 On November 1 of the same year, the broadcaster was later established. [ 1 ] : 24 After Fuji Television obtained their broadcast licenses, they set an official start date of broadcast on March 1, 1959. NET advanced their start date of broadcast a month earlier (February 1, 1959). [ 1 ] : 33 On Christmas Eve 1958, NET began its test transmissions. [ 1 ] : 33 On January 9 of the following year, their broadcast license was approved, and test transmissions continued every night throughout the month. [ 1 ] : 34\n\nAt the time of founding, the following locations were considered for the building of its headquarters: [ 1 ] : 25–26\n\nNET took these considerations: [ 1 ] : 25–26\n\nAfter a careful consideration of these four conditions, a 9,100 square meter site at the location of the former Spanish embassy to Japan, was selected by Toei. [ 1 ] : 25–26 [ 2 ]\n\nAt 9:55a.m. (JST) on February 1, 1959, NET signed on, airing at least 6.5 hours of programming per day. [ 1 ] : 39 By April, this figure was extended to 10 hours. [ 1 ] : 42 With the launch of the Mainichi Broadcasting System and Kyushu Asahi Broadcasting on March 1, 1959, NET programming started airing on those mentioned broadcasters. Shortly after the start of broadcasts, NET broadcast their first live program, which is the wedding of Crown Prince (now Emperor Emeritus) Akihito and Empress Michiko held on April 10 of the same year. [ 1 ] : 49–50\n\nAt the time, its broadcasting license dictated that the network was required to devote at least 50% of its airtime to educational programming, and at least 30% of its airtime to children's educational programming. [ 3 ] However, the for-profit educational television model eventually proved to be a failure. In July 1959, average ratings of the network were less than 5%. [ 1 ] : 54\n\nIn 1960, NET began its transformation into a general-purpose television station. [ 3 ] It began to broadcast anime and foreign movies (in the following years, the channel contains not only original anime but also foreign cartoons dubbed into Japanese). So as not to run afoul of the educational TV license requirements, NET justified the airing of these programs under the pretext of \"nurturing a child's emotional range\" ( 子供の情操教育のため , Kodomo no jōsō kyōiku no tame ) and \"introduction of foreign cultures\" ( 外国文化の紹介 , Gaikoku bunka no shōkai ) . [ 3 ] In December 1960, NET also changed its common name from Nippon Educational Television to NET TV (NETテレビ). [ 1 ] : 64–65 The change also made its ratings to reach about 10% after 1963. Although it still ranks at the bottom rank of other rival broadcasters, it has greatly narrowed the gap between it and the other three. [ 1 ] : 57\n\nThe station began adding primetime programming in April 1961. [ 1 ] : 66 Two years later, NET announced its arrival into the anime race with the Toei produced Wolf Boy Ken . The first of many Toei Animation productions, its premiere began a long line of animated cartoons and series that the station has aired until today.\n\nKenichiro Matsuoka , born in America and fluent in English, joined the board of NET and was responsible for licensing Laramie and Rawhide from the US, gaining high ratings for the network. This would give them their first advantage over rivals NHK and Fuji TV . He would eventually go on to serve as an Executive Vice President and eventual founder of Japan Cable Television . [ 4 ] [ 5 ] [ 6 ]\n\nIn November 1963, NET joined forces with NHK General TV for the first live via satellite telecast in Japanese TV history.\n\nThe switch to general programming also led to an infighting among the management. In contrast to the then-president of NET TV, Hiroshi Ogawa (from Toei Company ), who was actively promoting entertainment programs, Yoshio Akao (from Obunsha) thought that too many entertainment programs were against the original purpose of the educational TV station and was strongly dissatisfied with the vulgar programs that filled NET TV's program schedule at that time. [ 7 ] : 61–62 In November 1964, Akao, together with shareholders other than Toei and Nikkei, Inc. , succeeded in its major reorganization, forcing Ogawa to resign from the presidency. [ 7 ] : 61 Since then, Toei's influence in NET TV has been gradually replaced by Asahi Shimbun . [ 7 ] : 93 The following year, the Asahi Shimbun appointed to the post of station director Koshiji Miura (former Deputy Minister of Political Affairs). [ 7 ] : 86–92\n\nIn the 1960s, NET TV also started airing foreign films as part of its schedule. [ 1 ] : 67 The NET TV premiere of The Morning Show in 1964 created a trend for a news-talk format on daytime Japanese TV, causing other networks to follow suit, it was the first Japanese morning program in its format. [ 1 ] : 116 Hyōten, NET TV's drama in 1966, had a 42.7% ratings in its finale. [ 1 ] : 121 The success of the drama made the network to adjust its target audiences to single and married females. [ 1 ] : 127 Despite heavily focusing on entertainment programs, they continued to broadcast educational programs, albeit on a limited number of hours every morning. [ 1 ] : 77 In 1967, NET TV launched The Minkyokyo [ ja ] to strengthen the production of educational programs. [ 1 ] : 74–75, 132 In April 1967, they started to broadcast in color TV, and by 1969, all of its programs were broadcast in color. [ 1 ] : 134–135 After 1968, many regional broadcasters in Japan began to pop up. This led to the broadcaster launching the All-Nippon News Network on April 1, 1970, the country's 4th national network, with NET producing national news and other nationally produced programming for the regional channels that had joined the network. [ 1 ] : 161–163 With the continuous network expansion, NET TV shifted its focus on its target audience again, this time from females, to being family oriented similar to the US PBS. [ 1 ] : 169–170\n\nBut the best was yet to come. One year after ANN was launched, ground-breaking superhero series such as Kamen Rider , Metal Hero Series , and Super Sentai were produced by Toei, premiering on NET TV and the ANN network in April 1971 with the original Kamen Rider making its television debut. These programs ended the long-standing tokusatsu duopoly TBS and Fuji Television held with the then hit Ultra Series franchise for almost half a decade ago on TBS. Since 1958, TBS and Fuji TV were the only Japanese TV stations to air tokusatsu productions. With its hit premiere, a rivalry began to start between the three, with TBS seeing NET's tokusatsu programming as a threat. Toei's successful pitch was seen by its staff as a resurgence of their influence following the removal of Hiroshi Ogawa as president in 1964.\n\nIn November 1973, the Ministry of Posts revised its plans on how TV broadcasters would operate, including abolishing education-focused TV broadcasting. Therefore, NET's transformation into a general-purpose television station was complete by that same month, when NET, along with the educational channel \"Tokyo Channel 12\" (now TV Tokyo ) in Tokyo applied and received a general purpose television station license. [ 1 ] : 200–201 In March of the following year, both ended their broadcasts of educational programming, completing the transition. [ 1 ] : 200–201 Japan's major newspapers are also sorting out their holdings in TV stations. The Nikkei transferred its stake in NET TV to The Asahi Shimbun , making the latter the largest shareholder of NET TV. [ 1 ] : 204–205 On April 1, 1975, the ANN affiliation in the Kansai region changed hands, from Mainichi Broadcasting System , ABC Television assumed the network affiliation slot. [ 1 ] : 209–214 Days later, the channel debuted another Ishinomori creation, Himitsu Sentai Gorenger , yet another Toei production, and it would be a stunning success (this was the same month when Kamen Rider jumped ship to rival TBS with the season premiere of Kamen Rider Stronger , the franchise would return to what is now TV Asahi in 2000). The series marked the beginning of the Super Sentai franchise and established NET as a force to be reckoned with regarding tokusatsu productions and anime.\n\nOn April 1, 1977, the corporate name of NET TV was renamed to Asahi National Broadcasting Co., Ltd. [ d ] , with the name of its channel changed to TV Asahi . [ 1 ] : 240–241 This also symbolizes that the Asahi Shimbun has the right to operate TV Asahi both in name and in essence. [ 1 ] : 122–123 Since December 17, 1978, TV Asahi has been broadcasting programs with stereo audio. [ 1 ] : 267–268 The corporation also started entering into different ventures such as publishing in the late 70s to gain revenue other than advertising. [ 1 ] : 264–265\n\nIn 1977, thanks to his close relationship with Ivan Ivanovich, head of the Japanese Section of the International Department of the Communist Party of the Soviet Union, Koshiji Miura was able to meet with Soviet leader Leonid Brezhnev and help TV Asahi obtain exclusive broadcasting rights for the 1980 Summer Olympics in Moscow . This was the first time that a private TV station in Japan was exclusively granted the broadcasting rights of the Olympic Games, [ 1 ] : 241–246 but this was controversial as rival broadcasters including NHK opposed the move. [ 1 ] : 302–303 Japan followed the Western countries in boycotting the 1980 Summer Olympics . [ 1 ] : 280–284 As a result, TV Asahi only aired high-profile Olympic events [ 1 ] : 284–287 and the broadcaster had significant losses in its revenue. [ 1 ] : 156\n\nAs the broadcaster expanded its business, its HQ ran out of space. Since its HQ was located in a residential area, it became difficult to expand its existing infrastructure. [ 1 ] : 316 TV Asahi collaborated with property development firm Mori Building Company to redevelop the Roppongi area. While the new HQ was under development, TV Asahi temporarily moved to the newly built studios in Ark Hills . [ 1 ] : 315–317 In 1985, the Ark Broadcasting Center was officially completed. [ 8 ] : 225 As Japan entered into the economic bubble era, local residents around the Roppongi area had a negative perception towards the redevelopment of the said area, which resulted into delaying the redevelopment plan. [ 8 ] : 236–237 The old headquarters was demolished in 2000. Prior to the new headquarters being built on the site, offices of TV Asahi were located in multiple locations around Tokyo, including the studios in Ark Hills. [ 8 ] : 280–285\n\nThe launch of the evening news program \"News Station\" and \"Super J Channel\" in 1985 and 1997 helped TV Asahi establish its positive viewership advantage at 5pm and 10pm on weekdays, strengthening its position in news programs as a partnership with Turner -owned CNN and Capital Cities/ABC -owned ABC News from the US. [ 8 ] : 228–229 In 1987, ANN had a total of 14 regional affiliated stations, much smaller than the other 3 networks ( JNN and FNN / FNS had 25 each and NNN / NNS had 27). However, affected by the economic bubble at that time, Kikuo Tashiro (then president of TV Asahi), announced that it wouldn't open more regional stations which resulted in protest from the existing stations. As a result, the decision was reverted and decided to open 10 more stations. [ 8 ] : 233 In response to the arrival of satellite TV, TV Asahi established TV Asahi Satellite Corporation in 1991. [ 8 ] : 237–238\n\nOn November 22, 1995, TV Asahi premiered the American series The X-Files at an 8:00 pm prime time slot, the first since Knight Rider . The station began airing the series due to the success of The X-Files in the Japanese home video market with 200,000 cassettes sold beyond the threshold of 10,000. As part of the airing of the series, TV Asahi organized an \"extensive promotional campaign\" on the same month with a convention in Tokyo featuring screenings of episodes yet to release on home video and appearances by celebrity fans, Japanese translations of The X-Files books and an X-Files Mystery Tour to the filming locations of the series. [ 9 ]\n\nAfter Iwate Asahi Television started broadcasting in 1996, the number of ANN stations reached 26, announcing that the broadcaster has already completed the establishment of its national network. [ 8 ] : 242 In June of the same year, media tycoon Rupert Murdoch and investor Masayoshi Son planned to buy a large stake of TV Asahi, jeopardizing the status of Asahi Shimbun as the major shareholder. [ 7 ] : 238–244 In this regard, Toshitada Nakae personally went to the US to meet Murdoch and asked him not to increase his shareholding to TV Asahi. [ 7 ] : 246–248 By the following year, Asahi Shimbun purchased the shares of TV Asahi held by Murdoch and Son. [ 7 ] : 262 TV Asahi is listed on the Tokyo Stock Exchange since October 3, 2000. [ 8 ] : 252 Multiple changes happened since 2000 after TV Asahi had been staying in the same 4th place for 10 consecutive years in TV ratings. [ 8 ] : 62–63, 253 In April 2000, major changes in its schedules, such as starting its programs a few minutes before the top of the hour and improving its entertainment programming at late-night. [ 8 ] : 254 TV Asahi launched its satellite channel BS Asahi in December 2000. [ 8 ] : 259–260\n\nOn September 29, 2003, TV Asahi moved back its head office from its Ark Hills Studio to Roppongi Hills . [ 8 ] : 261 On October 1, the company changed its name to TV Asahi Corporation , with the name presented as TV asahi on-screen, commemorating the 45th anniversary of the broadcaster. [ 8 ] : 260 As part of digital broadcasting, TV Asahi started to broadcast on digital TV, being designated to channel 5. [ 8 ] : 266–267 In 2004, TV Asahi's ratings reached 7.5% ranking third among the commercial broadcasters in the Kanto Region after a lapse of 32 years. [ 8 ] : 262 The ratings would further improve by the following year, ranking first in late-night TV ratings. [ 8 ] : 260 However, in 2008, affected by the global recession, TV Asahi recorded its first annual loss of revenue. [ 10 ] : 132 In 2009, Hiroshi Hayakawa became the president of the broadcaster, being the first president of TV Asahi who had been serving the broadcaster since its inauguration. [ 10 ] : 14 Between April and June 2012, TV Asahi won in the Triple Crown ratings for the first time with 12.3% in primetime, 12.7% in evening time, and 7.9% for whole day. [ 10 ] : 17\n\nOn May 10, 2011, TV Asahi launched its mascot \"Go-chan\" which was designed by Sanrio . [ 10 ] : 122–123\n\nOn April 1, 2014, TV Asahi became a certified broadcasting holding company \" TV Asahi Holdings, Inc. \", and newly founded \" TV Asahi Corporation \" took over the broadcasting business.\n\nThe transmission of international aquatics competitions, FIFA World Cup football matches, and creation of popular late-night TV programs contributed to a rise in ratings for TV Asahi and lifted the TV station from its popularly ridiculed \"perpetual fourth place\" finish into second place, right behind Fuji TV , by 2005. Disney -owned ABC signed a strategic alliance with former rival commercial broadcaster Fuji TV due to sluggish viewership ratings.\n\nThe station also launched its own mascot , Gō EX Panda ( ゴーエクスパンダ , Gō Ekkusu Panda ) , also known as Gō-chan ( ゴーちゃん。 ) Gō-chan is currently seen on TV Asahi's opening sign-on ID.\n\nPartnership agreements with Zee Entertainment Enterprises Limited of India and the Kantana Group of Thailand were signed on March 31, 2015. [ 11 ]\n\nBeginning April 11, 2022, TV Asahi's programs were made available on the TVer platform. It was initially scheduled for September 2021, but was delayed several times due to update problems. [ 12 ]\n\nUpon becoming TV Asahi in 1977, the station opted to use a red and green 10 mark. This was joined in October 1996 by a new special logo created following the launch of Iwate Asahi Television to represent the completion of the ANN network. It was designed by Tim Garvin, at the time known for his Hollywood works in movies such as Dances With Wolves and Unforgiven . [ 13 ]\n\nTV Asahi's current branding were created by British design collective Tomato (some members work as the electronic music group Underworld ) along with TV Asahi's in-house design department in 2003. [ 14 ] It comprises a set of computer-generated \"sticks\" in white background, which changes in colour and movement along with the background music that accompanies the idents. TV Asahi also uses a brief eyecatch of its sticks animation at the top-left of the screen after commercial breaks. The background music used for TV Asahi's sign-on and sign-off videos are Underworld's Born Slippy .NUXX 2003 and Rez . TV Asahi later updated its sign-on and sign-off video in 2008 with a revised version of computer-generated \"sticks\" animation and new background music. TV Asahi's slogan New Air, On Air. appears at the top of its name. [ 15 ] It can be seen on TV Asahi's YouTube channel, which in 2011–12, was replaced by its mascot, Go-Chan.\n\nThe company writes its name in lower-case letters, tv asahi , in its logo and public-image materials. Normally, the station branding on-screen appears as either \"/tv asahi\" or \"tv asahi\\\". The station's watermark appearance is the stick at the top with the station's name at the bottom. The fonts used by TV Asahi for the written parts are Akzidenz Grotesk Bold (English) and Hiragino Kaku Gothic W8 (Japanese). [ 16 ]\n\nFrom 1991 to 2001, TV Asahi was unique among the national television networks for its English language theme song, Join Us , which was used for both the startup and closedown sequences. Before that, from 1977 to 1987, another song (わが家の友だち10チャンネル, Wagaya no Tomodachi 10 channeru, Terebi Asahi , also the name of the relaunch event on April 1, 1977) [ 17 ] was used for these (instrumental only from 1978, formerly with vocals).\n\nThe broadcaster's official abbreviation is EX , taken from its callsign (JOEX), since October 1, 2003. During the Nippon Educational Television era, the English company name was Nippon Educational Television Co., Ltd. to NET, and during the National Asahi Broadcasting era, Asahi National Broadcasting Co., Ltd. to ANB. Initially, it was planned that NET would become All Asahi Broadcasting Co., Ltd., and that it would also use AAB as an abbreviation, but the name had already been registered as a trademark and there were doubts about adding \"All\" to the name of a single company. Because of this, the broadcaster selected ANB. [ 18 ] [ 19 ] AAB is used as the English abbreviation for Akita Asahi Broadcasting , which opened in 1992.\n\nSince 2004, the funding of this station is through sponsorship .\n\n(until July 24, 2011, only for 44 out of 47 prefectures)\n\nJOEX-TV – TV Asahi Analog Television (テレビ朝日アナログテレビジョン)\n\nJOEX-DTV – TV Asahi Digital Television (テレビ朝日デジタルテレビジョン)\n\nAccording to the 2019 Reuters Institute Digital News Report, TV Asahi was the lowest-positioned among the news operations of five networks in Japan, with a score of 5.76 points, behind (in growing order) Fuji TV (5.79), TBS (5.86), NTV (5.95) and NHK (6.32, itself the most-reliable overall source according to the study). [ 21 ]\n\nTV Asahi also occasionally broadcast a number of foreign movies and series, dubbed into Japanese. [ citation needed ]\n\nIn 2003, the company headquarters moved to a new building designed by Fumihiko Maki currently located at 6-9-1 Roppongi , Minato, Tokyo , Japan.\n\nSome of TV Asahi's departments and subsidiaries, such as TV Asahi Productions and Take Systems, are still located at TV Asahi Center , the company's former headquarters from 1986 to 2003. It is located at Ark Hills , not far from its headquarters.",
    "tf_idf_text": "joexdtv channel brand asahi well know tele asa japanese television station serve kanto region flagship station allnippon news network ownedandoperated asahi corporation whollyowned subsidiary asahi holding corporation control asahi shimbun company studios locate roppongi minato tokyo asahi one big six broadcaster base tokyo alongside nippon television tb tokyo nhk general fuji television nhk general ntv radio tokyo television launch become important medium japan however program air time vulgar cause wellknown critic sichi mention program make people japan nation million idiots criticism already give birth idea open educationfocused station february ministry post telecommunication issue frequency allocation kant region obtain three license total among three one use nhk educational two open private bidding among bidder film production company toho toei company radio broadcaster nippon cultural broadcast nippon broadcast system educational publishing group obunsha july ministry post telecommunication later decide unify application tokyo educational television tentative name later obtain july october tokyo educational television hold first shareholder meet change company name nippon educational television ltd net november year broadcaster later establish fuji television obtain broadcast license set official start date broadcast march net advance start date broadcast month earlier february christmas eve net begin test transmission january follow year broadcast license approve test transmission continue every night throughout month time found follow location consider build headquarters net take consideration careful consideration four condition square meter site location former spanish embassy japan select toei jst february net sign air least hour program per day april figure extend hour launch mainichi broadcasting system kyushu asahi broadcast march net programming start air mention broadcaster shortly start broadcast net broadcast first live program wed crown prince emperor emeritus akihito empress michiko hold april year time broadcast license dictate network required devote least airtime educational programming least airtime childrens educational programming however forprofit educational television model eventually proved failure july average rating network less net begin transformation generalpurpose television station begin broadcast anime foreign movie follow year channel contain not original anime also foreign cartoon dub japanese not run afoul educational license requirement net justified air program pretext nurturing child emotional range kodomo kyiku tame introduction foreign culture gaikoku bunka shkai december net also change common name nippon educational television net net change also make rating reach although still rank bottom rank rival broadcaster greatly narrow gap three station begin add primetime program april two year later net announce arrival anime race toei produce wolf boy ken first many toei animation production premiere begin long line animate cartoon series station air today kenichiro matsuoka bear america fluent english join board net responsible licensing laramie rawhide gain high rating network would give first advantage rival nhk fuji would eventually serve executive vice president eventual founder japan cable television november net join force nhk general first live via satellite telecast japanese history switch general programming also lead infighting among management contrast thenpresident net hiroshi ogawa toei company actively promote entertainment program yoshio akao obunsha think many entertainment program original purpose educational station strongly dissatisfy vulgar program fill net tv program schedule time november akao together shareholder toei nikkei inc succeed major reorganization force ogawa resign presidency since toeis influence net gradually replace asahi shimbun follow year asahi shimbun appoint post station director koshiji miura former deputy minister political affair net also start air foreign film part schedule net premiere morning show create trend newstalk format daytime japanese cause network follow suit first japanese morning program format hyten net tv drama rating finale success drama make network adjust target audience single marry female despite heavily focus entertainment program continue broadcast educational program albeit limit number hour every morning net launch minkyokyo strengthen production educational program april start broadcast color program broadcast color many regional broadcaster japan begin pop lead broadcaster launch allnippon news network april countrys national network net produce national news nationally produce programming regional channel join network continuous network expansion net shift focus target audience time female family orient similar pb best yet come one year ann launch groundbreaking superhero series kamen rider metal hero series super sentai produce toei premiering net ann network april original kamen rider make television debut program end longstanding tokusatsu duopoly tb fuji television hold hit ultra series franchise almost half decade ago tb since tb fuji japanese station air tokusatsu production hit premiere rivalry begin start three tb see net tokusatsu program threat toeis successful pitch see staff resurgence influence follow removal hiroshi ogawa president november ministry post revise plan broadcaster would operate include abolish educationfocused broadcasting therefore net transformation generalpurpose television station complete month net along educational channel tokyo channel tokyo tokyo apply receive general purpose television station license march follow year end broadcast educational programming complete transition japan major newspaper also sort holding station nikkei transfer stake net asahi shimbun make latter large shareholder net april ann affiliation kansai region change hand mainichi broadcast system abc television assume network affiliation slot day later channel debut another ishinomori creation himitsu sentai gorenger yet another toei production would stun success month kamen rider jump ship rival tb season premiere kamen rider strong franchise would return asahi series mark begin super sentai franchise establish net force reckon regard tokusatsu production anime april corporate name net rename asahi national broadcasting ltd name channel change asahi also symbolize asahi shimbun right operate asahi name essence since december asahi broadcast program stereo audio corporation also start enter different venture publish late gain revenue advertise thanks close relationship ivan ivanovich head japanese section international department communist party soviet union koshiji miura able meet soviet leader leonid brezhnev help asahi obtain exclusive broadcasting right summer olympics moscow first time private station japan exclusively grant broadcast right olympic game controversial rival broadcaster include nhk oppose move japan follow western country boycott summer olympics result asahi air highprofile olympic event broadcaster significant loss revenue broadcaster expand business run space since locate residential area become difficult expand exist infrastructure asahi collaborate property development firm mori build company redevelop roppongi area new development asahi temporarily move newly build studio ark hill ark broadcast center officially complete japan enter economic bubble era local resident around roppongi area negative perception towards redevelopment say area result delay redevelopment plan old headquarters demolish prior new headquarters build site office asahi locate multiple location around tokyo include studio ark hill launch even news program news station super channel help asahi establish positive viewership advantage weekdays strengthen position news program partnership turner own cnn capital citiesabc own abc news ann total regional affiliate station much small network jnn fnn fns nns however affect economic bubble time kikuo tashiro president asahi announce wouldnt open regional station result protest exist station result decision revert decide open station response arrival satellite asahi establish asahi satellite corporation november asahi premier american series xfiles prime time slot first since knight rider station begin air series due success xfiles japanese home video market cassette sell beyond threshold part air series asahi organize extensive promotional campaign month convention tokyo feature screening episodes yet release home video appearance celebrity fan japanese translation xfiles book xfiles mystery tour film location series iwate asahi television start broadcast number ann station reach announce broadcaster already complete establishment national network june year medium tycoon rupert murdoch investor masayoshi son plan buy large stake asahi jeopardize status asahi shimbun major shareholder regard toshitada nakae personally go meet murdoch ask not increase shareholding asahi follow year asahi shimbun purchased share asahi hold murdoch son asahi list tokyo stock exchange since october multiple change happen since asahi stay place consecutive year rating april major change schedule start program minute top hour improve entertainment program latenight asahi launch satellite channel asahi december september asahi move back head office ark hill studio roppongi hill october company change name asahi corporation name present asahi onscreen commemorate anniversary broadcaster part digital broadcasting asahi start broadcast digital designate channel asahis rating reach ranking third among commercial broadcaster kanto region lapse year rating would improve follow year rank first latenight rating however affect global recession asahi record first annual loss revenue hiroshi hayakawa become president broadcaster first president asahi serve broadcaster since inauguration april june asahi triple crown rating first time primetime even time whole day may asahi launch mascot gochan design sanrio april asahi become certified broadcast hold company asahi holding inc newly found asahi corporation take broadcasting business transmission international aquatic competition fifa world cup football match creation popular latenight program contribute rise rating asahi lift station popularly ridicule perpetual fourth place finish second place right behind fuji disney own abc sign strategic alliance former rival commercial broadcaster fuji due sluggish viewership rating station also launch mascot panda ekkusu panda also know gchan gchan currently see asahis open signon partnership agreement zee entertainment enterprise limit india kantana group thailand sign march begin april asahis program make available tver platform initially schedule september delayed several time due update problem upon become asahi station opt use red green mark join october new special logo create follow launch iwate asahi television represent completion ann network design tim garvin time know hollywood work movie dance wolf unforgiven asahis current branding create british design collective tomato member work electronic music group underworld along asahis inhouse design department comprise set computergenerated stick white background change colour movement along background music accompany idents asahi also use brief eyecatch stick animation topleft screen commercial break background music use asahis signon signoff video underworld bear slippy nuxx rez asahi later update signon signoff video revise version computergenerated stick animation new background music asahis slogan new air air appear top name see asahis youtube channel replace mascot gochan company write name lowercase letter asahi logo publicimage material normally station brand onscreen appear either asahi asahi station watermark appearance stick top station name bottom font use asahi write part akzidenz grotesk bold english hiragino kaku gothic japanese asahi unique among national television network english language theme song join use startup closedown sequence another song wagaya tomodachi channeru terebi asahi also name relaunch event april use instrumental formerly vocal broadcaster official abbreviation take callsign joex since october nippon educational television era english company name nippon educational television ltd net national asahi broadcast era asahi national broadcasting ltd anb initially planned net would become asahi broadcasting ltd would also use aab abbreviation name already register trademark doubt add name single company broadcaster select anb aab use english abbreviation akita asahi broadcasting open since funding station sponsorship july prefectures joextv asahi analog television joexdtv asahi digital television accord reuters institute digital news report asahi lowestpositioned among news operation five network japan score point behind grow order fuji tbs ntv nhk mostreliable overall source accord study asahi also occasionally broadcast number foreign movie series dub japanese citation need company headquarters move new building design fumihiko maki currently locate roppongi minato tokyo japan asahis department subsidiary asahi production take system still locate asahi center company former headquarters locate ark hill not far headquarters"
}