{
    "title": "633 5 \"A Formidable, Unknown Warrior! Here Comes Lucy!\"Transliteration: \"Saikyō no Mumei Senshi! Rūshī Tōjō\" (Japanese:最強の無名戦士！ルーシー登場) Tetsuya Endō Shōji Yonemura February 16, 2014(2014-02-16) October 1, 2023",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_17",
    "transformers_text": "633 5 A Formidable Unknown Warrior Here Comes Lucy Transliteration Sai ky no Mume i Senshi R sh T j Japanese Tetsuya End Sh ji Yone mura February 16 2014 2014 02 16 October 1 2023 Luffy signs up for the tournament and Franky requests that Luffy not let anyone discover who he is so after a near mishap he becomes ' Lucy ' registered with the ' 0556 ' number on the back of his shirt Luffy and Franky get separated with Thunder Soldier looking at a board Franky then asks Thunder Soldier about the Don Quixote family and a ' factory ' much to Thunder Soldier's surprise Meanwhile Sanji is with Violet wandering around Dress rosa Luffy defeats Spartan after he tries to punch him several times nearly getting disqualified until a fighter named Sai explains that Spartan was the one who started the fight Also the Funk Brothers argue with D agama claiming he's ' forming alliances ' in his block The episode ends with Luffy searching for a new armor with Cavendish appearing telling Lucy there is a weight limit",
    "tf_idf_text": "formidable unknown warrior come lucy transliteration sai mume senshi japanese tetsuya end yone mura february october luffy sign tournament franky request luffy not let anyone discover near mishap becomes lucy register number back shirt luffy franky get separate thunder soldier look board franky ask thunder soldier quixote family factory much thunder soldier surprise meanwhile sanji violet wander around dress rosa luffy defeat spartan try punch several time nearly get disqualify fighter name sai explain spartan one start fight also funk brother argue agama claim he form alliance block episode end luffy search new armor cavendish appear tell lucy weight limit"
}