{
    "title": "653 25 \"A Decisive Battle! Giolla vs. the Straw Hats!\"Transliteration: \"Kessen! Jōra tai Mugiwara no Ichimi\" (Japanese:決戦！ジョーラVS麦わらの一味) Tetsuya Endō Tomohiro Nakayama July 13, 2014(2014-07-13) February 11, 2024",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_17",
    "transformers_text": "653 25 A Decisive Battle Gi oll a vs the Straw Hats Transliteration K essen J ra tai Mugi war a no Ichi mi Japanese VS Tetsuya End Tomohiro Nakayama July 13 2014 2014 07 13 February 11 2024 At Green Bit Do flamingo reveals that 19 of the 20 kings who formed the World Government moved to Marie jo is leaving their homelands to elect new rulers He then tells a defeated Law that the Don quixote Family once ruled Dress rosa before the Riku family Meanwhile Zoro and Kin ' em on regroup with Sanji outside the Colosseum After discussing their plan Sanji gives Kin ' em on the map to the toy house and leaves with Violet to rescue their ship Zoro and Kin ' em on search for a way into the Colosseum while avoiding attention but Bartolomeo spots them and fan girls over Zoro whom he idolizes as the Straw Hats ' first mate On the Thousand Sunny now distorted by Gi oll a's powers Brook pretends to cooperate with her art antics while secretly plotting He tricks her into restoring his sword and quickly defeats her With her now down her art spell breaks returning the ship and crew of Nami Chopper and Momo no suke back to normal Gi oll a makes one last stand by transforming herself into art she calls Heaven's Door Art but Nami uses the Gaon Cannon to finish her off with Momo no suke delivering the final blow to her with a bat",
    "tf_idf_text": "decisive battle oll straw hat transliteration essen tai mugi war ichi japanese tetsuya end tomohiro nakayama july february green bit flamingo reveals king form world government move marie leave homeland elect new ruler tell defeat law quixote family rule dress rosa riku family meanwhile zoro kin regroup sanji outside colosseum discussing plan sanji give kin map toy house leave violet rescue ship zoro kin search way colosseum avoid attention bartolomeo spot fan girl zoro idolizes straw hat first mate thousand sunny distort oll power brook pretend cooperate art antic secretly plot trick restore sword quickly defeat art spell break return ship crew nami chopper momo suke back normal oll make one last stand transform art call heavens door art nami use gaon cannon finish momo suke deliver final blow bat"
}