{
    "title": "655 27 \"A Big Clash! Sanji vs. Doflamingo!\"Transliteration: \"Dai Gekitotsu! Sanji tai Dofuramingo\" (Japanese:大激突！サンジVSドフラミンゴ) Ayako Hiraike Yoshiyuki Suga August 3, 2014(2014-08-03) February 25, 2024",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_17",
    "transformers_text": "655 27 A Big Clash Sanji vs Do flamingo Transliteration Dai Geki to tsu Sanji tai Do fur amin go Japanese VS Aya ko Hira ike Yoshiyuki Suga August 3 2014 2014 08 03 February 25 2024 Sanji puts up a valiant fight but is ultimately defeated by Do flamingo Before Do flamingo can finish him off Sanji is saved by Law who teleport s themselves back to the Thousand Sunny With Caesar back in their control Law orders the Straw Hats to head to Zo u immediately Though the Straw Hats are reluctant in leaving their remaining friends behind they are forced to agree when they are assaulted by a flying Marine battleship courtesy of Fuji tora and another one of Do flamingo's string whips but not before Sanji questions Law on why he's fixated on Do flamingo when their true objective is defeating Kai do Law reveals that Do flamingo cannot pursue them in cloudless areas with his String String Fruit and advises them to find one fast Once the Straw Hats escape with Caesar and the Navy head back to Dress rosa the two Warlords have a showdown on the iron bridge Law told his former leader that he is ending the alliance with the Straw Hats because once they stop the production of SMILE Kai do will kill Do flamingo Law also reveals that his goal was to make Do flamingo pay for what he did 13 years ago even if it cost him his own life",
    "tf_idf_text": "big clash sanji flamingo transliteration dai geki tsu sanji tai fur amin japanese aya hira ike yoshiyuki suga august february sanji put valiant fight ultimately defeat flamingo flamingo finish sanji save law teleport back thousand sunny caesar back control law order straw hat head immediately though straw hat reluctant leave remain friend behind forced agree assault fly marine battleship courtesy fuji tora another one flamingo string whip not sanji question law he fixate flamingo true objective defeating kai law reveals flamingo cannot pursue cloudless area string string fruit advise find one fast straw hat escape caesar navy head back dress rosa two warlord showdown iron bridge law tell former leader end alliance straw hat stop production smile kai kill flamingo law also reveal goal make flamingo pay year ago even cost life"
}