{
    "title": "657 29 \"The Most Violent Fighter! Logan vs. Rebecca!\"Transliteration: \"Saikyō no Senshi! Rōgan tai Rebekka\" (Japanese:最凶の戦士！ローガンVSレベッカ) Kōhei Kureta Hirohiko Kamisaka August 17, 2014(2014-08-17) March 10, 2024",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_17",
    "transformers_text": "657 29 The Most Violent Fighter Logan vs Rebecca Transliteration Sai ky no Senshi R gan tai Re be kka Japanese VS K he i Kure ta Hiro hi ko Kami saka August 17 2014 2014 08 17 March 10 2024 Bartolomeo searches for Luffy while he stumbles upon the infirmary with the losers of Block C Inside the Colosseum Sai is being treated along with all of the other injured fighters who never knew Sai was secretly dropped into an underground chamber where all the tournament dropouts and diseased toys were thrown Everyone there has no clue what Do flamingo plans on doing with them In the Cor rida Colosseum the crowd accuses Rebecca of running around and avoiding the fight while Rolling Logan is chasing her knocking out other contestants in the process Rebecca is fighting Rolling Logan while the latter tries to break her bones He eventually grabs her and starts to squeeze her till A cilia shows up to save her and Rebecca manages to overpower Logan and has him fall out of the ring A cilia then teams up with Rebecca to ensure her chance to reach the finals Meanwhile Luffy tries to get a better view of the screen while discussing the dark nature of Dress rosa with the prisoner gladiators when all of a sudden he encounters Bartolomeo",
    "tf_idf_text": "violent fighter logan rebecca transliteration sai senshi gan tai kka japanese kure hiro kami saka august march bartolomeo search luffy stumble upon infirmary loser block inside colosseum sai treat along injured fighter never know sai secretly drop underground chamber tournament dropout diseased toy thrown everyone clue flamingo plan cor rida colosseum crowd accuse rebecca run around avoid fight roll logan chase knock contestant process rebecca fight roll logan latter try break bone eventually grabs start squeeze till cilium show save rebecca manages overpower logan fall ring cilia team rebecca ensure chance reach final meanwhile luffy try get well view screen discuss dark nature dress rosa prisoner gladiator sudden encounter bartolomeo"
}