{
    "title": "658 30 \"A Big Surprise! A True Identity of the Toy Soldier!\"Transliteration: \"Shōgeki! Omocha no Heitai no Shōtai!\" (Japanese:衝撃！おもちゃの兵隊の正体！) Katsumi Tokoro Tomohiro Nakayama August 24, 2014(2014-08-24) March 24, 2024",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_17",
    "transformers_text": "658 30 A Big Surprise A True Identity of the Toy Soldier Transliteration Sh geki O mocha no He itai no Sh tai Japanese Katsumi To koro Tomohiro Nakayama August 24 2014 2014 08 24 March 24 2024 After some conversation Ricky reveals himself to be Riku D old III the former king of Dress rosa and Rebecca's grandfather Many of the fighters in the holding cell show their respect to the former king and Do flamingo's role as an agitator and arms dealer in inter kingdom conflict is discussed Suddenly a thread of goo from the ceiling snares Sai and drags him up a tunnel where Tr bol by unseen means turns him into a toy and releases him out into the public In the Flower Fields Gan cho reveals to Us opp Robin and Franky the cruelty of the Don quixote Family from 900 years ago and how the Dwarves were slaved up until the rise of the Riku Family The dwarfs all agree that Do flamingo's presence is a terrible thing for the country and that an incident framed King Dol do III as a villain so he is undeservedly hated by Dress rosa today Finally the Thunder Soldier reveals that he is Rebecca's father",
    "tf_idf_text": "big surprise true identity toy soldier transliteration geki mocha itai tai japanese katsumi koro tomohiro nakayama august march conversation ricky reveals riku old former king dress rosa rebeccas grandfather many fighter hold cell show respect former king flamingos role agitator arm dealer inter kingdom conflict discuss suddenly thread goo ceiling snare sai drags tunnel bol unseen mean turn toy release public flower field gan cho reveals opp robin franky cruelty quixote family year ago dwarves slave rise riku family dwarf agree flamingo presence terrible thing country incident frame king dol villain undeservedly hat dress rosa today finally thunder soldier reveals rebeccas father"
}