{
    "title": "670 42 \"Dragon Claw Strikes! Lucy's Intimidating Attack!\"Transliteration: \"Ryū no Tsume Sakuretsu! Rūshī Kyōi no Ichigeki!\" (Japanese:竜の爪炸裂！ルーシー脅威の一撃！) Directed by: Aya KomakiStoryboarded by: Kōhei Hatano & Kenji Yokoyama Hirohiko Kamisaka November 16, 2014(2014-11-16) June 9, 2024",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_17",
    "transformers_text": "670 42 Dragon Claw Strikes Lucy's Intimidating Attack Transliteration Ry no Tsu me S a kure tsu R sh Ky i no Ichi geki Japanese Directed by Aya Ko maki Story boarded by K he i Hat a no Kenji Yokoyama Hiro hi ko Kami saka November 16 2014 2014 11 16 June 9 2024 Leo prepares to plant the Tata ba basco grape in Sugar's bowl but is stopped by Robin after she sees how dangerous Tr bol is In the Colosseum Jesus Burgess earned the ire of the audience when he indiscriminately attacked the crowd while fighting the boss fighting fish The fighting fish with the prize tried to attack Rebecca but missed and Lucy managed to get on top of the beast Diam ante moved to attack Lucy but broke his sword against the latter's pipe in the process Jesus tried his turn to attack but Lucy intercepted and destroyed his elbow guard with Diam ante noticing the change in Lucy's fighting style Inside the harbor lift Lao G has stumbled upon Thunder Soldier's squad and proceeds to prevent them from reaching Do flamingo Inside the palace Kin ' em on decides to disguise himself to elude the Don quixote Family members while Zoro has Luffy and Viola move on while he fights Pica",
    "tf_idf_text": "dragon claw strike lucys intimidate attack transliteration tsu kure tsu ichi geki japanese direct aya maki story board hat kenji yokoyama hiro kami saka november june leo prepare plant tata basco grape sugar bowl stop robin see dangerous bol colosseum jesus burgess earn ire audience indiscriminately attack crowd fighting bos fight fish fight fish prize try attack rebecca miss lucy manage get top beast diam ante move attack lucy break sword latter pipe process jesus try turn attack lucy intercept destroyed elbow guard diam ante notice change lucy fight style inside harbor lift lao stumble upon thunder soldier squad proceeds prevent reach flamingo inside palace kin decides disguise elude quixote family member zoro luffy viola move fight pica"
}