{
    "title": "685 57 \"Steady Progress! Luffy's Army vs. Pica!\"Transliteration: \"Kai Shingeki! Rufi Gundan tai Pīka!\" (Japanese:快進撃！ルフィ軍団VSピーカ！) Aya Komaki Tomohiro Nakayama March 22, 2015(2015-03-22) September 15, 2024",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_17",
    "transformers_text": "685 57 Steady Progress Luffy's Army vs Pica Transliteration Kai Shin geki Ru fi Gund an tai P ka Japanese VS Aya Ko maki Tomohiro Nakayama March 22 2015 2015 03 22 September 15 2024 After Pica's arm was destroyed by Chin jao and Eliza bello II the Colosseum fighters proceed to decimate the Do flamingo soldiers However Pica attacked again with his remaining arm throwing the fighters in disarray The Colosseum fighters then noticed that Luffy is missing and one of them sees Luffy riding U cy the Bull while climbing the colossal arm toward the giant's head Pica noticed this and grew his arm back before going to strike his attacker but Luffy was ready and breaks the giant's head off with a Grizzly Magnum Meanwhile Robin's group reaches the top of the plaza and manages to elude their pursuers Pica is then revealed to be controlling the colossus from within He prepares to cut Luffy down with a huge sword but Zoro intercepts it and stays behind to duel Pica while Luffy races toward Do flamingo's palace",
    "tf_idf_text": "steady progress luffys army pica transliteration kai shin geki gund tai japanese aya maki tomohiro nakayama march september pica arm destroy chin jao eliza bello colosseum fighter proceed decimate flamingo soldier however pica attacked remain arm throw fighter disarray colosseum fighter notice luffy miss one see luffy rid bull climb colossal arm toward giant head pica notice grow arm back go strike attacker luffy ready break giant head grizzly magnum meanwhile robin group reach top plaza manages elude pursuer pica reveal control colossus within prepares cut luffy huge sword zoro intercept stay behind duel pica luffy race toward flamingos palace"
}