{
    "title": "686 58 \"A Shocking Confession! Law's Soulful Vow!\"Transliteration: \"Shōgeki Kokuhaku! Rō Atsuki Tamashī no Chikai!\" (Japanese:衝撃告白！ロー熱き魂の誓い！) Tetsuya Endō Jin Tanaka March 29, 2015(2015-03-29) September 15, 2024",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_17",
    "transformers_text": "686 58 A Shocking Confession Law's Soulful Vow Transliteration Sh geki Koku haku R A tsuki Tamas h no Chi kai Japanese Tetsuya End J in Tanaka March 29 2015 2015 03 29 September 15 2024 While the fighters march forward after climbing over Pica's body Law who was still with Luffy makes a decision to fight Do flamingo directly revealing that thirteen years ago Corazon Law's benefactor a top executive of the Don quixote Family as well as Do flamingo's biological brother was killed by Do flamingo Robin's group reaches Viola and D old's location and plan to follow Luffy's group to hand over the key to Law's handcuffs Rebecca and Bartolomeo offer to give Law's handcuffs key to Luffy but Dol do is still hesitant to trust the pirates However with Viola's and Leo's confidence that the Straw Hat pirates can save them as opposed the Government's indifference and indulgence to Do flamingo Dol do realizes that the people have unintentionally looked to the Straw Hats for hope Meanwhile as Franky tries to destroy the factory he is interrupted by Se or Pink and they engage in another battle",
    "tf_idf_text": "shock confession law soulful vow transliteration geki koku haku tsuki tamas chi kai japanese tetsuya end tanaka march september fighter march forward climb pica body law still luffy make decision fight flamingo directly reveal thirteen year ago corazon law benefactor top executive quixote family well flamingos biological brother kill flamingo robin group reach viola old location plan follow luffys group hand key law handcuff rebecca bartolomeo offer give law handcuff key luffy dol still hesitant trust pirate however violas leos confidence straw hat pirate save oppose government indifference indulgence flamingo dol realize people unintentionally look straw hat hope meanwhile franky try destroy factory interrupt pink engage another battle"
}