{
    "title": "727 99 \"A Massive Counterattack! Doflamingo's Awakening!\"Transliteration: \"Dai Gyakushū! Dofuramingo no Kakusei!\" (Japanese:大逆襲！ドフラミンゴの覚醒！) Yoshihiro Ueda Shōji Yonemura January 24, 2016(2016-01-24) May 25, 2025",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_17",
    "transformers_text": "727 99 A Massive Counterattack Do flamingo's Awakening Transliteration Dai Gya kush Do fur amin go no Kaku sei Japanese Yoshihiro Ueda Sh ji Yone mura January 24 2016 2016 01 24 May 25 2025 As Law and Cavendish watch Luffy's and Do flamingo's battle from the Flower Field Law notes that Luffy is overusing his Hak i On the palace rooftop Jesus Burgess searches for Luffy and sees him bouncing through the town Koala who hides behind a pile of rubble wonders what he wants with Luffy As Franky and the dwarves evacuate the SMILE Factory they realize that the Birdcage is not cutting it up which Franky realizes is because of it being made of Sea stone Zoro Kin ' em on and Kan j uro end up running into the group and explain to them their intention to stop the Birdcage before departing while Franky gets an idea Luffy continues battling Do flamingo however the Warlord reveals that his Devil Fruit has achieved a state known as Awakening and he overwhelms Luffy by turning the surrounding area into string Meanwhile the people on Dress rosa continue running from the Birdcage but start losing hope However Riku galvanizes them by revealing that only Do flamingo remained standing and that Luffy would free them",
    "tf_idf_text": "massive counterattack flamingo awaken transliteration dai gya kush fur amin kaku sei japanese yoshihiro ueda yone mura january may law cavendish watch luffys flamingos battle flower field law note luffy overuse hak palace rooftop jesus burgess search luffy see bounce town koala hide behind pile rubble wonder want luffy franky dwarf evacuate smile factory realize birdcage not cut franky realizes make sea stone zoro kin kan uro end run group explain intention stop birdcage depart franky get idea luffy continue battle flamingo however warlord reveals devil fruit achieve state know awaken overwhelms luffy turn surround area string meanwhile people dress rosa continue run birdcage start lose hope however riku galvanizes reveal flamingo remain stand luffy would free"
}