{
    "title": "1 \"Defeat! Gyanzack the Pirate!\"[420][n 17]Transliteration: \"Taose! Kaizoku Gyanzakku\" (Japanese:倒せ!海賊ギャンザック) July 26, 1998(1998-07-26)",
    "url": "https://en.wikipedia.org/wiki/List_of_One_Piece_episodes_(seasons_1%E2%80%938)",
    "transformers_text": "1 \"Defeat! Gyanzack the Pirate!\"[420][n 17]Transliteration: \"Taose! Kaizoku Gyanzakku\" (Japanese:倒せ!海賊ギャンザック) July 26, 1998(1998-07-26)\n\nWhilst running low on food supplies, Luffy, Zoro and Nami are suddenly attacked by a strange sea creature who destroys their boat and captures Nami. Washing up on a nearby island, Luffy and Zoro meet a girl named Medaka, learning from her grandfather that her father, along with many others in the islands village, have been captured by the pirate Gyanzack, who is forcing them to build a huge cannon. With the incentive of food, Luffy and Zoro attack Gyanzack's hideout, only to wind up captured. However, their attempts inspire the villagers to fight back, allowing Nami to spring Luffy and Zoro free. Gyanzack soon attempts to flee on his ship, using his new cannon to bomb the island, but the combined efforts of Luffy, Zoro, Nami and Medaka put a stop to his plan.Note: This OVA was produced byProduction I.Gand features a different voice cast from the television series.",
    "tf_idf_text": "defeat gyanzack piraten transliteration taose kaizoku gyanzakku japanese july whilst run low food supply luffy zoro nami suddenly attack strange sea creature destroy boat capture nami wash nearby island luffy zoro meet girl name medaka learn grandfather father along many others islands village capture pirate gyanzack force build huge cannon incentive food luffy zoro attack gyanzacks hideout wind capture however attempt inspire villager fight back allow nami spring luffy zoro free gyanzack soon attempt flee ship use new cannon bomb island combine effort luffy zoro nami medaka put stop plannote ovum produce byproduction igand feature different voice cast television series"
}