{
    "title": "en.wikipedia.org_wiki_Dragon_Ball__Yo!_Son_Goku_and_His_Friends_Return!!",
    "url": "https://en.wikipedia.org/wiki/Dragon_Ball:_Yo!_Son_Goku_and_His_Friends_Return!!",
    "transformers_text": "Dragon Ball: Yo! Son Goku and His Friends Return!! [ a ] is a 35-minute Japanese animated short film based on Akira Toriyama 's Dragon Ball series, shown on the Jump Super Anime Tour from September 21 to November 23, 2008. It was the first animated Dragon Ball film in twelve years, following the tenth anniversary film The Path to Power .\n\nTwo years after Kid Buu 's defeat by Goku , Mr. Satan , feeling guilty that his new hotel is in honor of what the majority of Earth believes to be his victory over Kid Buu, invites Goku, Vegeta , and their families to a banquet. During dinner, two Saiyan spaceships land and a mysterious Saiyan and his wife confront the heroes at the hotel. Vegeta's younger brother, Tarble, introduces himself and explains that he was deemed weak by their father King Vegeta and sent to a distant planet before the destruction of Planet Vegeta by Frieza . He also introduces his wife Gure, a small alien humanoid. Tarble asks his brother for help in dealing with Abo and Kado, soldiers from remnants of Frieza's army, who are causing havoc on his planet.\n\nAs Abo and Kado arrive on Earth, the heroes pick radishes from Goku's garden to determine who will battle the duo and Goten picks the longest. Pressured by his father, Trunks picks out a radish that stretches for miles. Goten joins Trunks in the fight and the children easily defeat the two soldiers until Abo and Kado create doubles of themselves. With encouragement from Gohan , Goten and Trunks gain the upper hand. Abo and Kado merge into their larger, more powerful form, Aka.\n\nAka devastates Goten and Trunks so they perform the Fusion Dance, fail their first attempt, but succeed with in the second. Now fully powered as Gotenks, he quickly appears to defeat Aka. However, while everyone is celebrating, Aka attacks again after Gotenks taunts him; but Piccolo blocks the attack. Aka destroys most of the hotel and with the threat growing, Goku and Vegeta join the fight; but Goku tricks Vegeta into looking away while he defeats Aka with a Kamehameha wave. With the battle over, everyone returns to what is left of the hotel and continue the banquet. Abo and Kado join in on the feast. The special ends with Goku and Vegeta fighting over food, transforming into Super Saiyans as they argue.\n\nThe film was first announced in the April 21 issue of Weekly Shōnen Jump magazine. Stating that it would premiere along with One Piece: Romance Dawn Story at the Jump Super Anime Tour and visit ten Japanese cities to celebrate Shōnen Jump' s 40th anniversary. [ 1 ] In the June 9 issue of Weekly Shōnen Jump it was announced that the story would be based on an original concept by Dragon Ball creator Akira Toriyama , revisiting the comedic story-telling seen early in the series. [ 2 ] [ 3 ] The following August issue of V Jump revealed a small hint of the plot and that at least three new characters would appear. [ 4 ]\n\nThe site Jumpland began streaming the film to both Japanese and English speaking viewers on their website on November 24, 2008, the Monday following the final stop on the Super Tour and was discontinued on January 31, 2009. [ 5 ] Shortly before ending, it was announced that the film would be made available along with One Piece: Romance Dawn Story and Tegami Bachi: Light and Blue Night Fantasy on a triple feature DVD that would only be available though a mail-in offer exclusive to Japanese residents. [ 6 ] The special was included as a bonus feature on the more widely available, limited edition home release of the 2013 film Dragon Ball Z: Battle of Gods on September 13, 2013.\n\nIn the February issue of V Jump it was announced that a manga adaptation illustrated by Naho Ōishi was in the works; it was published in the magazine's March 21 and April 21, 2009, issues. [ 7 ] A film comic version was released in a single tankōbon volume on September 3, 2010. [ 8 ]",
    "tf_idf_text": "dragon ball son goku friend return minute japanese animate short film base akira toriyama dragon ball series show jump super anime tour september november first animate dragon ball film twelve year follow tenth anniversary film path power two year kid buu defeat goku satan feel guilty new hotel honor majority earth believe victory kid buu invite goku vegeta family banquet dinner two saiyan spaceship land mysterious saiyan wife confront hero hotel vegetas young brother tarble introduces explain deem weak father king vegeta send distant planet destruction planet vegeta frieza also introduce wife gure small alien humanoid tarble ask brother help deal abo kado soldier remnant friezas army cause havoc planet abo kado arrive earth hero pick radish gokus garden determine battle duo goten pick long pressure father trunk pick radish stretch mile goten join trunk fight child easily defeat two soldier abo kado create double encouragement gohan goten trunk gain upper hand abo kado merge large powerful form aka aka devastate goten trunk perform fusion dance fail first attempt succeed second fully power gotenks quickly appear defeat aka however everyone celebrate aka attack gotenks taunt piccolo block attack aka destroys hotel threat grow goku vegeta join fight goku trick vegeta look away defeat aka kamehameha wave battle everyone return leave hotel continue banquet abo kado join feast special end goku vegeta fight food transform super saiyans argue film first announce april issue weekly shnen jump magazine state would premiere along one piece romance dawn story jump super anime tour visit ten japanese city celebrate shnen jump anniversary june issue weekly shnen jump announce story would base original concept dragon ball creator akira toriyama revisit comedic storytelling see early series follow august issue jump reveal small hint plot least three new character would appear site jumpland begin stream film japanese english speaking viewer website november monday follow final stop super tour discontinue january shortly end announce film would make available along one piece romance dawn story tegami bachi light blue night fantasy triple feature dvd would available though mailin offer exclusive japanese resident special include bonus feature widely available limited edition home release film dragon ball battle god september february issue jump announce manga adaptation illustrate naho ishi work publish magazine march april issue film comic version release single tankbon volume september"
}