{
    "title": "en.wikipedia.org_wiki_The_Giant_Mechanical_Soldier_of_Karakuri_Castle",
    "url": "https://en.wikipedia.org/wiki/The_Giant_Mechanical_Soldier_of_Karakuri_Castle",
    "transformers_text": "Since the premiere of the anime adaptation of the manga series One Piece by Eiichiro Oda in 1999, Toei Animation has produced 15 feature films based on the franchise traditionally released during the Japanese school spring break since 2000. [ 1 ] Four of the films were originally shown as double features alongside other Toei film productions and thus have a running time below feature length (between 30 and 56 minutes). The first three films were shown at the Toei Anime Fair ( 東映アニメフェア , Toei Anime Fea ) and the eleventh was released as part of Jump Heroes Film . The films generally use original storylines, but some adapt story arcs from the manga directly. With the release of films ten, twelve, thirteen, and fourteen, tie-in story arcs of the TV series were aired concurrently.\n\nAdditionally, three of these films have had special featurette shorts, showcasing the characters engaged in various activities unrelated to the series. There are also 13 television specials that were broadcast on Fuji TV and two short films , which were shown at the 1998 Jump Super Anime Tour and 2008 Jump Super Anime Tour, respectively.\n\nAs with the franchise's anime television series, the eighth, tenth, twelfth, thirteenth, fourteenth, and fifteenth films have been licensed by Funimation / Crunchyroll and released in both subtitled and dubbed formats. Additionally, the first through seventh and ninth films have been released in the United Kingdom with English subtitles. [ 2 ]\n\nOne Piece (also known as One Piece: The Movie in some markets) is the first animated feature film of the franchise, starring Mayumi Tanaka as Monkey D. Luffy , Kazuya Nakai as Roronoa Zorro , Akemi Okamura as Nami , and Kappei Yamaguchi as Usopp . It premiered in Japan on March 4, 2000 and was released to DVD on January 21, 2001. [ 3 ] The film was shown in a double bill with Digimon Adventure: Our War Game! . In the first week, the film attained second place in the Japanese box office, third place during their second week, and first place during the fourth and fifth weeks. [ 4 ]\n\nThe legend of the Great Gold Pirate Woonan remains intact, years after his disappearance. Many pirates search for his mountain of gold hidden on a remote island, among them are Captain El Drago and his men. By hunting down every member of Woonan's former crew, they eventually take possession of a map to that hidden island. On their way there, they meet and decide to rob the Straw Hat Pirates, who, still lacking a cook, are close to starvation. A short fight ensues, during which Luffy, Zorro, and Tobie, a boy who ran away from home to become part of Woonan's crew, are separated from the other Straw Hats and their ship, staying afloat on the shattered remains of what at some point was a boat. Following the scent of food, they quickly arrive at a floating oden bar, run by Tobie's grandfather, Gansu. El Drago and his crew land on Woonan's island, where they encounter Usopp, who, to evade being killed, convinces them that he is a professional treasure hunter, offers them his help, and using their map, starts leading them around. Meanwhile, somewhere else on the island, Zorro and Luffy, chained together for trying to eat-and-run, get lost and attempt to get back to the shore. With the help of Nami, Usopp gets away from the enemy crew. The Straw Hats meet up and take a closer look at the treasure map. They conclude that Woonan's treasure must be hidden on the island's only mountain and set out to climb it. On their way up, they meet Gonzo, who reveals to them that he and Woman had grown up like brothers in the same village. Atop the mountain they find an empty house with a secret entry to a basement. El Drago and his men arrive and are beaten by Luffy and Zorro. Then the group climbs into the basement. There, Woonan's skeleton is sitting in an empty room, a message for his old friend Gonzo written on the walls. With gold from El Drago's ship, the Straw Hats set sail, resuming course for the Grand Line .\n\nClockwork Island Adventure is the second animated feature film of the franchise, the first to use digital ink and paint and the first to additionally star Hiroaki Hirata as Sanji . It premiered in Japan on March 3, 2001 and was released to DVD on October 21, 2001. [ 5 ] The film was shown in a double bill with Digimon Adventure 02: Diaboromon Strikes Back . [ 6 ] The film was shown along with a six-minute featurette short named Jango's Dance Carnival .\n\nWhile the Straw Hats enjoy a warm day at the beach, their ship with all their equipment and weapons is stolen. They can do nothing but watch, as it disappears into the distance. A week later, dressed in cloth from a rental store for wedding ceremonies and riding a one-person paddle boat they set out to go after their lost belongings. At sea, they encounter the boy Akizu and the young man Borodo. The two call themselves the Thief Brothers and claim to be after a well-known treasure, called the Diamond Clock from Clockwork Island. Actually, they are the ones who stole the Straw Hats' ship and brought it to Clockwork Island to make the Straw Hats fight the Trump Siblings. The Trump Siblings Boo Jack, Honey Queen, Skunk One, Pin Joker, and Bear King (the leader), are another pirate crew who occupied Clockwork Island for years and forced its inhabitants to build weapons. A number of ships bearing the mark of the Trump Siblings appear and a short fight ensues, during which the Thief Brothers' ship is destroyed and Nami abducted. Using mere pieces of wood to stay afloat and an improvised sail for propulsion, the group manages to reach the foot of Clockwork Island. A long, circular staircase laced with deadly traps leads up to the actual island. There, Nami makes the acquaintance of the Trump Siblings' captain, Bear King. He takes a liking to her and decides to make her his bride. Eventually the Thief Brothers and the remaining Straw Hats make it to the end of the stairway and onto the main island. A beautiful landscape appears in front of them, but the island's citizens are in no mood to cherish it. Not knowing that Akizu is their son, a pair of them tells the group of the island's past. Then the heroes storm the Trump Siblings' stronghold, built around the island's key, which holds the island together. One after another, the Straw Hats get picked off and captured, until only Luffy remains. Once he reaches the stronghold's top and frees his crew, the movie climaxes in an all-out battle, during which the Trump Siblings are defeated and the island's key is destroyed. Clockwork Island crashes down into the ocean, but Akizu reunites with his family and the Straw Hats reclaim their ship.\n\nChopper's Kingdom on the Island of Strange Animals is the third animated feature film of the franchise and the first to additionally star Ikue Ohtani as Tony Tony Chopper . It premiered in Japan on March 2, 2002 and was released to DVD on October 21, 2002. [ 7 ] The film was shown in a double bill with Digimon Tamers: Runaway Locomon . From the first week, the film made a six-week run in the Top 10 of the Japanese box office, placing third in the first two weeks, fifth and fourth in the third and fourth weeks, respectively, and sixth in the fifth and sixth weeks. [ 8 ] The film was shown along with a six-minute featurette short named Dream Soccer King! .\n\nWith Chopper as their newest member, the Straw Hats arrive at the Island of Strange Animals. Before they can land, a geyser-like fountain sends their ship flying. Chopper falls off and lands in the middle of a gathering of animals. They are performing a ritual, which according to their legend, is supposed to cause a king to fall from the heavens. Believing that legend fulfilled, they proclaim Chopper their new king. The other Straw Hats, searching for their lost crewmate, make the acquaintance of the self-proclaimed genius and expert treasure hunter Count Butler, with his henchmen General Hot Dog and President Snake. Butler is in search of the horns of a particular animal living on the island, which when eaten bestows great power upon the eater. For that purpose, he uses a hoard of bovinae -like animals called horn eaters, which he controls by playing music on a special violin, to round up horn bearing animals. The Straw Hats, unknowingly, lead Butler to Chopper and the group of animals, whose king he has become. Butler gives the gathered animals an ultimatum, to hand over their king, whose horns he believes to be what he is looking for, or to be crushed by his horn eaters. But Chopper does not need to be turned over. He steps forward himself and lures the horn eaters away from the island's animals. A fight ensues and it does not take long until the remaining Straw Hats join in to take their fill. Zoro takes on Hot Dog and Sanji fights with Snake, while Usopp and Nami take care of the horn eaters. Butler fights with Chopper and is about to finish him off, when Momambi, a young boy and the only human inhabitant of the island, shows up with the former king's horns to lure Butler away from Chopper. The plan backfires, as Butler gets hold of the horns, quickly stuffs them down, and transforms into a large, horned, gorilla-like animal. With that he appears to be winning, until the island's animals and Luffy enter the fight. Luffy defeats Butler and breaks his horns, thus canceling his transformation, and sends him flying. Mobambi fears to be exiled from the island for losing the former king's horns but instead is elected the animal king.\n\nDead End Adventure is the fourth animated feature film of the franchise and the first to additionally star Yuriko Yamaguchi as Nico Robin . It premiered in Japan on March 1, 2003 and was released to DVD on July 21, 2003. [ 9 ] The film made a seven-week run in the Top 10 of the Japanese box office, placing second in its first week of showing, then fifth for two weeks, sixth for another two weeks, seventh in its sixth week, and tenth in its seventh week of showing. [ 10 ]\n\nIn a port town pub, the once again flat broke Straw Hats witness a suspicious exchange between a customer and the proprietor. Nami immediately senses money and plans to convince the host to give her whatever information he had given him. The other Straw Hats join in and soon he is persuaded. He shows them to a backdoor, behind which they find a long and winding tunnel. That tunnel leads to a large underground chamber, where a number of pirate crews have a gathering. The island they are on turns out to be the starting point of an irregularly occurring, anything-goes sailing competition. For a moment, the Straw Hats decide whether it is wise to join the race, considering that two giants and a crew of fish-men, who were once the rivals of Arlong 's gang, were participating as well. But once they learn the magnitude of the prize money, not entering is out of the question. From the bookmaker they receive an eternal pose , to lead them to the goal of the race. Free food is available at the bottom of the chamber and Luffy makes extensive use of it. His eating habit of stealing other people's food quickly angers the bounty hunter Shuraiya Bascùd, as well as a group of men from General Gasparde's crew. Gasparde is a deserted marine, with a bounty more than three times as high as Luffy's and said to be the race's favorite. A fight arises, and after Luffy and Shuraiya beat up his men, they find themselves standing before the general himself. He is impressed with their skill and offers both of them to work under him. Of course they refuse, but Luffy finds some insulting words and is caught off guard by Gasparde's right-hand man, Needles. Luffy's courage impresses Gasparde even more. He renews his offer, orders Needles to let go of the rookie pirate, and leaves the room. The next morning, a strong ocean current starts the race, by pushing the ships upstream over the island. As soon as they are over the top, the various crews start shooting broadsides, board each other's ships, and ram their competitors out of the water. But once the island is left behind, the field quickly clears up, leaving the Straw Hats time to eat. While inspecting the ship, Zoro discovers a boy named Anaguma, who had stowed away in order to earn money by killing some pirate to buy medicine for his adoptive grandfather, who works as an engineer on Gasparde's partially steam-powered ship. The race continues. After fighting yet another rival crew and an encounter with a group of large sea kings, they arrive at the island the eternal pose points to. The eternal poses were all mislabeled and led the fleet of unsuspecting pirates into reach of the cannons of the navy stronghold Navarone. Luffy has no doubt as to whose fault it is. They turn around and, using Chopper's fine nose, attempt to catch up with Gasparde's ship. Shuraiya, who had followed Gasparde's invitation to come along on his ship, turns against him to take revenge for Gasparde's killing his parents and sister. He fights Needles and throws him overboard but stands no chance against Gasparde's Syrup-Syrup Logia-type powers, which allow him to turn parts or all of his body into liquid or solid candy. The general is about to kill the bounty hunter when the Straw Hats arrive and catch his attention. Luffy confronts him and the two engage in a fierce but one-sided battle. Any attack Luffy throws at his opponent causes his limbs to get stuck in Gasparde's body. Only after Sanji gives two sacks of flour to Luffy can he overcome the villain's ability. Anaguma turns out to be a girl and Shuraiya's thought-dead sister, Adele Bascùd. With all their competitors taken out, the Straw Hats are about to finish the race, when a fleet of navy ships appears and forces them to abandon their prize money.\n\nThe Cursed Holy Sword is the fifth animated feature film of the franchise. It premiered in Japan on March 6, 2004 and was released to DVD on July 21, 2004. [ 11 ] The film made a five-week run in the Top 10 of the Japanese box office. In its first week of showing, it made third place, fourth place in its second week, followed by three weeks in fifth place. [ 12 ] The film was shown along with a five-minute featurette short named Take Aim! The Pirate Baseball King .\n\nZoro goes missing, as the Straw Hats restock. On their search for him, Sanji , Nami, Chopper, and Robin follows Maya, a girl of the island, to a village. There, Zoro appears, accompanied by a group of marines. Zoro wields his sword against Sanji and takes three jewel orbs from Maya. Luffy stumbles upon a training center of the local Marine division. There, he encounters Saga, the leader of the center and owner of the Seven Star Sword, who made Zoro take the orbs to revive that sword's slumbering power. Luffy fights him but falls from a cliff. The Seven Stars Sword was that which had ruined the country of Asuka with its cursed power a long time ago and had therefore been sealed. But with a night of a red full moon that occurs only once every hundred years, the jewel orbs in his possession, and Zoro on his side, only the remaining Straw Hats stand in the way of Saga reviving the sword's true power.\n\nBaron Omatsuri and the Secret Island is the sixth animated feature film of the franchise. It premiered in Japan on March 5, 2005 and was released to DVD on July 21, 2005. [ 13 ] The film had a six-week run in the Top 10 of the Japanese box office. It made third place in its first week, fourth place in its second week, followed by two weeks at sixth place, fifth place in its fifth week, and seventh place in the sixth week. [ 14 ]\n\nThe Straw Hats receive an invitation to an island resort on the Grand Line run by Baron Omatsuri, and the crew travels to the island intent on relaxing and having fun. The Baron welcomes them to the resort and encourages them to enjoy themselves, but only after they complete 'The Trials Of Hell'. The crew is hesitant, but Luffy accepts the challenge. The Straw Hats win the first trial, but the outraged Baron demands they compete in another challenge. Luffy, Chopper, and Robin wait at the resort while the rest of the crew participates in the second trial. Robin questions Muchigoro, one of Baron's crewmates, about a flower on the island. Muchigoro mentions something about the \"Lily Carnation\" being at the island's summit before running off. Luffy and Chopper wander off, both meeting other pirates who had previously arrived and participated in the trials. Luffy receives an ominous warning about Baron splitting up his crew. Chopper learns about Baron's past, but right before he figures out the mystery, he is stricken with an arrow shot by Baron. The Straw Hats win again, but rifts begin to grow between the crew members. The crew notices Chopper is missing, but Baron interrupts them with a dinner party. The Baron notices Robin leaving, and she reveals to him that she was looking for the Lily Carnation. Baron reveals the flower's secret to Robin while Robin looks shocked. The Straw Hats realize Chopper, Usopp, and Robin are gone. Arguments over who's to blame for their disappearances ensue before Baron announces the final trial. Tension between the crew results in the crew splitting up. The island known as Omatsuri Island was really a pirate island, only advertised as a resort by the Baron to lure pirates to the island to bring the same suffering and hatred he felt unto everyone else. Baron feeds the crew to the Lily Carnation, a flower of reincarnation, which gives life to Baron's crew. Luffy manages to save them from the Lily Carnation and defeat Baron with help from other pirates on the island. Baron cries for his friends that were lost and how he is alone. He had been fooling himself for years with the false constructs of his crew created by the Lily Carnation. Each of his dead crewmates speak with him, telling him that they were happy to be remembered, but not with his corrupted charade. They apologize for leaving him alone for so long but believe it would be for the best if he forgets the night they died and finds new friends. Luffy lays exhausted on the ground while the crew all appear unharmed with no memory of the incident. The Straw Hats gather around Luffy, wondering how he can sleep in such a place, and Luffy laughs.\n\nThe animation in this film is very different from the regular series, using the style often seen in Mamoru Hosoda's films. Some of the later episodes use styles similar to those seen in this film. The story also differs from the usually carefree and high strung style of writing that One Piece follows. The film follows a darker style of writing which received with mixed reviews.\n\nGiant Mecha Soldier of Karakuri Castle is the seventh animated feature film of the franchise. It premiered in Japan on March 4, 2006 and was released to DVD on July 21, 2006. [ 15 ] The film had a six-week run in the Top 10 of the Japanese box office. It made fourth place in its first week, sixth place in its second week, and seventh place in its third week. In its fourth week of showing, the film placed sixth again, followed by fifth place in week five, and tenth place in its sixth week of showing. [ 16 ]\n\nThe Straw Hats visit an island, known as Mecha Island, where a fisherman sings an old folk song about a Golden Crown. Searching for that mysterious treasure, they find a hidden entrance into the island. The island's leader, Ratchet, impressed with the find and in search of the Golden Crown himself, invites the crew to join him in his search, and the crew along with Ratchet and his henchmen enter the cave. As it turns out, the island's true form is that of a giant turtle. Ratchet, who had known this all along, uses his mechanical castle to take control of the turtle wishing to use it to take over the world. Now the Straw Hats have to stop not only Ratchet, but also the helpless turtle, from crashing into a nearby island.\n\nThe Desert Princess and the Pirates: Adventures in Alabasta is the eighth animated feature film of the franchise and the only One Piece film to additionally star Misa Watanabe as Nefeltari Vivi . It premiered in Japan on March 3, 2007 and was released to DVD on July 21, 2007. [ 17 ] The film was licensed by Funimation and given a limited theatrical release in the United States on February 7, 2008. Funimation also released the film to DVD on February 19, 2008 and to Blu-ray on January 27, 2009. [ 18 ] The film placed four times in the Top 10 of the Japanese weekend box office. It placed second in its first week, fourth in its second week, and ninth in its third and fourth weeks of showing. [ 19 ]\n\nThe film is an abridged retelling of the Alabasta storyline from the manga. The Straw Hats travel to Alabasta, the desert island and home of Nefertari Vivi. They find the country in the middle of a revolution. Sir Crocodile , the country's hero, secretly used his criminal organization, Baroque Works, to undermine the citizens' trust in Cobra, Vivi's father and head of the Kingdom of Sand, in order to seize the throne and the country's hidden secret for himself. The crew now has to cross the desert, stop the revolution, save thousands of lives from Baroque Works' hidden bombers, and most of all, defeat Crocodile, one of the mighty Seven Warlords of the Sea.\n\nThe TV cut of the film, first aired in April 2011 in Japan, adds a 15-minute prologue to the start of the film. The new section adapts the Whisky Peak arc in abridged form to explain how the crew meet Vivi.\n\nEpisode of Chopper Plus: Bloom in the Winter, Miracle Sakura is the ninth animated feature film of the franchise and the first to additionally star Kazuki Yao as Franky . It premiered in Japan on March 1, 2008 and was released to DVD on July 21, 2008. [ 20 ] The film had a five-week run in the Top 10 of the Japanese box office. It placed third in its first week of showing, seventh in its second, eighth in its third week, tenth in its fourth week, and ninth in its fifth week. [ 21 ]\n\nIt is the second film to focus on Chopper, as it is a retelling of the Drum Island storyline from the manga. It features Franky , Nico Robin, and the Thousand Sunny , who weren't present in the original version, replacing Nefertari Vivi , Karoo and the Going Merry from the canonical story. The plot also includes as a new character to Musshuru , Wapol 's older brother.\n\nThe 2014 TV cut of the film adds 2 new scenes, to frame the film, increasing the run time by 4 minutes. The film is shown to be a dream by Chopper set after the 2-year time skip.\n\nA picture of Chopper crying (which comes from promotional material and not the actual movie, which uses a modified shot), became a popular internet meme . [ 22 ]\n\nOne Piece Film: Strong World is the tenth animated feature film of the franchise, and the first to additionally star Chō as Brook . It was written by manga creator Eiichiro Oda himself. It was directed by Munehisa Sakai. News of the film first appeared during a showing of the Episode of Chopper Plus , during which a teaser for the tenth film was revealed. The film was originally meant for a spring release in 2009, but complications with the script pushed the release date back. Eventually, the film premiered on December 12, 2009. On July 28, 2012, Funimation announced that they had acquired the license to One Piece Film: Strong World and have since released the film on November 19, 2013.\n\nAs stated, the film is an original story written by Eiichiro Oda himself in honor of One Piece ' s Tenth Anniversary. In previous films, Oda only supplied character designs and approved story ideas. For One Piece Film: Strong World , Toei personally asked if he would write the script. The film is set between the Thriller Bark Arc and the Sabaody Archipelago Arc, as Brook is shown alongside the other Straw Hat Pirates (making this his first film appearance), and Sengoku and Garp are still in their positions in the Marines.\n\nStraw Hat Chase is the eleventh animated feature film of the franchise and the first to also use computer animation . It was directed by Hiroyuki Satō and was released in Japan on March 19, 2011, and was released to DVD and Blu-ray on July 20, 2011. [ 23 ] [ 24 ] It was double billed with the Toriko film Toriko 3D: Kaimaku! Gourmet Adventure! The film features Tomomitsu Yamaguchi as Schneider and Bazz, and the music was written and performed by the Tokyo Ska Paradise Orchestra . It was released as Jump Heroes Movies and Grossed $9,796,866 worldwide. [ 25 ]\n\nLuffy desperately tries to find his missing straw hat, and after extensive searching Usopp discovers that an eagle has it. Luffy and the entire Crew proceed to chase the eagle. While searching for Luffy's hat, Chopper discovers an old man lying half dead on a ship. While Luffy continues chasing the eagle and eventually crashes it into a marine base, the old man named Schneider wakes up. Chopper noticed that he had been mumbling the name Bazz in his sleep, and asks him who it is. Schneider tells Chopper that Bazz was his friend and that he was a dog that ate the \"tori tori no mi: model eagle\". He tells Chopper that he told Bazz to steal Monkey D. Luffy's hat and then he could come back. He thought that telling Bazz this would force him to abandon Schneider, because he didn't want Bazz to see him die. When Chopper informs him that not only did Bazz successfully steal Luffy's hat, but that he was on the Straw Hat Pirates' ship. Schneider immediately jumps out of bed and runs to save Bazz who at that moment is trapped in a cage with Luffy, made of kairouseki. After Luffy's crew frees him and Bazz, Schneider apologizes to Bazz and tells him to give up on the hat. Luffy meanwhile is fighting his way through a whole marine base along with three giants. Finally he makes it to the marine captain holding his hat, only to have him throw it out to sea. Luffy immediately jumps out after it, and almost has it when he starts to fall. Bazz then comes to his rescue and Luffy finally retrieves his hat. Afterwards Schneider and Bazz decide to go back out to sea and Schneider tells Luffy that the hat suits him.\n\nThe 12th One Piece film was released on December 15, 2012. As with Strong World , it is overseen by Eiichiro Oda. As well, it is the first One Piece film to take place in the New World, after the two-year time-skip. Zephyr (referred to as Z), an ex-admiral of the marines and leader of the Neo Navy, steals the Marines stash of \"Dyna Stones\", powerful explosives, that, when exposed to oxygen, explode with enough force to destroy islands. Using these stones, he plans on destroying the 3 End Points (3 volcanoes in the New World that connect to huge lava sources) and flood the New World with lava. When he runs into the Straw Hats and one of his subordinates revert Nami, Chopper, Robin, and Brook younger in age. It's up to Luffy, his crew, and other unexpected allies to find and stop Z from finishing his plan while having to fight not only the Neo Navy, but the Marines as well.\n\nThe film also portrays the cast wearing Armani Exchange suits in one part of the film, possibly as a promotional campaign. This was done in collaboration with the creator of the series, Eiichiro Oda, who selected the outfits designed by Armani Exchange. The Shibuya branch of Armani Exchange sells some of the suits in the film. [ 26 ]\n\nThe 13th One Piece film was released on July 23, 2016. The film followed the July 16, 2016 TV special titled One Piece: Heart of Gold. [ 27 ] The first 2016 issue of Shueisha's Weekly Shonen Jump magazine also revealed that Eiichiro Oda would be part of the anime film as executive producer. The report also states that anime director Hiroaki Miyamoto, who helmed \"One Piece\" episodes 352-679 and was assistant director for \"One Piece: Baron Omatsuri and the Secret Island,\" will be part of the \"One Piece Film: Gold\" as director. This anime film was penned by Tsutomu Kuroiwa, the scriptwriter of the live-action \"Black Butler\" film, the live-action \"Liar Game: The Final Stage\" film, and the live-action \"The Perfect Insider\" TV series.\n\nThe 14th One Piece film was released on August 9, 2019. [ 28 ] It was directed by Takashi Otsuka and was first announced following the broadcast of Episode of Skypiea . The film commemorates the anime's 20th anniversary. [ 29 ]\n\nThe 15th One Piece film was released on August 6, 2022. It was first announced in the November 21, 2021 issue of Weekly Shōnen Jump in commemoration of the anime Episode 1000's release. One Piece Film: Red is also the highest grossing One Piece film to date. Despite only being released to box office in Japan, its box office gross revenue is approximately 3 times higher than the next highest in Japan ( One Piece: Film Z ) and 1.7 times higher than One Piece: Stampede , which previously held the record for highest global box office revenue among One Piece films.\n\nThis film also stars Japanese pop singer Ado, who sings various original and co-written songs, such as Mrs. Green Apple's 私は最強, which topped charts across Japan.",
    "tf_idf_text": "since premiere anime adaptation manga series one piece eiichiro oda toei animation produce feature film base franchise traditionally release japanese school spring break since four film originally show double feature alongside toei film production thus run time feature length minute first three film show toei anime fair toei anime fea eleventh release part jump hero film film generally use original storyline adapt story arc manga directly release film ten twelve thirteen fourteen tiein story arcs series air concurrently additionally three film special featurette short showcasing character engage various activity unrelated series also television special broadcast fuji two short film show jump super anime tour jump super anime tour respectively franchises anime television series eighth tenth twelfth thirteenth fourteenth fifteenth film license funimation crunchyroll release subtitle dubbed format additionally first seventh ninth film release united kingdom english subtitle one piece also know one piece movie market first animate feature film franchise star mayumi tanaka monkey luffy kazuya nakai roronoa zorro akemi okamura nami kappei yamaguchi usopp premier japan march release dvd january film show double bill digimon adventure war game first week film attain second place japanese box office third place second week first place fourth fifth week legend great gold pirate woonan remain intact year disappearance many pirate search mountain gold hidden remote island among captain drago men hunt every member woonans former crew eventually take possession map hidden island way meet decide rob straw hat pirate still lack cook close starvation short fight ensues luffy zorro tobie boy run away home become part woonans crew separated straw hat ship stay afloat shatter remains point boat follow scent food quickly arrive float oden bar run tobies grandfather gansu drago crew land woonans island encounter usopp evade kill convinces professional treasure hunter offer help use map start lead around meanwhile somewhere else island zorro luffy chain together try eatandrun get lose attempt get back shore help nami usopp get away enemy crew straw hat meet take close look treasure map conclude woonans treasure must hide island mountain set climb way meet gonzo reveals woman grow like brother village atop mountain find empty house secret entry basement drago men arrive beaten luffy zorro group climb basement woonans skeleton sit empty room message old friend gonzo write wall gold dragos ship straw hat set sail resume course grand line clockwork island adventure second animated feature film franchise first use digital ink paint first additionally star hiroaki hirata sanji premier japan march release dvd october film show double bill digimon adventure diaboromon strike back film show along sixminute featurette short name jangos dance carnival straw hat enjoy warm day beach ship equipment weapon steal nothing watch disappear distance week later dress cloth rental store wedding ceremony rid oneperson paddle boat set lose belonging sea encounter boy akizu young man borodo two call thief brother claim wellknown treasure call diamond clock clockwork island actually one stole straw hat ship brought clockwork island make straw hat fight trump sibling trump sibling boo jack honey queen skunk one pin joker bear king leader another pirate crew occupy clockwork island year force inhabitant build weapon number ship bear mark trump sibling appear short fight ensues thief brother ship destroy nami abducted use mere piece wood stay afloat improvised sail propulsion group manage reach foot clockwork island long circular staircase lace deadly traps lead actual island nami make acquaintance trump sibling captain bear king take like decides make bride eventually thief brother remain straw hat make end stairway onto main island beautiful landscape appear front island citizen mood cherish not know akizu son pair tell group islands past hero storm trump sibling stronghold build around island key hold island together one another straw hat get pick captured luffy remain reaches stronghold top free crew movie climax allout battle trump sibling defeat island key destroyed clockwork island crash ocean akizu reunites family straw hat reclaim ship chopper kingdom island strange animal third animated feature film franchise first additionally star ikue ohtani tony tony chopper premier japan march release dvd october film show double bill digimon tamer runaway locomon first week film make sixweek run top japanese box office place third first two week fifth fourth third fourth week respectively sixth fifth sixth week film show along sixminute featurette short name dream soccer king chopper new member straw hat arrive island strange animal land geyserlike fountain sends ship fly chopper fall land middle gathering animal perform ritual accord legend suppose cause king fall heaven believe legend fulfil proclaim chopper new king straw hat search lose crewmate make acquaintance selfproclaimed genius expert treasure hunter count butler henchman general hot dog president snake butler search horn particular animal live island eaten bestow great power upon eater purpose use hoard bovinae like animal call horn eater control play music special violin round horn bearing animal straw hat unknowingly lead butler chopper group animal whose king become butler give gather animal ultimatum hand king whose horn believe look crush horn eater chopper not need turned step forward lure horn eater away island animal fight ensues not take long remain straw hat join take fill zoro take hot dog sanji fight snake usopp nami take care horn eater butler fight chopper finish momambi young boy human inhabitant island show former king horn lure butler away chopper plan backfire butler get hold horn quickly stuff transforms large horn gorillalike animal appear win island animal luffy enter fight luffy defeat butler break horn thus cancel transformation sends fly mobambi fear exile island lose former king horn instead elect animal king dead end adventure fourth animated feature film franchise first additionally star yuriko yamaguchi nico robin premier japan march release dvd july film make sevenweek run top japanese box office place second first week show fifth two week sixth another two week seventh sixth week tenth seventh week show port town pub flat break straw hat witness suspicious exchange customer proprietor nami immediately sense money plan convince host give whatever information give straw hat join soon persuade show backdoor behind find long wind tunnel tunnel lead large underground chamber number pirate crew gather island turn start point irregularly occur anythinggoes sail competition moment straw hat decide whether wise join race consider two giant crew fishmen rival arlong gang participate well learn magnitude prize money not enter question bookmaker receive eternal pose lead goal race free food available bottom chamber luffy make extensive use eat habit steal people food quickly anger bounty hunter shuraiya bascd well group men general gaspardes crew gasparde desert marine bounty three time high luffys say race favorite fight arises luffy shuraiya beat men find stand general impressed skill offer work course refuse luffy find insulting word catch guard gaspardes righthand man needle luffys courage impress gasparde even renews offer order needle let rookie pirate leaf room next morning strong ocean current start race push ship upstream island soon top various crew start shoot broadside board others ship ram competitor water island leave behind field quickly clear leave straw hat time eat inspect ship zoro discovers boy name anaguma stow away order earn money kill pirate buy medicine adoptive grandfather work engineer gaspardes partially steampowered ship race continue fight yet another rival crew encounter group large sea king arrive island eternal pose point eternal pose mislabeled lead fleet unsuspecting pirate reach cannon navy stronghold navarone luffy doubt whose fault turn around use chopper fine nose attempt catch gaspardes ship shuraiya follow gaspardes invitation come along ship turn take revenge gaspardes kill parent sister fight needle throw overboard stand chance gaspardes syrupsyrup logiatype power allow turn part body liquid solid candy general kill bounty hunter straw hat arrive catch attention luffy confronts two engage fierce onesided battle attack luffy throw opponent cause limbs get stuck gaspardes body sanji give two sack flour luffy overcome villain ability anaguma turn girl shuraiyas thoughtdead sister adele bascd competitor take straw hat finish race fleet navy ship appear force abandon prize money curse holy sword fifth animate feature film franchise premier japan march release dvd july film make fiveweek run top japanese box office first week show make third place fourth place second week follow three week fifth place film show along fiveminute featurette short name take aim pirate baseball king zoro go miss straw hat restock search sanji nami chopper robin follow maya girl island village zoro appear accompany group marine zoro wields sword sanji take three jewel orb maya luffy stumble upon train center local marine division encounter saga leader center owner seven star sword make zoro take orb revive sword slumber power luffy fight fall cliff seven star sword ruin country asuka curse power long time ago therefore seal night red full moon occur every hundred year jewel orbs possession zoro side remain straw hat stand way saga revive sword true power baron omatsuri secret island sixth animated feature film franchise premier japan march release dvd july film sixweek run top japanese box office make third place first week fourth place second week follow two week sixth place fifth place fifth week seventh place sixth week straw hat receive invitation island resort grand line run baron omatsuri crew travel island intent relax fun baron welcome resort encourages enjoy complete trial hell crew hesitant luffy accepts challenge straw hat win first trial outrage baron demand compete another challenge luffy chopper robin wait resort rest crew participate second trial robin question muchigoro one baron crewmates flower island muchigoro mention something lily carnation islands summit run luffy chopper wander meeting pirate previously arrive participated trial luffy receive ominous warn baron splitting crew chopper learn baron past right figure mystery stricken arrow shot baron straw hat win rift begin grow crew member crew notice chopper miss baron interrupt dinner party baron notice robin leave reveals look lily carnation baron reveal flower secret robin robin look shocked straw hat realize chopper usopp robin go argument whos blame disappearance ensue baron announces final trial tension crew result crew splitting island know omatsuri island really pirate island advertise resort baron lure pirate island bring suffering hatred felt unto everyone else baron feed crew lily carnation flower reincarnation give life baron crew luffy manages save lily carnation defeat baron help pirate island baron cry friends lose alone fooling year false construct crew create lily carnation dead crewmates speak tell happy remember not corrupt charade apologize leave alone long believe would best forgets night die find new friend luffy lay exhaust ground crew appear unharmed memory incident straw hat gather around luffy wonder sleep place luffy laugh animation film different regular series use style often see mamoru hosodas film later episode use style similar see film story also differ usually carefree high strung style write one piece follow film follow darker style write receive mixed review giant mecha soldier karakuri castle seventh animate feature film franchise premier japan march release dvd july film sixweek run top japanese box office make fourth place first week sixth place second week seventh place third week fourth week show film place sixth follow fifth place week five tenth place sixth week show straw hat visit island know mecha island fisherman sings old folk song golden crown search mysterious treasure find hidden entrance island islands leader ratchet impress find search golden crown invite crew join search crew along ratchet henchman enter cave turns island true form giant turtle ratchet know along us mechanical castle take control turtle wish use take world straw hat stop not ratchet also helpless turtle crash nearby island desert princess pirate adventure alabasta eighth animated feature film franchise one piece film additionally star misa watanabe nefeltari vivi premier japan march release dvd july film license funimation give limited theatrical release united state february funimation also release film dvd february bluray january film place four time top japanese weekend box office place second first week fourth second week ninth third fourth week show film abridge retell alabasta storyline manga straw hat travel alabasta desert island home nefertari vivi find country middle revolution sir crocodile country hero secretly use criminal organization baroque work undermine citizen trust cobra vivis father head kingdom sand order seize throne country hidden secret crew cross desert stop revolution save thousand live baroque work hide bomber defeat crocodile one mighty seven warlord sea cut film first air april japan add minute prologue start film new section adapts whisky peak arc abridge form explain crew meet vivi episode chopper plus bloom winter miracle sakura ninth animated feature film franchise first additionally star kazuki yao franky premiered japan march release dvd july film fiveweek run top japanese box office place third first week show seventh second eighth third week tenth fourth week ninth fifth week second film focus chopper retell drum island storyline manga feature franky nico robin thousand sunny werent present original version replace nefertari vivi karoo go merry canonical story plot also include new character musshuru wapol old brother cut film add new scene frame film increase run time minute film show dream chopper set year time skip picture chopper cry come promotional material not actual movie use modify shot become popular internet meme one piece film strong world tenth animate feature film franchise first additionally star brook write manga creator eiichiro oda direct munehisa sakai news film first appear show episode chopper plus teaser tenth film reveal film originally mean spring release complication script push release date back eventually film premier december july funimation announce acquire license one piece film strong world since release film november state film original story write eiichiro oda honor one piece tenth anniversary previous film oda supplied character design approve story idea one piece film strong world toei personally ask would write script film set thriller bark arc sabaody archipelago arc brook show alongside straw hat pirate make first film appearance sengoku garp still position marine straw hat chase eleventh animate feature film franchise first also use computer animation direct hiroyuki sat release japan march release dvd bluray july double bill toriko film toriko kaimaku gourmet adventure film feature tomomitsu yamaguchi schneider bazz music write performed tokyo ska paradise orchestra release jump hero movie gross worldwide luffy desperately try find miss straw hat extensive search usopp discovers eagle luffy entire crew proceed chase eagle search luffys hat chopper discovers old man lie half dead ship luffy continue chase eagle eventually crash marine base old man name schneider wake chopper notice mumbling name bazz sleep ask schneider tell chopper bazz friend dog ate torus tori model eagle tell chopper tell bazz steal monkey luffys hat could come back think telling bazz would force abandon schneider didnt want bazz see die chopper informs not bazz successfully steal luffys hat straw hat pirate ship schneider immediately jumps bed run save bazz moment trap cage luffy make kairouseki luffys crew free bazz schneider apologizes bazz tell give hat luffy meanwhile fight way whole marine base along three giant finally make marine captain hold hat throw sea luffy immediately jump almost starts fall bazz come rescue luffy finally retrieve hat afterwards schneider bazz decide back sea schneider tell luffy hat suit one piece film release december strong world overseen eiichiro oda well first one piece film take place new world twoyear timeskip zephyr refer exadmiral marine leader neo navy steal marine stash dyna stone powerful explosive expose oxygen explode enough force destroy islands use stone plan destroy end point volcanoes new world connect huge lava source flood new world lava run straw hat one subordinate revert nami chopper robin brook young age luffy crew unexpected ally find stop finishing plan fight not neo navy marine well film also portray cast wear armani exchange suit one part film possibly promotional campaign do collaboration creator series eiichiro oda select outfit design armani exchange shibuya branch armani exchange sell suit film one piece film release july film follow july special title one piece heart gold first issue shueishas weekly shonen jump magazine also reveal eiichiro oda would part anime film executive producer report also state anime director hiroaki miyamoto helm one piece episodes assistant director one piece baron omatsuri secret island part one piece film gold director anime film pen tsutomu kuroiwa scriptwriter liveaction black butler film liveaction liar game final stage film liveaction perfect insider series one piece film release august direct takashi otsuka first announce follow broadcast episode skypiea film commemorates animes anniversary one piece film release august first announce november issue weekly shnen jump commemoration anime episode release one piece film red also high gross one piece film date despite release box office japan box office gross revenue approximately time high next high japan one piece film time higher one piece stampede previously hold record high global box office revenue among one piece film film also star japanese pop singer ado sings various original cowritten song mrs green apple top chart across japan"
}