{
    "title": "en.wikipedia.org_wiki_Onepiece_(single_volume)",
    "url": "https://en.wikipedia.org/wiki/Onepiece_(single_volume)",
    "transformers_text": "Onepiece (stylized in all caps ) is a book featuring 102 volumes [ 3 ] of Eiichiro Oda 's One Piece unofficially compiled by artist Ilan Manouach . It is most notable for being regarded as one of the thickest single-volume books to ever be published , [ 4 ] with a total page count of 21,540. The book is meant to physically encapsulate the status quo of the online dissemination of comic books .\n\nONEPIECE is a 21,540-page book bound by Elise De Maio. Its dimensions are around 12 x 18.5 x 80 cm, and it weighs roughly 17 kilograms. [ 2 ] According to French publishing company JBE, because of its unconventional size, the book is meant to be treated as a sculpture. [ 5 ] The spine features artwork of the story's protagonist Monkey D. Luffy and his many adventures throughout the series. [ 3 ] The book was published around the time of One Piece ' s 25th anniversary.\n\nAccording to French publishing company JBE, the book was conceived by Ilan Manouach in response to the \"profusion of available online content and the rampant digitization of the comics industry\", which \"challenges the state-of-the-art of comics craftsmanship\". [ 1 ] The piece is meant to shift the understanding of digital comics being perceived as 'Big Data'. The comic is also meant to highlight how physical comics exist both as a piece of literature and as a commodity for collectors. [ 1 ]\n\nManouach accomplished his goal by printing out digital editions of the manga series and then binding them together. [ 6 ]\n\nThe book was sold as a limited edition with a total of 50 copies. All copies were sold out within days of its September 7 release date at approximately €1,900 per copy. [ 2 ]\n\nInternational rights staff member Keita Murano of Shueisha –the Japanese publishing company behind One Piece –stated that JBE had not approached the company about publishing the product and did not have permission to do so. When JBE Publishing was approached about the issue of copyright infringement , a spokesperson stated:\n\nThis piece is about Manouach's work around ecosystems of comics, here as a sculptor who uses online dissemination as source material, not reading copyrighted content. [ 4 ]\n\nIt is unknown whether or not Shueisha wishes to pursue civil litigation against JBE Publishing.",
    "tf_idf_text": "onepiece stylize cap book feature volume eiichiro oda one piece unofficially compile artist ilan manouach notable regard one thickest singlevolume book ever publish total page count book mean physically encapsulate status quo online dissemination comic book onepiece page book bound elise maio dimension around weighs roughly kilogram accord french publishing company jbe unconventional size book meant treat sculpture spine feature artwork storys protagonist monkey luffy many adventure throughout series book publish around time one piece anniversary accord french publishing company jbe book conceive ilan manouach response profusion available online content rampant digitization comic industry challenge stateoftheart comic craftsmanship piece mean shift understanding digital comic perceive big data comic also mean highlight physical comic exist piece literature commodity collector manouach accomplished goal printing digital edition manga series bind together book sell limited edition total copy copy sell within day september release date approximately per copy international right staff member keita murano shueisha japanese publishing company behind one piece state jbe not approach company publish product not permission jbe publishing approach issue copyright infringement spokesperson state piece manouachs work around ecosystems comic sculptor use online dissemination source material not read copyright content unknown whether not shueisha wish pursue civil litigation jbe publishing"
}