{
    "title": "en.wikipedia.org_wiki_Sanji_(One_Piece)",
    "url": "https://en.wikipedia.org/wiki/Sanji_(One_Piece)",
    "transformers_text": "Sanji ( サンジ , Sanji ) , born as Vinsmoke Sanji ( ヴィンスモーク・サンジ , Vinsumōku Sanji ) and also known as \"Black Leg\" Sanji ( 黒足のサンジ , Kuro Ashi no Sanji ) , is a fictional character in the One Piece franchise created by Eiichiro Oda . The character made his first appearance in the 43rd chapter of the series, which was first published in Japan in Shueisha 's Weekly Shōnen Jump magazine on June 8, 1998. He is the fifth member of the Straw Hat Pirates and the fourth to join, serving as their cook.\n\nA native to the North Blue, Sanji grew up as part of the Vinsmoke family under his father Vinsmoke Judge, king of the fallen Germa Kingdom, and mother Vinsmoke Sora. [ 6 ] After leaving his abusive family and surviving a shipwreck, almost starving to death on a rock, he was taken under the wing of \"Red Foot\" Zeff, [ 7 ] a former pirate and owner of the floating restaurant Baratie who taught him cooking and his fighting style, which is characterized by the use of legs in combat, leaving his hands for cooking. Following a battle against Don Krieg, Sanji joins the Straw Hats in order to fulfill his dream of finding the All Blue, a mythical sea said to have fish from around the world. Despite his calm and rational nature, he is known for his constantly enamored behavior around beautiful women (especially Nami ), to the point he refuses to attack women to the crew's and his own detriment.\n\nEarly designs show that, originally, Sanji was going to be a gun-wielding black-haired character named Naruto but that idea was scrapped. [ 8 ]\n\nOda was inspired by Mr. Pink, Steve Buscemi 's character in Reservoir Dogs (1992), when creating Sanji. [ 9 ]\n\nSanji is a tall, light-skinned, slender man who has a small waist. He commonly wears a black shirt and smokes a cigarette. Before the timeskip, Sanji is seen with his blonde hair covering his left eye. However, after the timeskip, his hair covers his right eye. Before leaving his family, Sanji styled his hair in the opposite direction and wore a yellow shirt with a black number three on it. He also wore white pants, brown boots, and a yellow bandana. After leaving his family and still a child, he started wearing a white cook's uniform. Sanji grows a goatee during the timeskip, and concept art shows this was his original design. [ 10 ]\n\nSanji's most distinctive feature is his eyebrows, which are characterized as swirls with the tail end pointing at his left side, opposite in direction in comparison to his siblings Ichiji, Niji, Yonji, and Reiju.\n\nOda revealed Sanji's real-world nationality would be a Frenchman , in contrast to the Nazi Germany themes of Germa 66. [ 11 ]\n\nSanji is mostly seen as a composed, nonchalant, and calm individual who always keeps his cool when in dire situations. However, this is contrasted by the many comedic gags he partakes in, such as when in the presence of a lady or when insulted by a crew member. Most notably, Sanji and Zoro have a great rivalry, often resorting to fighting (both verbally and physically).\n\nSanji is also known to have an enamored personality, constantly flirting with any attractive woman he sees, earning him the nickname \" ero -cook\". Even as a child, while working in Baratie, Sanji would become love-struck with attractive female customers and end up making mistakes in the process of cooking. He also shows jealousy towards those that he perceives to be luckier than him with women, such as when he sees Zoro with Hiyori and Luffy arriving at Amazon Lily out of pure luck. [ 12 ] Despite this nature, Sanji exhibits some self-restraint due to his loyalty to his crew, as is shown by the fact that in spite of being attracted to Pudding, he sternly refused to marry her and decided to let her down gently. [ 13 ] Moreover, due to this attitude and the multiple lectures from Zeff, Sanji follows his own strict set of personal morals in the form of chivalry. He has sworn to never attack women or let them be insulted, even at the cost of his own life and has gone so far as to only block against Kalifa, one of the main antagonists of the Enies Lobby Arc, until Nami could help him. [ 14 ] Sanji overcame his childhood trauma and accepted his nature after Luffy saves him from an arranged marriage during the Whole Cake Island Arc. [ 15 ]\n\nSanji is kind and often saves others in danger, even at the cost of his own safety. Oftentimes he frames this kindhearted nature as mere chivalry towards women, but in his actions he consistently helps men as well. Having suffered from starvation among the litany of abuse put upon him by his father, he never denies a person a meal regardless of their intentions, as shown when Don Krieg attempted to take over the Baratie during his introductory arc. Frequently during the series he separates himself from everyone else to play a clandestine role which subsequently helps the crew and other allies survive. In Water 7, Sanji separates from the crew and finds Nico Robin boarding the Puffing Tom on its way to Enies Lobby for her execution. [ 16 ] In Thriller Bark, he offers to give up his life in exchange for Luffy's. [ 17 ] In Zou, Sanji decided to leave the crew in order to confront his family and protect the Straw Hats from the Fire Tank Pirates. [ 18 ] In Wano, Sanji asks for help from another for the first time when he asks Robin to save him. [ 15 ]\n\nIn the original Japanese version of the One Piece anime series, Sanji is voiced by Hiroaki Hirata as an adult and Ikue Ōtani as a child. [ 19 ]\n\nIn Odex 's dubs of the first 104 episodes of One Piece in Singapore, Sanji was voiced by Joseph Murray and Paul Pistore. [ 19 ] In the 4kids Entertainment 's dub of the first 104 episodes of One Piece , Sanji was voiced by David Moo as an adult and by Veronica Taylor as a child. [ 19 ] In Funimation Entertainment 's dubs of the entire One Piece franchise, adult Sanji is voiced by Eric Vale with Christen Auten playing the role of child Sanji. In the Korean dub, he was formerly voiced by Park Hyun-wook from 2002 to 2011. In 2012, Sanji was now voiced by Lee Jung-hoon, Nami Sanji-kun's husband in the Korean dub. [ 19 ]\n\nSanji is portrayed by British - Spanish actor Taz Skylar in the live action adaptation of One Piece , [ 20 ] while Christian Convery portrays young Sanji. [ 21 ]\n\nWhen fighting, Sanji only ever relies on kicks, never punching opponents because of his belief that a cook's hands are important instruments for their craft, and thus must be protected from harm. Over the course of the series, Sanji utilizes attacks that are variations of kicks (deemed “Black Leg Style”), with the name of the attack usually having something to do with food, such as “Diable Jambe”, wherein he raises the temperatures of his legs so high that they glow bright red. [ 22 ] During his time on Momoiro Island, Sanji learns a move named “Sky Walk”, which allows him to jump to great heights and to be able to float mid air by making sonic booms in the air behind him. [ 23 ] Sanji is one of the few high-bounty individuals that has not consumed a Devil Fruit, fruits that give the consumer superhuman powers at the expense of becoming a dead weight in water. After Whole Cake Island, Sanji receives a Raid Suit gifted from Germa 66, the underground organization powering Germa Kingdom, which increases his physical capabilities and allows him to blend in with his environment. [ 24 ] Though continued use of this suit awakened his inert genetic modifications, he ultimately accepted these modifications, giving him increased strength and speed, but chose to destroy the Raid Suit to cut his ties to his family permanently. [ 25 ] He would later use his new abilities with Armament Haki to create \"Ifrit Jambe\", a more powerful version of Diable Jambe that uses blue-white flames. [ 26 ]\n\nOther than fighting skills, Sanji is also a well-renowned cook. He learned to cook under Zeff on the Baratie and has become quick and dexterous in his ability to use knives. He also has a strong sense of taste and smell, which is seen by being able to deduce the ingredients and being able to recreate the wedding cake on Whole Cake Island. [ 27 ]\n\nDuring the timeskip, he develops Observation Haki, which allows him to sense the intent and presence of others, such as when he was able to dodge a jelly bean bullet from Katakuri. [ 28 ] He is also able to utilize Armament Haki, which allows him to harden parts of his body and be able to attack Logia users. [ 29 ]\n\nVinsmoke Sanji ( ヴィンスモーク・サンジ , Vinsumōku Sanji ) was born as a prince of Germa Kingdom , a floating kingdom composed of several ships on the shells of large snails . Vinsmoke Judge sought to regain the family's long lost glory by creating the strongest army, using his expertise as a scientist to create hundreds of clones of his best soldiers. Blinded by the pursuit of power, he even experimented on his five children. Sora, who didn't like that they would practically become inhuman, tried to undo said experiments by taking a powerful drug. However, amongst them, only Sanji was affected by this, being the only one without any powers and with the ability to feel emotions; as such, Judge heavily resented Sanji, deeming him a \"failure\" and imprisoning him; Sanji was also perpetually tortured and bullied by his brothers. With help from his sister Reiju, he escapes and flees Germa 66. On his way out, Sanji encounters his father, who demands him to keep his heritage a secret in shame. Sanji eventually flees on a cruise ship known as the Orbit.\n\nWhile serving as an apprentice cook on a passenger ship, nine-year-old Sanji stands up to a boarding party of pirates led by the infamous \"Red Foot\" Zeff . During the encounter, Sanji is swept into the sea by a massive wave. Zeff jumps in after him because of their common dream of finding the All Blue ( オールブルー , Ōru Burū ) , a legendary area where the East, West, North, and South Blue seas meet, containing every kind of fish in the world. While castaways together, the pirate saves Sanji's life yet again by giving him all of their food. After their eventual rescue, Sanji stays with Zeff for several years and helps him build a floating restaurant, the Baratie ( バラティエ ) . Zeff in turn makes him a first-rate cook and teaches him his kick-based fighting style. [ ch. 56 – 59 ] Mirroring Zeff, Sanji will never refuse a starving person a meal, and he uses only his legs when fighting to protect the hands he needs for cooking. [ ch. 48 , 370 ] He has a weakness for women and makes it a principle never to harm one, even if it means his death. [ ch. 403 ] Eventually, Sanji leaves the Baratie to pursue his own dream and join the Straw Hats, after a chance encounter lead to their defeat of Don Krieg. [ ch. 62 ]\n\nEventually, Sanji becomes infamous as \"Black Leg\" Sanji ( 黒脚のサンジ , Kuro Ashi no Sanji ) from his misadventures with the Straw Hats; a poorly drawn bounty poster resembling an individual named Duval, leading to conflict between the two; Sanji displays kindness by rearranging his facial expression. [ ch. 435 , 492 ] In Thriller Bark, he offers to give up his life in exchange for Luffy's. [ 17 ] While training for a period of two years in Emporio Ivankov 's Kamabakka Queendom ( カマバッカ王国 , Kamabakka Ōkoku ) , he develops the Sky Walk ( 空中歩行 , Sukai Wōku ) , a variant of the Six Powers ( 六式 , Rokushiki ) technique Moonwalk ( 月歩 , Geppo ) , which allows him to essentially run through air. [ ch. 635 ] In Zou, Sanji is forced into an arranged marriage with the daughter of Big Mom, one of the Four Emperors . Sanji decides to leave the crew in order to confront his family and protect the Straw Hats from the Big Mom Pirates . [ 18 ] The Straw Hats invades the Big Mom Pirates' Empire to save Sanji. To his family's surprise, Sanji cared enough to save them from a trap laid out by Big Mom, who seeks their powerful technology, despite their previous abuse. After their escape, Sanji is pleased that his bounty exceed's Zoro's, but angered at the inclusion of his surname in the poster. [ 3 ] Sanji is also displeased to receive his own technologically enhanced Raid Suit from his family which grants him the ability to turn invisible. [ ch. 903 ]\n\nIn Wano, Sanji asks for help from another for the first time when he asks Robin to save him from a woman enemy he is unwilling to fight. This is the first time Sanji asks for help in the present-day series from someone else. [ 15 ] The Raid Suit began to awaken dormant genetic enhancements that his mother suppressed years ago. He had gained an exoskeleton, a superhuman physical constitution, accelerated healing, increase in strength and speed which enhanced his fighting style immensely and his skin has become bulletproof. As a side effect, his emotions are also repressed by the suit, as he uncharacteristically hurt a woman in the suit. Fearing he is losing his humanity and starting to resemble his siblings, he destroys the Raid Suit canister, freeing himself from Germa's influence for good and stopping him from losing more of himself. [ ch. 1023 ] [ ch. 1028 ] [ ch. 1031 ]\n\nThe creators of Food Wars , Yūto Tsukuda and Shun Saeki, created a set of spinoff one-shots titled Shokugeki no Sanji , with the first installment being published in 2018 to celebrate One Piece's 21st anniversary. [ 30 ] There are currently four installments and the spinoffs are short stories detailing different cooking competitions that Sanji partakes in, as well as going into detail about his training in Okama Island.\n\nA cookbook titled One Piece: Pirate Recipes was published by Shueisha in November 2012. [ 31 ] The book is attributed to Sanji himself and includes various One Piece -themed cooking recipes. A localization by Viz Media was announced in February 2021, and released on November 23, 2021. [ 32 ]\n\nSanji has also been featured in varying forms of merchandise. For instance, many figurines have been produced, with one example being the Sanji figure in the One Piece Locations Trading Figures series. In 2012, the French Luxury brand S.T Dupont collaborated on their 140th anniversary with Eiichiro Oda to recreate Sanji's iconic \"Sleeping Mermaid\" gold lighter . [ 33 ]\n\nStatues have also been erected in Sanji's honor. A bronze statue of Sanji was dedicated in Mashiki, Kumamoto as part of the Kumamoto Revival Project to help with healing after the 2016 earthquakes in the area. [ 34 ] In the Nagoya location of the One Piece Mugiwara Store, a statue of Sanji stands next to artwork from the show. In \"Sanji's Oresama Restaurant,\" one of the Tokyo One Piece Tower 's restaurants, a statue of Sanji can be seen as part of a feast with the rest of the crew.\n\nIn the Shōnen Jump One Piece popularity polls, Sanji was ranked fourth in the first poll (1999) [ 35 ] and third for the three subsequent polls (2002, 2006, 2009). [ 36 ] [ 37 ] [ 38 ] In the most recent poll (2021), which was the first polled held worldwide, Sanji was ranked the fourth most popular character with 970,286 votes. [ 39 ]\n\nDyler Crews wrote how \"Sanji has all of the tangibles to be one of the undisputed best characters in the entire series. His origin, powers, and style make him an easy favorite among One Piece fans. Still, his strange obsession with women pushes other fans away. The lecherous hero is as foundational to the shonen manga genre as gaudy transformations. Sanji is the most visible in a long line of problematic and confounding characters to express this annoyingly immature personality type\". [ 40 ]\n\nEric Vale's work with Sanji nominated him for the \"Voice Actor of the Year\" award in the Behind the Voice Actor Awards from 2015. [ 41 ] Daniel Dockery, a senior staff writer for Crunchyroll , argued that Sanji has one of the best character introductions in anime. [ 42 ] Ritwik Mitra of GameRant placed Sanji as the best comedy relief character in shōnen anime, citing his attempts at courting women and conflicts with his crew mate Roronoa Zoro as a source of humor. Mitra adds that Sanji is also a significant part in \"some of the most iconic non-comedy moments\", which he believes to be reason for his popularity. [ 43 ]",
    "tf_idf_text": "sanji sanji bear vinsmoke sanji vinsumku sanji also know black leg sanji kuro ashi sanji fictional character one piece franchise create eiichiro oda character make first appearance chapter series first publish japan shueisha weekly shnen jump magazine june fifth member straw hat pirate fourth join serve cook native north blue sanji grow part vinsmoke family father vinsmoke judge king fall germa kingdom mother vinsmoke sora leave abusive family survive shipwreck almost starve death rock take wing red foot zeff former pirate owner float restaurant baratie teach cook fight style characterize use legs combat leave hand cook follow battle krieg sanji join straw hat order fulfill dream find blue mythical sea say fish around world despite calm rational nature know constantly enamor behavior around beautiful woman especially nami point refuse attack woman crew detriment early design show originally sanji go gunwielding blackhaired character name naruto idea scrap oda inspire pink steve buscemi character reservoir dog create sanji sanji tall lightskinned slender man small waist commonly wear black shirt smoke cigarette timeskip sanji see blonde hair cover leave eye however timeskip hair cover right eye leave family sanji style hair opposite direction wear yellow shirt black number three also wear white pant brown boot yellow bandana leave family still child start wear white cook uniform sanji grows goatee timeskip concept art show original design sanjis distinctive feature eyebrows characterize swirl tail end pointing leave side opposite direction comparison sibling ichiji niji yonji reiju oda reveal sanjis realworld nationality would frenchman contrast nazi germany theme germa sanji mostly see compose nonchalant calm individual always keep cool dire situation however contrast many comedic gag partakes presence lady insult crew member notably sanji zoro great rivalry often resort fight verbally physically sanji also know enamored personality constantly flirt attractive woman see earn nickname ero cook even child work baratie sanji would become lovestruck attractive female customer end make mistake process cooking also show jealousy towards perceives lucky woman see zoro hiyori luffy arrive amazon lily pure luck despite nature sanji exhibit selfrestraint due loyalty crew show fact spite attract pudding sternly refuse marry decide let gently moreover due attitude multiple lecture zeff sanji follow strict set personal moral form chivalry swear never attack woman let insult even cost life go far block kalifa one main antagonist enies lobby arc nami could help sanji overcame childhood trauma accept nature luffy save arrange marriage whole cake island arc sanji kind often save others danger even cost safety oftentimes frames kindhearted nature mere chivalry towards woman action consistently help men well suffered starvation among litany abuse put upon father never deny person meal regardless intention show krieg attempted take baratie introductory arc frequently series separate everyone else play clandestine role subsequently help crew ally survive water sanji separate crew find nico robin board puff tom way enies lobby execution thriller bark offer give life exchange luffys zou sanji decide leave crew order confront family protect straw hat fire tank pirate wano sanji asks help another first time ask robin save original japanese version one piece anime series sanji voice hiroaki hirata adult ikue tani child odex dub first episodes one piece singapore sanji voice joseph murray paul pistore kid entertainment dub first episodes one piece sanji voice david moo adult veronica taylor child funimation entertainment dub entire one piece franchise adult sanji voice eric vale christen auten play role child sanji korean dub formerly voice park hyunwook sanji voice lee junghoon nami sanjikuns husband korean dub sanji portray british spanish actor taz skylar live action adaptation one piece christian convery portrays young sanji fight sanji ever rely kick never punch opponent belief cook hand important instrument craft thus must protect harm course series sanji utilizes attack variation kick deem black leg style name attack usually something food diable jambe wherein raise temperature legs high glow bright red time momoiro island sanji learn move name sky walk allow jump great height able float mid air make sonic boom air behind sanji one highbounty individual not consume devil fruit fruit give consumer superhuman power expense become dead weight water whole cake island sanji receives raid suit gift germa underground organization power germa kingdom increase physical capability allow blend environment though continue use suit awaken inert genetic modification ultimately accept modification give increased strength speed choose destroy raid suit cut tie family permanently would later use new ability armament haki create ifrit jambe powerful version diable jambe use bluewhite flame fight skill sanji also wellrenowned cook learn cook zeff baratie become quick dexterous ability use knife also strong sense taste smell see able deduce ingredient able recreate wed cake whole cake island timeskip develop observation haki allow sense intent presence others able dodge jelly bean bullet katakuri also able utilize armament haki allow harden part body able attack logion user vinsmoke sanji vinsumku sanji bear prince germa kingdom float kingdom compose several ship shell large snail vinsmoke judge seek regain family long lose glory create strong army use expertise scientist create hundred clone best soldier blind pursuit power even experiment five child sora didnt like would practically become inhuman tried undo say experiment take powerful drug however amongst sanji affect one without power ability feel emotion judge heavily resent sanji deem failure imprison sanji also perpetually torture bully brother help sister reiju escape flees germa way sanji encounter father demand keep heritage secret shame sanji eventually flees cruise ship know orbit serve apprentice cook passenger ship nineyearold sanji stand board party pirate lead infamous red foot zeff encounter sanji sweep sea massive wave zeff jump common dream find blue bur legendary area east west north south blue sea meet contain every kind fish world castaways together pirate save sanjis life yet give food eventual rescue sanji stay zeff several year help build float restaurant baratie zeff turn make firstrate cook teach kickbased fight style mirror zeff sanji never refuse starve person meal use legs fight protect hand need cook weakness woman make principle never harm one even mean death eventually sanji leaf baratie pursue dream join straw hat chance encounter lead defeat krieg eventually sanji becomes infamous black leg sanji kuro ashi sanji misadventure straw hat poorly draw bounty poster resemble individual name duval lead conflict two sanji display kindness rearrange facial expression thriller bark offer give life exchange luffys train period two year emporio ivankov kamabakka queendom kamabakka koku develop sky walk sukai wku variant six power rokushiki technique moonwalk geppo allow essentially run air zou sanji force arranged marriage daughter big mom one four emperor sanji decides leave crew order confront family protect straw hat big mom pirate straw hat invade big mom pirate empire save sanji family surprise sanji care enough save trap lay big mom seek powerful technology despite previous abuse escape sanji please bounty exceeds zoros angered inclusion surname poster sanji also displease receive technologically enhance raid suit family grant ability turn invisible wano sanji ask help another first time ask robin save woman enemy unwilling fight first time sanji ask help presentday series someone else raid suit begin awaken dormant genetic enhancement mother suppress year ago gain exoskeleton superhuman physical constitution accelerate heal increase strength speed enhance fight style immensely skin become bulletproof side effect emotion also repress suit uncharacteristically hurt woman suit fear lose humanity start resemble sibling destroy raid suit canister free germas influence good stopping lose creator food war yto tsukuda shun saeki create set spinoff oneshots title shokugeki sanji first installment publish celebrate one piece anniversary currently four installment spinoffs short story detail different cooking competition sanji partakes well go detail training okama island cookbook title one piece pirate recipe publish shueisha november book attribute sanji include various one piece theme cook recipe localization viz medium announce february release november sanji also feature vary form merchandise instance many figurine produce one example sanji figure one piece location trading figure series french luxury brand dupont collaborate anniversary eiichiro oda recreate sanjis iconic sleeping mermaid gold lighter statue also erect sanjis honor bronze statue sanji dedicate mashiki kumamoto part kumamoto revival project help heal earthquake area nagoya location one piece mugiwara store statue sanji stand next artwork show sanjis oresama restaurant one tokyo one piece tower restaurant statue sanji see part feast rest crew shnen jump one piece popularity poll sanji rank fourth first poll third three subsequent poll recent poll first poll hold worldwide sanji rank fourth popular character vote dyler crew write sanji tangibles one undisputed best character entire series origin power style make easy favorite among one piece fan still strange obsession woman push fan away lecherous hero foundational shonen manga genre gaudy transformation sanji visible long line problematic confounding character express annoyingly immature personality type eric vale work sanji nominated voice actor year award behind voice actor award daniel dockery senior staff writer crunchyroll argue sanji one best character introduction anime ritwik mitra gamerant place sanji best comedy relief character shnen anime cite attempt court woman conflict crew mate roronoa zoro source humor mitra add sanji also significant part iconic noncomedy moment believe reason popularity"
}