{
    "title": "en.wikipedia.org_wiki_Slam_Dunk_(manga)",
    "url": "https://en.wikipedia.org/wiki/Slam_Dunk_(manga)",
    "transformers_text": "Slam Dunk (stylized in all caps ) is a Japanese sports manga series written and illustrated by Takehiko Inoue . It was serialized in Shueisha 's shōnen manga magazine Weekly Shōnen Jump from October 1990 to June 1996, with the chapters collected into 31 tankōbon volumes. The story follows Hanamichi Sakuragi , a brash and impulsive high school student who joins a basketball team at Shohoku High School, located in the Shōnan area of Japan.\n\nThe manga was adapted into an anime television series by Toei Animation which aired from October 1993 to March 1996. The series has been broadcast worldwide, gaining popularity especially in Japan, Europe, and several other Asian countries. In December 2022, an anime feature film titled The First Slam Dunk was released in Japan.\n\nSlam Dunk has 185 million copies in circulation, making it one of the best-selling manga series in history. In 1994, it received the 40th Shogakukan Manga Award for the shōnen category. In Japan, Slam Dunk has been regarded as one of the greatest sports manga series of all time and has been cited as a contributor in popularizing basketball among Japanese youth during the 1990s. In 2010, Inoue received special commendations from the Japan Basketball Association for helping popularize basketball in Japan .\n\nHanamichi Sakuragi is a high school delinquent and gang leader. He is very unpopular among girls, having been rejected fifty times. In his first year at Shohoku High School, Sakuragi meets Haruko Akagi, the girl of his dreams, and is overjoyed when she is not repulsed or frightened of him like other girls. Haruko recognizes Sakuragi's athleticism and introduces him to the Shohoku basketball team. Sakuragi is reluctant to play basketball due to his inexperience with sports and his belief that basketball is a game for losers. This belief came about because the most recent girl to reject him had favored a basketball player. Despite his immaturity and temper, he joins the team to impress Haruko, and proves to be a natural athlete.\n\nSakuragi later develops a genuine love for the sport despite initially playing because of his crush. Around this time, the star rookie and \"girl magnet\" Kaede Rukawa joins the team. Sakuragi views him as a bitter rival in basketball and romance, as Haruko has an unrequited crush on Rukawa. Shortly after, two additional members rejoin the team: Hisashi Mitsui, a skilled three-point shooter and ex–junior high school MVP ; and Ryota Miyagi, a short but fast point guard . The four players work together to fulfill team captain Takenori Akagi's dream of winning the national championship. After defeating one of the powerhouse teams at the national high school championship, the misfits gain publicity, and the once little-known Shohoku basketball team becomes an all-star contender in Japan.\n\nTakehiko Inoue was inspired to create Slam Dunk from his love of basketball, which he has had since high school. [ 4 ] Before starting Slam Dunk , he created a one-shot manga titled Aka ga Suki ( 赤が好き ) , which was published in Weekly Shōnen Jump Summer Special in 1990. The one-shot featured an early prototype of Hanamichi Sakuragi and Haruko Akagi, with a story and character dynamics that laid the groundwork for Slam Dunk . [ 5 ] After he began working on the series, Inoue was surprised to receive letters from readers who had begun playing the sport due to his manga. His editor told him \"basketball was a taboo in this world.\" Due to these letters, Inoue decided he wanted to draw better basketball games in the series. [ 4 ] With the series, the author wanted to demonstrate the feelings and thoughts that some athletes might have when they win, lose or improve at their sport. When he began work on Vagabond , Inoue noted that his work on Slam Dunk had a simpler perspective on life as he focused more on victories and success. [ 6 ]\n\nWith the series, Inoue wanted readers to feel achievements and love for the sport. [ 7 ] Thinking that his success as a manga artist was largely due to basketball, Inoue organized a Slam Dunk scholarship for Japanese students as he wanted to give back to the sport by increasing its popularity in Japan. [ 8 ] However, when asked about the response from readers to basketball, Inoue commented that although Slam Dunk is technically a basketball manga, its story could have been told with other sports such as football . [ 9 ] He added that the manga's artwork was more \"mangalike\" compared to his newer works such as Real . His experiences with basketball also influenced the story of Slam Dunk . As a youth, Inoue began playing basketball to become popular with girls, but later developed an interest in the sport itself. This experience is mirrored in the character Hanamichi Sakuragi, who began playing basketball to impress a girl, only to later grow truly fond of the game. [ 10 ] Inoue attended the NBA Finals in the United States and the 1992 Summer Olympics in Barcelona as \"research\" for the manga. [ 11 ]\n\nWritten and illustrated by Takehiko Inoue , Slam Dunk was serialized in Shueisha 's shōnen manga magazine Weekly Shōnen Jump from October 1, 1990, to June 17, 1996. [ 12 ] [ 13 ] [ 14 ] The 276 individual chapters were originally collected in 31 tankōbon volumes under Shueisha's Jump Comics imprint, with the first being published on February 8, 1991, and the final volume on October 3, 1996. [ 15 ] [ 16 ] It was later reassembled into 24 kanzenban volumes under the Jump Comics Deluxe imprint from March 19, 2001, to February 2, 2002. [ 17 ] [ 18 ] A 20 volume shinsōban edition was published between June 1 and September 1, 2018. [ 19 ] On November 8, 2022, a book imitating an issue of Weekly Shōnen Jump and collecting 24 select chapters of the original manga was published under the title Slam Dunk Jump . [ 20 ]\n\nIn North America, an English version of Slam Dunk was published by the now-defunct Gutsoon! Entertainment , which serialized the title in their manga anthology Raijin Comics from 2002 to 2004. [ 21 ] Five collected volumes were published under Gutsoon's Raijin Graphic Novels imprint. They were released from July 2, 2003, until May 5, 2004. [ 22 ] [ 23 ] After Gutsoon! went out of business, the license for Slam Dunk was purchased by Viz Media , which published a preview of the series in the December 2007 issue of the North American edition of Shonen Jump . [ 24 ] [ 25 ] [ 26 ] Slam Dunk began serialization in the magazine, starting with the May 2008 issue, as well as in tankōbon format with the first being published on September 2, 2008. [ 27 ] [ 28 ] [ 29 ] The 31st and final volume was released on December 3, 2013. [ 30 ]\n\nIn 2004, Inoue produced an epilogue titled Slam Dunk: 10 Days After , which was drawn on 23 chalkboards on the former campus of the defunct Misaki High School located in Kanagawa Prefecture , and was held for public exhibition for three days between December 3 and 5. The epilogue, along with coverage of the event, was printed in the February 2005 issue of Switch magazine. [ 31 ] A documentary of the event was released on DVD in May 2005. [ 32 ] The epilogue was published in book form by Flower under the title Slam Dunk 10 Days After Complete on April 10, 2009. [ 33 ]\n\nAn anime series, consisting of 101 episodes, was produced by Toei Animation and directed by Nobutaka Nishizawa. [ 34 ] It was first broadcast on TV Asahi from October 16, 1993, to March 23, 1996. It was later aired on the satellite television network, Animax , in addition to four animated movies produced. The anime followed the manga storyline, but left out the National Tournament games. Toei compiled the episodes into a series of seventeen DVDs which were released in Japan from December 10, 2004, to May 21, 2005. [ 35 ] [ 36 ] Toei once again collected the series in three DVD boxes during 2008. All the three boxes have a total of seventeen discs. [ 37 ] [ 38 ] [ 39 ] To celebrate 20 years since its broadcast, the anime was released on Blu-ray format. [ 40 ]\n\nToei and Geneon briefly teamed up to release the anime on DVD in North America after the manga was discontinued, though this was also discontinued after only a few volumes. [ 41 ] [ 42 ] The first DVD was released on March 15, 2005, and volume 4 was the last one released on June 14, 2005, before they were cancelled. [ 43 ] [ 44 ] Various episodes from the series were also downloadable in IGN 's Direct2Drive service. [ 45 ] Toei made available the series for streaming on Crunchyroll in 2008. [ 46 ] Joost also started streaming the series in May 2009. [ 47 ]\n\nThe music was composed by Takanobu Masuda (from episode 1 to 61) and BMF (from episode 62 to 101). Three CD soundtracks were published during the airing of the series in Japan. [ 48 ] [ 49 ] The openings, ending and other two themes were collected into the CD soundtrack The Best of TV Animation Slam Dunk , released on July 21, 2003. [ 50 ]\n\nFour anime films were produced by Toei Animation from 1994 to 1995 while the manga and TV series were still running. They contain largely new material that is either only hinted at or is not presented in the manga. From August 1 to 4, 2006, NHK broadcast all four movies as part of its satellite networks NHK BS-2's Summer Anime Choice line-up, and TV Osaka aired the last three movies from January 3 to 8, 2007. [ 51 ] All the films were collected into a DVD box named Slam Dunk The Movie which was released on December 10, 2004. [ 52 ]\n\nThe first film, simply titled Slam Dunk , premiered on March 12, 1994. [ 53 ] Set after Shohoku's practice game against Ryonan (before the second half of episode 20), the film focuses on a practice game against Takezono High. Before the game, Sakuragi runs into Yoko Shimura, the girl who rejects him in the very first scene of the series, and Oda, the basketball player she rejected him for. Zenkoku Seiha da! Sakuragi Hanamichi , [ a ] released on July 9, 1994, [ 54 ] is the second film from the series. It happens during Shohoku's 4th round qualifying game against Tsukubu High (between the first half of episode 36). The film features original characters including Godai, an old friend of Akagi and Kogure's, Rango, a wild show-off who is in love with Haruko and quarrels with Sakuragi, and Coach Kawasaki, a former pupil of Anzai-sensei. Shohoku Saidai no Kiki! Moero Sakuragi Hanamichi [ b ] was released on March 4, 1995. [ 55 ] Set after Shohoku's loss to Kainan, and during a practice match against Ryokufu High (between episode 61). Hoero Basukettoman Tamashii!! Hanamichi to Rukawa no Atsuki Natsu , [ c ] which was released one June 15, 1995, [ 56 ] tells that Rukawa's middle school kouhai Ichiro Mizusawa will be paralyzed soon and wishes to have one last game against Rukawa (between the first half of episode 62). [ 51 ]\n\nOn January 7, 2021, Slam Dunk ' s author Takehiko Inoue announced on his Twitter account that the series would receive a new anime film by Toei Animation titled The First Slam Dunk . [ 57 ] Inoue is the director and writer of the film, with Yasuyuki Ebara designing the characters. It premiered in Japan on December 3, 2022. [ 58 ] [ 59 ]\n\nNumerous video games based on the series, mostly developed by Banpresto and produced by Bandai , have been published for the Japanese market. Two basketball sims titled Slam Dunk Gakeppuchi no Kesshō League [ d ] and Slam Dunk 2 were released for the Game Boy . [ 60 ] [ 61 ] The Super Famicom had three games, Slam Dunk: Shikyou Gekitotsu , [ e ] Slam Dunk 2: IH Yosen Kanzenban!! , [ f ] and SD Heat Up!! . [ 62 ] [ 63 ] [ 64 ] Slam Dunk games have also been released for the Game Gear , Mega Drive , and Sega Saturn . [ 65 ] [ 66 ] [ 67 ] A Slam Dunk coin-operated arcade game developed by Video System and published by Banpresto was released in 1995, which was called From TV Animation Slam Dunk: Super Slams. During development, the game was called 3 on 3 Dunk Madness and did not have the Slam Dunk license. Characters of the series also appear in the Nintendo DS games Jump Super Stars and Jump Ultimate Stars . [ 68 ] [ 69 ]\n\nUnofficial game modifications have been made by fans for NBA 2K13 (PC version). [ 70 ]\n\nA novel depicting an original story written by Yoshiyuki Suga was published on December 2, 1994. [ 71 ] Illustrations from Slam Dunk are included in the art book Inoue Takehiko Illustrations , which was published on June 4, 1997, [ 72 ] and Plus/Slam Dunk Illustrations 2 , which followed on April 3, 2020. [ 73 ] Slam Dunk Shōri-gaku , a book written by sports psychologist Shuichi Tsuji on the \"Psychology of Winning\" and using Slam Dunk as a reference, was published on October 5, 2000. [ 74 ]\n\nSlam Dunk was awarded the 40th Shogakukan Manga Award in the shōnen category in 1994. [ 75 ] In a poll of close to 79,000 Japanese for the 10th Japan Media Arts Festival in 2006, Slam Dunk was voted the #1 manga of all time. [ 76 ] In a 2009 survey from Oricon , it was ranked first as the manga that fans wanted to be turned into a live-action film. [ 77 ] In November 2014, readers of Media Factory 's Da Vinci magazine voted Slam Dunk as the fourth Weekly Shōnen Jump ' s greatest manga series of all time. [ 78 ] It ranked second, only behind Kingdom , on the first annual Tsutaya Comic Awards ' All-Time Best Section in 2017. [ 79 ] On TV Asahi 's Manga Sōsenkyo 2021 poll, in which 150,000 people voted for their top 100 manga series, Slam Dunk ranked third, behind only One Piece and Demon Slayer: Kimetsu no Yaiba . [ 80 ] [ 81 ]\n\nThe English translation of the manga was listed as one of the best comics of 2008 by Publishers Weekly . [ 82 ] Similarly, the Young Adult Library Services Association named the first volume one of its \"Great Graphic Novels for Teens\" in early 2009. [ 83 ] French newspaper Le Figaro selected the series as one of their six recommended manga featured at the 2019 Paris Book Fair. [ 84 ]\n\nSlam Dunk is one of the best-selling manga series in history. Its collected volumes sold over 100 million copies in Japan by 2004, [ 85 ] over 118 million by 2012, [ 86 ] and over 121 million by 2014. [ 87 ] By 2017, the series had over 170 million copies in circulation worldwide. [ 88 ] By 2024, the series had over 185 million copies in circulation worldwide. [ 89 ] Until it was broken in 2002, volumes 21 through 23 of Slam Dunk held the record for initial printing of a manga at 2.5 million copies. [ 90 ] The print version of Slam Dunk: 10 Days After was popular, having initially ranked sixth and then 15th in Oricon 's weekly ranking of manga. [ 91 ] [ 92 ] The first six volumes of the 2018 shinsōban edition of the original manga all reached the top eight of their release week, with the highest being the first volume at number two. [ 93 ] This resulted in Slam Dunk being the fourth best-selling manga of 2018 with 5.2 million copies sold, [ 94 ] and the ninth top-selling media franchise of 2018, with estimated sales of ¥3.4 billion. [ 95 ]\n\nSlam Dunk was the third best-selling manga series in the first half of 2023 (period between November 2022 and May 2023), with 4.2 million copies sold. [ 96 ]\n\nCarlo Santos of Anime News Network wrote that \"With solid characters, eye-popping action, and a classic underdog story, Slam Dunk is what all manga series (and basketball players) should aspire to be: the complete package.\" [ 97 ] Based on the first volume however, his colleague Carl Kimlinger said it came off as more of a romantic comedy than a sports manga as it focused on establishing the cast. [ 98 ] Santos opined that its the stuff that happens off the court that really makes up the manga's heart and soul as each character has a story to tell and a goal to reach, with the court simply providing a stage for them to \"act out these universal struggles.\" [ 97 ] Similarly, Kris Kosaka of The Japan Times wrote that Slam Dunk is not your typical sports story dominated by on-the-court heroics, but Inoue's love of basketball is evident on every page. [ 99 ]\n\nSports Illustrated ' s Ben Sin wrote that there are many reasons why Slam Dunk is so beloved, including a hilarious rivalry between the main character and his teammate, a handsome star player with a large female fanbase, and \"many other characters and subplots which have since become a crucial part of manga lore.\" [ 100 ] Sin also proclaimed Inoue to have the greatest mix of serious and goofy toned artwork in the history of comics, \"Inoue can draw a stunningly detailed and emotional portrait of a human being in one panel and then do a 180 on that character's facial features the next.\" [ 100 ] Kimlinger called Sakuragi an \"inspired choice\" for a lead character as he is a thug with a hair-trigger temper and all the wrong motivations, but said he does the \"seemingly impossible\" and balances likeability and extreme hubris thanks to humorous scenes. [ 98 ] Santos wrote that while Sakuragi may not have the \"mind-blowing superhuman skills\" we normally associate with shōnen protagonists, watching him grow into a sportsman and decent human being is just as exciting. [ 97 ] Despite having some \"school-punk\" character designs that are generally considered comedic nowadays, Santos called the art solid for its visual flow and sense of motion. [ 97 ]\n\nThe anime adaptation has also been very popular in Japan. In TV Asahi 's 2005 Top 100 Anime survey of multiple age groups, Slam Dunk ranked as the eighth most popular anime. [ 101 ] In another poll from TV Asahi but developed by a website, the series ranked tenth. [ 102 ] The home video release of the anime also had good sales, having appeared on Oricon 's Japanese Animation DVD and Blu-ray rankings. [ 103 ] [ 104 ] [ 105 ]\n\nThe anime films performed well at the box office. The first three films released between 1994 and 1995 grossed ¥2.47 billion , ¥1.9 billion and ¥2.16 billion in Japan, respectively, for a combined ¥6.53 billion ( $69.42 million ) grossed in Japan by 1995. [ 106 ] The First Slam Dunk , released in 2022, grossed over $281 million worldwide as of August 2024 [update] , [ 107 ] becoming one of the top ten highest-grossing anime films of all time. [ 108 ]\n\nSlam Dunk is often considered as one of the most influential manga series in Japan and one of the greatest sports manga series of all-time. Its success is cited as a cause for the increased popularity of basketball among the Japanese youth during the 1990s. [ 109 ] Alex Wong of Yahoo! Sports wrote that the work \"inspired an entire generation of basketball players in Japan.\" [ 110 ] In a dissertation, PhD student Dexter Thomas of Cornell University stated \"The first wave of basketball in Japan was pushed forward by Slam Dunk .\" [ 111 ] Professional basketball players Rui Hachimura and Yuta Watanabe have cited Slam Dunk as inspiring them. [ 110 ] When he became a naturalized Japanese citizen, J. R. Sakuragi partially took his surname from the Hanamichi Sakuragi character. [ 112 ]\n\nAzusa Takahashi of the Japanese website Real Sound wrote that the appeal of Slam Dunk and the impact it had on the popularity of the sport is rooted in how realistic it is. It not only has flashy game scenes, but also includes scenes of steady practice. [ 113 ] The Slam Dunk Scholarship program was created in 2006 by Inoue and Shueisha. The winning 17- to 18-year-old recipient receives a fully paid academic and athletic scholarship to a university-preparatory school in America if they pass the school's admission interview. [ 114 ] Past recipients of the scholarship include Narito Namizato and Daichi Taniguchi . [ 115 ] In 2010, Inoue received special commendations from the Japan Basketball Association for helping popularize basketball in Japan and the scholarship program. [ 116 ] According to Wong, as of 2019, Slam Dunk \"has never crossed into the mainstream in North America\", and Viz editor Michael Montesa stated that in general manga related to sports have not sold as well in the United States. [ 110 ]\n\nThe Kamakurakōkōmae No. 1 railroad crossing on the Enoshima Electric Railway has become a popular tourist attraction, or seichi junrei , for fans of Slam Dunk due to being depicted in the opening credits of the manga's anime adaptation. [ 117 ] [ 118 ] The resulting overtourism has caused the local government to assign security guards to the location in order to curb troublesome behavior. [ 117 ] [ 118 ] Many of the visitors are from foreign countries such as China and South Korea. [ 117 ] [ 118 ] In Taiwan, a replica of the crossing was created in the town of Taimali . [ 119 ]\n\n2023–",
    "tf_idf_text": "slam dunk stylize cap japanese sport manga series write illustrated takehiko inoue serialize shueisha shnen manga magazine weekly shnen jump october june chapter collect tankbon volume story follow hanamichi sakuragi brash impulsive high school student join basketball team shohoku high school locate shnan area japan manga adapt anime television series toei animation air october march series broadcast worldwide gain popularity especially japan europe several asian country december anime feature film title first slam dunk release japan slam dunk million copy circulation make one bestselling manga series history receive shogakukan manga award shnen category japan slam dunk regard one great sport manga series time cite contributor popularize basketball among japanese youth inoue receive special commendation japan basketball association help popularize basketball japan hanamichi sakuragi high school delinquent gang leader unpopular among girl reject fifty time first year shohoku high school sakuragi meet haruko akagi girl dream overjoy not repulse frighten like girl haruko recognize sakuragis athleticism introduces shohoku basketball team sakuragi reluctant play basketball due inexperience sport belief basketball game loser belief come recent girl reject favor basketball player despite immaturity temper join team impress haruko prove natural athlete sakuragi later develop genuine love sport despite initially play crush around time star rookie girl magnet kaede rukawa join team sakuragi view bitter rival basketball romance haruko unrequited crush rukawa shortly two additional member rejoin team hisashi mitsui skilled threepoint shooter exjunior high school mvp ryota miyagi short fast point guard four player work together fulfill team captain takenori akagis dream win national championship defeat one powerhouse team national high school championship misfit gain publicity littleknown shohoku basketball team become allstar contender japan takehiko inoue inspire create slam dunk love basketball since high school start slam dunk create oneshot manga title aka suki publish weekly shnen jump summer special oneshot feature early prototype hanamichi sakuragi haruko akagi story character dynamic lay groundwork slam dunk begin work series inoue surprise receive letter reader begin play sport due manga editor tell basketball taboo world due letter inoue decide wanted draw well basketball game series series author want demonstrate feeling thought athlete might win lose improve sport begin work vagabond inoue note work slam dunk simpler perspective life focus victory success series inoue want reader feel achievement love sport think success manga artist largely due basketball inoue organize slam dunk scholarship japanese student want give back sport increase popularity japan however ask response reader basketball inoue comment although slam dunk technically basketball manga story could tell sport football add mangas artwork mangalike compare new work real experience basketball also influence story slam dunk youth inoue begin play basketball become popular girl later develop interest sport experience mirror character hanamichi sakuragi begin play basketball impress girl later grow truly fond game inoue attend nba final united state summer olympics barcelona research manga write illustrated takehiko inoue slam dunk serialize shueisha shnen manga magazine weekly shnen jump october june individual chapter originally collect tankbon volume shueishas jump comic imprint first publish february final volume october later reassemble kanzenban volume jump comic deluxe imprint march february volume shinsban edition publish june september november book imitate issue weekly shnen jump collect select chapter original manga publish title slam dunk jump north america english version slam dunk publish nowdefunct gutsoon entertainment serialize title manga anthology raijin comic five collect volume publish gutsoons raijin graphic novel imprint release july may gutsoon go business license slam dunk purchase viz medium publish preview series december issue north american edition shonen jump slam dunk begin serialization magazine starting may issue well tankbon format first publish september final volume release december inoue produce epilogue title slam dunk day draw chalkboard former campus defunct misaki high school locate kanagawa prefecture hold public exhibition three day december epilogue along coverage event print february issue switch magazine documentary event release dvd may epilogue publish book form flower title slam dunk day complete april anime series consist episode produce toei animation direct nobutaka nishizawa first broadcast asahi october march later air satellite television network animax addition four animated movie produce anime follow manga storyline leave national tournament game toei compile episode series seventeen dvd release japan december may toei collected series three dvd box three box total seventeen disc celebrate year since broadcast anime release bluray format toei geneon briefly team release anime dvd north america manga discontinue though also discontinue volume first dvd release march volume last one release june cancel various episode series also downloadable ign directdrive service toei make available series stream crunchyroll joost also start stream series may music compose takanobu masuda episode bmf episode three soundtrack publish air series japan opening end two theme collect soundtrack best animation slam dunk release july four anime film produce toei animation manga series still run contain largely new material either hint not present manga august nhk broadcast four movie part satellite network nhk bss summer anime choice lineup osaka air last three movie january film collect dvd box name slam dunk movie release december first film simply title slam dunk premier march set shohokus practice game ryonan second half episode film focus practice game takezono high game sakuragi run yoko shimura girl reject first scene series oda basketball player reject zenkoku seiha sakuragi hanamichi release july second film series happen shohokus round qualify game tsukubu high first half episode film feature original character include godai old friend akagi kogures rango wild showoff love haruko quarrel sakuragi coach kawasaki former pupil anzaisensei shohoku saidai kiki moero sakuragi hanamichi release march set shohokus loss kainan practice match ryokufu high episode hoero basukettoman tamashii hanamichi rukawa atsuki natsu release one june tell rukawas middle school kouhai ichiro mizusawa paralyze soon wish one last game rukawa first half episode january slam dunk author takehiko inoue announce twitter account series would receive new anime film toei animation title first slam dunk inoue director writer film yasuyuki ebara design character premier japan december numerous video game base series mostly develop banpresto produce bandai publish japanese market two basketball sims title slam dunk gakeppuchi kessh league slam dunk release game boy super famicom three game slam dunk shikyou gekitotsu slam dunk yosen kanzenban heat slam dunk game also release game gear mega drive sega saturn slam dunk coinoperated arcade game develop video system publish banpresto release call animation slam dunk super slam development game call dunk madness not slam dunk license character series also appear nintendo game jump super star jump ultimate star unofficial game modification make fan nba version novel depict original story write yoshiyuki suga publish december illustration slam dunk include art book inoue takehiko illustration publish june plusslam dunk illustration follow april slam dunk shrigaku book write sport psychologist shuichi tsuji psychology win use slam dunk reference publish october slam dunk award shogakukan manga award shnen category poll close japanese japan medium art festival slam dunk vote manga time survey oricon rank first manga fan want turned liveaction film november reader medium factory vinci magazine vote slam dunk fourth weekly shnen jump great manga series time ranked second behind kingdom first annual tsutaya comic award alltime best section asahi manga ssenkyo poll people vote top manga series slam dunk rank third behind one piece demon slayer kimetsu yaiba english translation manga list one best comic publisher weekly similarly young adult library service association name first volume one great graphic novel teens early french newspaper figaro select series one six recommend manga feature paris book fair slam dunk one bestselling manga series history collect volume sell million copy japan million million series million copy circulation worldwide series million copy circulation worldwide broken volume slam dunk held record initial printing manga million copy print version slam dunk day popular initially rank sixth oricon weekly ranking manga first six volume shinsban edition original manga reach top eight release week high first volume number two result slam dunk fourth bestselling manga million copy sell ninth topselling medium franchise estimate sale billion slam dunk third bestselling manga series first half period november may million copy sell carlo santos anime news network write solid character eyepopping action classic underdog story slam dunk manga series basketball player aspire complete package base first volume however colleague carl kimlinger say come romantic comedy sport manga focus establish cast santos opine stuff happens court really make mangas heart soul character story tell goal reach court simply provide stage act universal struggle similarly kris kosaka japan time write slam dunk not typical sport story dominate onthecourt heroic inoues love basketball evident every page sport illustrate ben sin write many reason slam dunk beloved include hilarious rivalry main character teammate handsome star player large female fanbase many character subplots since become crucial part manga lore sin also proclaim inoue great mix serious goofy tone artwork history comic inoue draw stunningly detailed emotional portrait human one panel character facial feature next kimlinger call sakuragi inspire choice lead character thug hairtrigger temper wrong motivation say seemingly impossible balance likeability extreme hubris thanks humorous scene santos write sakuragi may not mindblowing superhuman skill normally associate shnen protagonist watch grow sportsman decent human excite despite schoolpunk character design generally consider comedic nowadays santos call art solid visual flow sense motion anime adaptation also popular japan asahi top anime survey multiple age group slam dunk rank eighth popular anime another poll asahi develop website series rank tenth home video release anime also good sale appear oricon japanese animation dvd bluray ranking anime film perform well box office first three film release grossed billion billion billion japan respectively combine billion million gross japan first slam dunk release gross million worldwide august update become one top ten highestgrossing anime film time slam dunk often consider one influential manga series japan one great sport manga series alltime success cite cause increase popularity basketball among japanese youth alex wong yahoo sport write work inspired entire generation basketball player japan dissertation phd student dexter thomas cornell university state first wave basketball japan push forward slam dunk professional basketball player rui hachimura yuta watanabe cite slam dunk inspiring become naturalized japanese citizen sakuragi partially take surname hanamichi sakuragi character azusa takahashi japanese website real sound write appeal slam dunk impact popularity sport root realistic not flashy game scene also include scene steady practice slam dunk scholarship program create inoue shueisha win yearold recipient receive fully pay academic athletic scholarship universitypreparatory school america pas school admission interview past recipient scholarship include narito namizato daichi taniguchi inoue receive special commendation japan basketball association help popularize basketball japan scholarship program accord wong slam dunk never cross mainstream north america viz editor michael montesa state general manga relate sport not sell well united state kamakurakkmae railroad cross enoshima electric railway become popular tourist attraction seichi junrei fan slam dunk due depict open credit mangas anime adaptation result overtourism cause local government assign security guard location order curb troublesome behavior many visitor foreign country china south korea taiwan replica cross create town taimali"
}