{
    "title": "en.wikipedia.org_wiki_Yu-Gi-Oh!",
    "url": "https://en.wikipedia.org/wiki/Yu-Gi-Oh!",
    "transformers_text": "Yu-Gi-Oh! ( Japanese : 遊☆戯☆王 , Hepburn : Yū Gi Ō ; lit. ' Game King ' ) is a Japanese manga series written and illustrated by Kazuki Takahashi . It was serialized in Shueisha 's shōnen manga magazine Weekly Shōnen Jump between September 1996 and March 2004, with its chapters collected in 38 tankōbon volumes. The series follows Yugi Mutou , a teenager who solves the ancient Egyptian Millennium Puzzle. This causes Yugi to become host to a gambling alter-ego or spirit who solves his conflicts with various games. As the manga progresses, the focus largely shifts to the card game Duel Monsters (originally known as Magic & Wizards ), where opposing players \"duel\" one another in mock battles of fantasy monsters.\n\nThe manga series has spawned a media franchise that includes multiple spin-off manga, anime series, video games, and a real-world card game, the Yu-Gi-Oh! Trading Card Game , based on the fictional Duel Monsters game. The first anime series adaptation, simply titled Yu-Gi-Oh! and produced by Toei Animation , aired from April to October 1998, while the second one, Yu-Gi-Oh! Duel Monsters , produced by NAS and animated by Gallop , aired from April 2000 to September 2004.\n\nYu-Gi-Oh! has become one of the highest-grossing media franchises of all time.\n\nYu-Gi-Oh! follows Yugi Mutou , a timid high schooler who is frequently bullied. Yugi loves to play games and, at the beginning of the series, is solving the Millennium Puzzle ( 千年パズル , Sennen Pazuru ) , an Ancient Egyptian artifact, hoping that it will grant him his wish of making friends. Yugi eventually completes the Puzzle, causing his body to become the host to a mysterious spirit with the personality of a gambler. From that moment onwards, whenever Yugi or any of his friends is threatened, the spirit, briefly possessing Yugi, challenges the antagonist to Shadow Games ( 闇のゲーム , Yami no Gēmu ; lit. \"Game of Darkness\") that reveal that person's true nature, with the loser often being subjected to an adverse Penalty Game ( 罰ゲーム , Batsu Gēmu ) . Yugi and his friends gradually learn of the spirit's existence, referring to him as the \"other Yugi\".\n\nAs the series progresses, Yugi and his friends learn that the spirit is actually that of a nameless Pharaoh of Ancient Egypt , who had lost his memories after being sealed inside the Puzzle. As Yugi and his companions attempt to help the Pharaoh regain his memories, they find themselves going through many trials as they wager their lives facing off against those who wield the other Millennium Items ( 千年アイテム , Sennen Aitemu ) and the dark power of the Shadow Games.\n\nIn the initial planning stages of Yu-Gi-Oh! , Takahashi had originally wanted to draw a horror manga. [ 2 ] Although the end result was a manga revolving around games, some horror elements influenced certain aspects of the story. Takahashi decided to use \"battle\" as his primary theme. Since there were so many manga based around fighting, he found it difficult to come up with something original. He decided to create a battle manga where the main character does not hit anybody, but also struggled with that limitation. When the word \"game\" came to mind, he found it much easier to work with. [ 3 ]\n\nWhen an interviewer asked Takahashi if he tried to introduce younger readers to real life gaming culture referenced in the series, Takahashi explained that he simply included \"stuff he played and enjoyed\", and that it may have introduced readers to role-playing games and others. He added that he created some of the games seen in the series, stressing the importance of \"communication between people\" that is often present in tabletop role-playing games but absent in solitary video games and especially over the Internet, where quality communication is near impossible. [ 4 ]\n\nTakahashi had always been interested in games, claiming to have been obsessed as a child and remained interested in them as an adult. In a game, he considered the player to become a hero. He decided to base the Yu-Gi-Oh! series around such games and used this idea as the premise; Yugi was a weak, immature boy, who became a hero when he played games. With friendship being one of the major themes of Yu-Gi-Oh! , he based the names of the two major characters \"Yūgi\" and \"Jōnouchi\" on the Japanese word yūjō , which means \"friendship\". Henshin, the ability to turn into something or someone else, is something Takahashi believed all children dreamed of. He considered Yugi's \"henshin\" Dark Yugi, a savvy, invincible games player, to be a big appeal to children. [ 5 ]\n\nTakahashi said that the card game held the strongest influence in the manga, because it \"happened to evoke the most response\" from readers. Prior to that point, Takahashi did not plan to make the story about cards. [ 6 ]\n\nTakahashi said that the \"positive message\" for readers of the series is that each person has a \"strong hidden part\" (like \"human potential\") within himself or herself, and when one encounters hardship, the \"hidden part\" can emerge if one believes in him/herself and in his/her friends. Takahashi added that this is \"a pretty consistent theme.\" [ 6 ]\n\nThe editor of the English version, Jason Thompson , said that the licensing of the Yu-Gi-Oh! manga had not been entirely coordinated, so Viz decided to use many of the original character names and to \"keep it more or less violent and gory\". Thompson said that the manga \"was almost unchanged from the Japanese original\". Because the core fanbase of the series was, according to Thompson, \"8-year-old boys (and a few incredible fangirls)\", and because the series had little interest from \"hardcore, Japanese-speaking fans, the kind who run scanlation sites and post on messageboards\" as the series was perceived to be \"too mainstream\", the Viz editors allowed Thompson \"a surprising amount of leeway with the translation\". [ 7 ] In a 2004 interview, the editors of the United States Shonen Jump publication mentioned that Americans were surprised when reading the stories in the first seven volumes, as they had not appeared on television as a part of the Yu-Gi-Oh! Duel Monsters anime. Takahashi added \"The story is quite violent, isn't it? [laughs] \" [ 6 ]\n\nThe English language release of the Duel Monsters anime by 4Kids has been subject to censorship to make it more appropriate for children; for example, mentions of death or violence were replaced by references to \"being sent to the Shadow Realm\". [ 8 ]\n\nThe Japanese title, Yūgiō ( 遊戯王 ) , stylized as \"Yu-Gi-Oh!\" ( 遊☆戯☆王 ) , translates into English as \"Game King\". Yūgi ( 遊戯 ) is also the name of the protagonist, while Yūgiō is also the title the second personality inhabiting his body holds as an invincible game master. Additionally, the character names \"Yūgi\" and \" Jōnouchi \" are based on the word yūjō ( 友情 ; \"friendship\") . [ 9 ]\n\nWritten and illustrated by Kazuki Takahashi , Yu-Gi-Oh! was serialized in Shueisha 's shōnen manga magazine Weekly Shōnen Jump from September 17, 1996, to March 8, 2004. [ 10 ] [ 11 ] Shueisha collected its chapters in thirty-eight tankōbon volumes, released from March 4, 1997, [ 12 ] to June 4, 2004. [ 13 ] Shueisha republished its chapters in twenty-two bunkoban volumes from April 18, 2007, [ 14 ] to March 18, 2008. [ 15 ]\n\nIn North America, the manga was licensed by Viz Media . The company started publishing it in its Shonen Jump magazine from November 2002 to November 2007. [ 16 ] [ 17 ] The company also released the manga in volumes, divided in three series; the first series, Yu-Gi-Oh! , includes the first seven volumes, and were released from May 7, 2003; [ 18 ] to December 7, 2004. [ 19 ] The second series, Yu-Gi-Oh!: Duelist includes the original volumes 8–31, and Yu-Gi-Oh!: Millennium World , includes the original volumes 32–38. Both series started publication in 2005; the first volume of Duelist was released on February 1, [ 20 ] and the first volume of Millennium World on August 2. [ 21 ] The 24th and last volume of Duelist was released on December 4, 2007, [ 22 ] and the seventh and final volume of Millennium World was released on February 5, 2008. [ 23 ] Viz Media republished the series in a 13 three-in-one volume edition from February 3, 2015, [ 24 ] to February 6, 2018. [ 25 ]\n\nA two-part short story by Takahashi, titled Yu-Gi-Oh! Transcend Game , was published in Weekly Shōnen Jump on April 11 and 18, 2016. [ 26 ] [ 27 ] Takahashi created the story to link the end of the original manga with the story of the Yu-Gi-Oh! The Dark Side of Dimensions anime film. [ 28 ] Viz Media published the manga in its digital Weekly Shonen Jump magazine. [ 28 ]\n\nA spin-off manga titled Yu-Gi-Oh! R was illustrated by Akira Ito under Takahashi's supervision. It was serialized in V Jump between 2004 and 2007, and its chapters were collected in five volumes. Viz Media released the series in North America between 2009 and 2010. [ 29 ]\n\n1236 + 7\n\nThe first Yu-Gi-Oh! anime adaptation was produced by Toei Animation and aired for 27 episodes on TV Asahi from April to October 1998. [ 30 ]\n\nA second anime television series adaptation, produced by NAS and animated by Gallop , was broadcast for 224 episodes on TV Tokyo from April 2000 to September 2004. [ 31 ]\n\nYu-Gi-Oh! Capsule Monsters is a 12-episode spin-off miniseries to the Yu-Gi-Oh! Duel Monsters series, commissioned, produced and edited by 4Kids Entertainment , which aired in North America between September and November 2006. [ 32 ]\n\nFour theatrical animated films based on the franchise have been released.\n\nBased on the Toei animated series, the thirty-minute Yu-Gi-Oh! film was released in March 1999. [ 33 ]\n\nYu-Gi-Oh! The Movie: Pyramid of Light , often referred to as simply Yu-Gi-Oh! The Movie , was first released in North America in August 2004. [ 34 ] The film was developed specifically for Western audiences by 4Kids based on the success of the Yu-Gi-Oh! franchise in the United States.\n\nYu-Gi-Oh!: Bonds Beyond Time is a 3D film that was released in Japan in January 2010 and in North America in February 2011. [ 35 ] [ 36 ]\n\nYu-Gi-Oh! The Dark Side of Dimensions , which was produced to commemorate the twentieth anniversary of the franchise, was released in Japan in April 2016 and in January 2017 in North America. [ 37 ] [ 38 ]\n\nSeven Yu-Gi-Oh! anime spin-offs have been produced. The first, Yu-Gi-Oh! GX , was broadcast from October 2004 to March 2008. [ 39 ] It was succeeded by Yu-Gi-Oh! 5D's , which aired from April 2008 to March 2011. [ 40 ] Yu-Gi-Oh! Zexal aired from April 2011 to March 2014. [ 41 ] [ 42 ] Yu-Gi-Oh! Arc-V premiered the following month and aired until March 2017. [ 43 ] [ 44 ] Yu-Gi-Oh! VRAINS aired from May 2017 to September 2019. [ 45 ] [ 46 ] Yu-Gi-Oh! Sevens aired from April 2020 to March 2022. [ 47 ] [ 48 ] Yu-Gi-Oh! Go Rush!! , an \" interquel \" to Sevens , aired from April 2022 to March 2025. [ 49 ] [ 50 ] An original net animation (ONA) series consisting of promotional shorts, titled Yu-Gi-Oh! Card Game The Chronicles , premiered on YouTube in April 2025 with new episodes debuting every month. [ 51 ]\n\nA novel adaptation of some of the beginning parts of the manga and the Death-T arc was written by Katsuhiko Chiba [ ja ] and published in Japan by Shueisha on September 3, 1999, consisting of four sections. [ 52 ] The fourth section is an original story, occurring only in the novel. Two weeks after Yugi's battle with Kaiba in Death-T, Yugi gets a call from Kaiba, who tells him to meet for a game at the top floor of Kaiba Corporation. Yugi accepts, and when the game begins, they use a special variation of Magic & Wizards called the \"Bingo Rule,\" which prevents the use of a specific card in each player's deck. Mokuba stumbles in on them, and tells Yugi that Kaiba has not yet awoken from his catatonic state. It turns out that the Kaiba that Yugi is playing against is a \"Cyber Kaiba\", controlled by the KaibaCorp computer, using all of Kaiba's memories.\n\nYu-Gi-Oh! Character Guidebook: The Gospel of Truth ( 遊☆戯☆王キャラクターズガイドブック―真理の福音― , Yūgiō Kyarakutāzu Gaido Bukku Shinri no Fukuin ) is a guidebook written by Kazuki Takahashi related to characters from the original Yu-Gi-Oh! manga universe. It was published in Japan on November 1, 2002, by Shueisha under their Jump Comics imprint. [ 53 ] The book contains profiles for characters, including information which has never been released elsewhere, including birth dates, height, weight, blood type, favorite and least favorite food. It also contains a plethora of compiled information from the story, including a list of names for the various games and Shadow Games that appear in Yu-Gi-Oh! and the various Penalty Games used by the Millennium Item wielders.\n\nAn art book titled, Duel Art ( デュエルアート , Dyueruāto ) was illustrated by Kazuki Takahashi under the Studio Dice label. The art book was released on December 16, 2011, and contains a number of illustrations done for the bunkoban releases of the manga, compilations of color illustrations found in the manga, and brand new art drawn for the book. [ 54 ] It also contains pictures by Takahashi used for cards with the anniversary layout, pictures he has posted on his website and a number of other original illustrations. Udon Press published an English version, translated by Caleb D. Cook. [ 55 ]\n\nThe Theatrical & TV Anime Yu-Gi-Oh! Super Complete Book ( 劇場&TVアニメ『遊☆戯☆王』スーパー・コンプリートブック , Gekijō & TV Anime Yūgiō Sūpā Konpurītobukku ) was released in May 1999 following the release of Toei's Yu-Gi-Oh! film earlier that year. The book includes episode information and pictures regarding the anime and film, some pictures with the original manga with a section covering the making of certain monsters, and interviews regarding the film. It also features an ani-manga version of the film and is the only supplemental work released for the Toei anime. [ 56 ]\n\nThe Yu-Gi-Oh! 10th Anniversary Animation Book ( 遊☆戯☆王 テンス アニバーサリー アニメーション ブック , Yūgiō! Tensu Anivāsarī Animēshon Bukku ) is a book released to celebrate the tenth anniversary of the NAS adaption of the anime (as opposed to the manga), released on January 21, 2010. The book features scenes from Yu-Gi-Oh! 3D Bonds Beyond Time , a quick review of the three Yu-Gi-Oh! Duel Monsters series, character profiles, duels and interviews with the staff of the film. A fold-out double-sided poster is included with the book. [ 57 ]\n\nThe Yu-Gi-Oh! Trading Card Game is a Japanese collectible card battle game developed and published by Konami . Based on the Duel Monsters game from the original manga series, the game sees players using a combination of monsters, spells, and traps to defeat their opponent. The game was first launched in Japan in 1999 and has undergone various changes over the years, such as the inclusion of new monster types to coincide with the release of new anime series. In 2011, Guinness World Records named it the best-selling trading card game in history, with 25.2 billion cards sold worldwide. [ 58 ] As of January 2021 [update] , the game is estimated to have sold approximately 35 billion cards worldwide. [ 59 ] [ 60 ] [ 61 ]\n\nThere are several video games based on the Yu-Gi-Oh! franchise, which are published by Konami and the majority of which are based on the trading card game, and some based on other games that appeared in the manga. Aside from various games released for consoles and handheld systems, arcade machines known as Duel Terminals have been released which are compatible with certain cards in the trading card game. Outside of Konami's titles, Yugi appears as a playable character in the crossover fighting games Jump Super Stars , Jump Ultimate Stars , and Jump Force . [ 62 ] [ 63 ] [ 64 ] A collaboration with Konami's football video game eFootball was released in 2025. [ 65 ]\n\nThe manga has sold over 40 million copies worldwide. [ 66 ] In December 2002, Shonen Jump received the ICv2 Award for \"Comic Product of the Year\" due to its unprecedented sales numbers and its successfully connecting comics to both the television medium and the Yu-Gi-Oh! collectible card game , one of the top CCG games of the year. [ 67 ] In August 2008, TV Tokyo reported that over 18 billion Yu-Gi-Oh! cards had been sold worldwide. [ 68 ] By 2011, it had sold 25.2 billion cards worldwide. [ 58 ]\n\nJohn Jakala of Anime News Network reviewed the Yu-Gi-Oh! manga in 2003 as part of reviewing the U.S. Shonen Jump publication. Jakala said that while the commercials for the second series anime made it appear \"completely uninteresting,\" the manga was \"unexpectedly dark and moody.\" Jakala added that at one moment the series reminded him of \" Neil Gaiman 's work: Yugi finds himself drawn into a magical world of ancient forces where there are definite rules that must be obeyed.\" Jakala concluded that the fact the series uses games as plot devices \"opens up a lot of story possibilities\" and that he feared that the series had the potential to \"simply devolve into a tie-in for the popular card game.\" [ 69 ]\n\nJason Thompson , the editor of the English version of the manga, ranked Yu-Gi-Oh! as number three of his five personal favorite series to edit, stating that he thinks \"the story is actually pretty solid for a shonen manga\" and that \"you can tell it was written by an older man because of the obsession with death, and what might come after death, which dominates the final story arc,\" enjoying all the RPG and card gaming terminology found within the series. [ 7 ]\n\nLisa Takeuchi Cullen argued that the manga series started to garner more popularity among Japanese children with the second series because of its somewhat \"dark story lines, leggy girls and terrifying monsters\". Cullen speculated that the series was not popular among Japanese parents, due to it being more intended for teenagers rather than the younger children that make up the audience for franchises such as Pokémon . [ 70 ]\n\nIn TV Asahi 's 2006 poll of the Top 100 Anime, Yu-Gi-Oh! came in 96th. [ 71 ] Yu-Gi-Oh! was featured by Bandai as part of their Candy Toy toy line. [ 72 ] [ 73 ] [ 74 ]\n\nA fandub parody video of Yu-Gi-Oh! was uploaded on YouTube on July 15, 2006, by Martin Billany (also known as LittleKuriboh) titled Yu-Gi-Oh: The Abridged Series – Episode One Redux . After becoming popular, it started a trend among anime communities to produce abridged series for different works. [ 75 ] [ 76 ]\n\nDuring the 2024 US Olympic track and field trials , Noah Lyles showed off Yu-Gi-Oh! cards Blue Eyes White Dragon and Exodia to the camera before running. [ 77 ] [ 78 ]",
    "tf_idf_text": "yugioh japanese hepburn lit game king japanese manga series write illustrated kazuki takahashi serialize shueisha shnen manga magazine weekly shnen jump september march chapter collect tankbon volume series follow yugi mutou teenager solve ancient egyptian millennium puzzle cause yugi become host gamble alterego spirit solves conflict various game manga progress focus largely shifts card game duel monster originally know magic wizard oppose player duel one another mock battle fantasy monster manga series spawn medium franchise include multiple spinoff manga anime series video game realworld card game yugioh trade card game base fictional duel monster game first anime series adaptation simply title yugioh produce toei animation air april october second one yugioh duel monster produce nas animate gallop air april september yugioh become one highestgrossing medium franchise time yugioh follow yugi mutou timid high schooler frequently bully yugi love play game begin series solve millennium puzzle sennen pazuru ancient egyptian artifact hop grant wish make friend yugi eventually complete puzzle cause body become host mysterious spirit personality gambler moment onwards whenever yugi friend threaten spirit briefly possess yugi challenge antagonist shadow game yami gmu lit game darkness reveal person true nature loser often subjected adverse penalty game batsu gmu yugi friends gradually learn spirit existence refer yugi series progress yugi friend learn spirit actually nameless pharaoh ancient egypt lose memory seal inside puzzle yugi companion attempt help pharaoh regain memory find go many trial wager life face wield millennium item sennen aitemu dark power shadow game initial plan stage yugioh takahashi originally want draw horror manga although end result manga revolve around game horror element influence certain aspect story takahashi decide use battle primary theme since many manga base around fight find difficult come something original decide create battle manga main character not hit anybody also struggle limitation word game come mind find much easy work interviewer ask takahashi tried introduce young reader real life game culture reference series takahashi explain simply included stuff play enjoyed may introduce reader roleplay game others add create game see series stress importance communication people often present tabletop roleplay game absent solitary video game especially internet quality communication near impossible takahashi always interested game claim obsessed child remain interested adult game consider player become hero decide base yugioh series around game use idea premise yugi weak immature boy become hero play game friendship one major theme yugioh base names two major character ygi jnouchi japanese word mean friendship henshin ability turn something someone else something takahashi believe child dream consider yugis henshin dark yugi savvy invincible game player big appeal child takahashi say card game hold strong influence manga happen evoke response reader prior point takahashi not plan make story card takahashi say positive message reader series person strong hidden part like human potential within one encounter hardship hidden part emerge one believe himherself hisher friend takahashi add pretty consistent theme editor english version jason thompson say licensing yugioh manga not entirely coordinate viz decide use many original character name keep less violent gory thompson say manga almost unchanged japanese original core fanbase series accord thompson yearold boy incredible fangirls series little interest hardcore japanesespeaking fan kind run scanlation sit post messageboards series perceive mainstream viz editor allow thompson surprising amount leeway translation interview editor unite state shonen jump publication mention american surprised reading story first seven volume not appear television part yugioh duel monster anime takahashi add story quite violent isnt laugh english language release duel monster anime kid subject censorship make appropriate child example mention death violence replace reference send shadow realm japanese title ygi stylize yugioh translates english game king ygi also name protagonist ygi also title second personality inhabit body hold invincible game master additionally character name ygi jnouchi base word friendship write illustrated kazuki takahashi yugioh serialize shueisha shnen manga magazine weekly shnen jump september march shueisha collect chapter thirtyeight tankbon volume release march june shueisha republish chapter twentytwo bunkoban volume april march north america manga license viz medium company start publish shonen jump magazine november november company also release manga volume divide three series first series yugioh include first seven volume release may december second series yugioh duelist include original volume yugioh millennium world include original volume series start publication first volume duelist release february first volume millennium world august last volume duelist release december seventh final volume millennium world release february viz medium republish series threeinone volume edition february february twopart short story takahashi title yugioh transcend game publish weekly shnen jump april takahashi create story link end original manga story yugioh dark side dimension anime film viz medium publish manga digital weekly shonen jump magazine spinoff manga title yugioh illustrated akira ito takahashis supervision serialize jump chapter collect five volume viz medium release series north america first yugioh anime adaptation produce toei animation air episode asahi april october second anime television series adaptation produce nas animate gallop broadcast episode tokyo april september yugioh capsule monster episode spinoff miniseries yugioh duel monster series commission produce edited kid entertainment air north america september november four theatrical animate film base franchise release base toei animate series thirtyminute yugioh film release march yugioh movie pyramid light often refer simply yugioh movie first release north america august film develop specifically western audience kid base success yugioh franchise united state yugioh bond beyond time film release japan january north america february yugioh dark side dimension produce commemorate twentieth anniversary franchise release japan april january north america seven yugioh anime spinoffs produce first yugioh broadcast october march succeed yugioh air april march yugioh zexal air april march yugioh arcv premier follow month air march yugioh vrains air may september yugioh seven air april march yugioh rush interquel seven air april march original net animation ona series consist promotional short title yugioh card game chronicle premier youtube april new episode debut every month novel adaptation begin part manga deatht arc write katsuhiko chiba publish japan shueisha september consist four section fourth section original story occur novel two week yugis battle kaiba deatht yugi get call kaiba tell meet game top floor kaiba corporation yugi accepts game begin use special variation magic wizard call bingo rule prevents use specific card player deck mokuba stumble tell yugi kaiba not yet awake catatonic state turn kaiba yugi play cyber kaiba control kaibacorp computer use kaibas memory yugioh character guidebook gospel truth ygi kyarakutzu gaido bukku shinri fukuin guidebook write kazuki takahashi relate character original yugioh manga universe publish japan november shueisha jump comic imprint book contains profile character include information never release elsewhere include birth date height weight blood type favorite least favorite food also contain plethora compile information story include list names various game shadow game appear yugioh various penalty game use millennium item wielders art book title duel art dyueruto illustrate kazuki takahashi studio dice label art book release december contains number illustration do bunkoban release manga compilation color illustration find manga brand new art drawn book also contain picture takahashi use card anniversary layout picture post website number original illustration udon press publish english version translate caleb cook theatrical anime yugioh super complete book gekij anime ygi konpurtobukku release may follow release toeis yugioh film earlier year book include episode information picture regard anime film picture original manga section cover make certain monster interview regard film also feature animanga version film supplemental work release toei anime yugioh anniversary animation book ygi tensu anivsar animshon bukku book release celebrate tenth anniversary na adaption anime oppose manga release january book feature scenes yugioh bond beyond time quick review three yugioh duel monster series character profile duel interview staff film foldout doublesided poster include book yugioh trading card game japanese collectible card battle game develop publish konami base duel monster game original manga series game see player use combination monster spell traps defeat opponent game first launch japan undergone various change year inclusion new monster type coincide release new anime series guinness world record name bestselling trade card game history billion card sell worldwide january update game estimate sell approximately billion card worldwide several video game base yugioh franchise publish konami majority base trade card game base game appear manga aside various game release console handheld system arcade machine know duel terminal release compatible certain card trade card game outside konamis title yugi appear playable character crossover fight game jump super star jump ultimate star jump force collaboration konamis football video game efootball release manga sell million copy worldwide december shonen jump receive icv award comic product year due unprecedented sale number successfully connect comic television medium yugioh collectible card game one top ccg game year august tokyo report billion yugioh card sell worldwide sell billion card worldwide john jakala anime news network review yugioh manga part review shonen jump publication jakala say commercial second series anime make appear completely uninteresting manga unexpectedly dark moody jakala add one moment series remind neil gaiman work yugi find draw magical world ancient force definite rule must obey jakala conclude fact series use game plot device open lot story possibility fear series potential simply devolve tiein popular card game jason thompson editor english version manga rank yugioh number three five personal favorite series edit state think story actually pretty solid shonen manga tell write old man obsession death might come death dominates final story arc enjoy rpg card game terminology find within series lisa takeuchi cullen argue manga series start garner popularity among japanese child second series somewhat dark story line leggy girl terrify monster cullen speculate series not popular among japanese parent due intend teenager rather young child make audience franchise pokmon asahi poll top anime yugioh come yugioh feature bandai part candy toy toy line fandub parody video yugioh upload youtube july martin billany also know littlekuriboh title yugioh abridged series episode one redux become popular start trend among anime community produce abridged series different work olympic track field trial noah lyles show yugioh card blue eye white dragon exodia camera run"
}