{
    "title": "en.wikipedia.org_wiki_Ky%C5%ABkyoku!!_Hentai_Kamen",
    "url": "https://en.wikipedia.org/wiki/Ky%C5%ABkyoku!!_Hentai_Kamen",
    "transformers_text": "Kyūkyoku!! Hentai Kamen ( 究極!!変態仮面 ; 'Ultimate!! Pervert Mask') is a Japanese manga series written and illustrated by Keishū Ando. It was originally serialized in Shueisha shōnen manga magazine Weekly Shōnen Jump from 1992 to 1993. The series tells the tale of a young martial artist who transforms into a bizarre hero of justice by wearing a pair of panties on his head. A live action film adaptation titled Hentai Kamen was released in 2013. It was followed by a second film, Hentai Kamen: Abnormal Crisis , in 2016.\n\nKyōsuke Shikijō is a high school student skilled in kenpō , but incompetent with girls to the point that his interaction with them gets him into painful situations. One day he saves a girl named Aiko Himeno from bullies and is immediately smitten with her. When she is taken hostage by a group of criminals during a bank robbery, Kyōsuke is forced to take a disguise to save her without being recognized by the crooks after an earlier incident where he reveals himself on a megaphone . When he accidentally puts a pair of panties over his head instead of a normal mask he undergoes a transformation: due to the perverted genetics of his mother (an S&M worker), he is able to awaken the full potential of his body. Running out wearing nothing but the panties on his head and underpants covering his loins, Kyōsuke, now christening his masked self Hentai Kamen, uses his power and perversion to defeat the criminals and save Aiko.\n\nKyūkyoku!! Hentai Kamen was written and illustrated by Keishū Ando and serialized in Shueisha shōnen manga magazine Weekly Shōnen Jump from 1992 to 1993. A total of six tankōbon collecting the 52 chapters were released.\n\nThe series returned by way of School Rumble author Jin Kobayashi with the special one-shot Kaettekita Hentai Kamen ( 帰ってきた変態仮面 ; lit. ' Pervert Mask Has Returned ' ) in the magazine Jump Square in February 2008. A one-shot manga titled Hentai Kamen S: Hentai Kamen Second ( ヘンタイカメン セカンド , Hentai Kamen S: Hentai Kamen Sekando ) was published in the May issue of Jump Square to promote the live-action film. [ 2 ]\n\nThe original manga was adapted into a live action film in 2013. [ 3 ] [ 4 ] The DVD release of the live-action film included an original manga telling a side-story of the film. [ 5 ] The trailer to the live action film was first teased at the end of Evangelion 3.0 , but was set for release on April 13, 2013. [ 6 ] Hentai Kamen was used in a 'movie manners' segment that was released in select theaters; it drew attention for its unique and interesting way of reminding patrons. [ 7 ] [ 8 ]\n\nThe movie was directed by Yūichi Fukuda , known for manga-based TV dramas like One Pound Gospel and Saru Lock . [ 9 ] The cast includes Ryohei Suzuki as the protagonist Kyosuke and Fumika Shimizu as the lead girl. [ 10 ] The theme song is \"Emotions\" by Man With A Mission and the insert theme song is \"Blast\" by Anthem .\n\nIt did not make Box Office Mojo 's list on its first weekend, but attained 12th place for the second and third weeks of its theatrical run. [ 11 ] [ 12 ] On April 29, it was announced that the movie had grossed 100 million yen at the box office. [ 13 ] Despite its small scale showing, the first week earnings were ten times better than projected box office expectations. [ 14 ] [ 15 ] The movie was originally planned to be a direct-to-DVD release. [ 15 ]\n\nOn July 18, 2013, the New York Asian Film Festival announced the film as their Audience Award winner and recipient of the Daniel A. Craft Award for Excellence in Action Cinema. [ 16 ]\n\nA second film, Hentai Kamen: Abnormal Crisis , was released in 2016. [ 17 ]",
    "tf_idf_text": "kykyoku hentai kamen ultimate pervert mask japanese manga series write illustrated keish ando originally serialize shueisha shnen manga magazine weekly shnen jump series tell tale young martial artist transforms bizarre hero justice wear pair panty head live action film adaptation title hentai kamen release follow second film hentai kamen abnormal crisis kysuke shikij high school student skilled kenp incompetent girl point interaction get painful situation one day save girl name aiko himeno bully immediately smite take hostage group criminal bank robbery kysuke force take disguise save without recognize crook earlier incident reveals megaphone accidentally put pair panty head instead normal mask undergoes transformation due pervert genetics mother worker able awaken full potential body run wear nothing panty head underpants cover loin kysuke christen mask self hentai kamen use power perversion defeat criminal save aiko kykyoku hentai kamen write illustrated keish ando serialize shueisha shnen manga magazine weekly shnen jump total six tankbon collect chapter release series return way school rumble author jin kobayashi special oneshot kaettekita hentai kamen light pervert mask return magazine jump square february oneshot manga title hentai kamen hentai kamen second hentai kamen hentai kamen sekando publish may issue jump square promote liveaction film original manga adapt live action film dvd release liveaction film include original manga tell sidestory film trailer live action film first tease end evangelion set release april hentai kamen use movie manner segment release select theater draw attention unique interesting way remind patron movie direct yichi fukuda know mangabased drama like one pound gospel saru lock cast include ryohei suzuki protagonist kyosuke fumika shimizu lead girl theme song emotion man mission insert theme song blast anthem not make box office mojo list first weekend attain place second third week theatrical run april announce movie gross million yen box office despite small scale show first week earnings ten time well project box office expectation movie originally plan directtodvd release july new york asian film festival announce film audience award winner recipient daniel craft award excellence action cinema second film hentai kamen abnormal crisis release"
}