{
    "title": "en.wikipedia.org_wiki_Ultimate_Exorcist_Kiyoshi",
    "url": "https://en.wikipedia.org/wiki/Ultimate_Exorcist_Kiyoshi",
    "transformers_text": "Ultimate Exorcist Kiyoshi ( Japanese : 悪祓士のキヨシくん , Hepburn : Ekusoshisuto no Kiyoshi-kun ) is a Japanese manga series written and illustrated by Shōichi Usui. It began serialization in Shueisha 's Weekly Shōnen Jump magazine in June 2024, with its chapters collected in six volumes as of November 2025.\n\nAfter losing his parents at the hands of demons at a young age, Kiyoshi Harai set out to become an exorcist capable of protecting many people. The youngest exorcist to graduate from the Exorcist Academy, and valedictorian of his class, Kiyoshi is the strongest exorcist ever. However, even he had a weakness: extreme shyness and introversion. He is assigned to work at the Naraku City Exorcist Association Branch Outpost, inside the Chinese restaurant Gates of Hell, where his life-saving mentor, Sakaki Tenma, is stationed. Alongside his peers, Kiyoshi fights to exorcise demons and become a shield protecting the weak.\n\nWritten and illustrated by Shōichi Usui, the series began serialization in Shueisha 's Weekly Shōnen Jump magazine on June 24, 2024. [ 1 ] As of November 2025, the series' individual chapters have been collected into six tankōbon volumes. [ 2 ]\n\nViz Media and Manga Plus are publishing the series in English simultaneously with its Japanese release. [ 3 ]\n\nThese chapters have yet to be published in a tankōbon volume.\n\nThe series was recommended by manga artist Eiichiro Oda , with whom Usui served as an assistant on One Piece . [ 3 ] It was nominated for the 11th Next Manga Award in the print category in 2025, and was ranked sixteenth. [ 9 ] [ 10 ]",
    "tf_idf_text": "ultimate exorcist kiyoshi japanese hepburn ekusoshisuto kiyoshikun japanese manga series write illustrated shichi usui begin serialization shueisha weekly shnen jump magazine june chapter collect six volume november lose parent hand demon young age kiyoshi harai set become exorcist capable protect many people young exorcist graduate exorcist academy valedictorian class kiyoshi strong exorcist ever however even weakness extreme shyness introversion assign work naraku city exorcist association branch outpost inside chinese restaurant gate hell lifesaving mentor sakaki tenma station alongside peer kiyoshi fight exorcise demon become shield protecting weak write illustrated shichi usui series begin serialization shueisha weekly shnen jump magazine june november series individual chapter collect six tankbon volume viz medium manga plus publishing series english simultaneously japanese release chapter yet publish tankbon volume series recommend manga artist eiichiro oda usui serve assistant one piece nominate next manga award print category rank sixteenth"
}