{
    "title": "en.wikipedia.org_wiki_Jujutsu_Kaisen_Modulo",
    "url": "https://en.wikipedia.org/wiki/Jujutsu_Kaisen_Modulo",
    "transformers_text": "Jujutsu Kaisen Modulo ( Japanese : 呪術廻戦 ≡ , Hepburn : Jujutsu Kaisen Mojuro ) is a Japanese manga series written by Gege Akutami and illustrated by Yūji Iwasaki. It is a sequel to Akutami's manga series Jujutsu Kaisen . The series started in Shueisha 's shōnen manga magazine Weekly Shōnen Jump in September 2025. The story takes place 68 years after the Culling Game events of Jujutsu Kaisen .\n\nGege Akutami and manga artist Yūji Iwasaki started Jujutsu Kaisen Modulo series in Weekly Shōnen Jump on September 8, 2025. Akutami stated that the manga will run for approximately half a year and be about three volumes long, \"as long as [it] is not canceled\". [ 2 ] [ 3 ] Previously hesitant to approve spin-offs over concerns of creative misalignment, Akutami accepted a new proposal that promised to expand the Jujutsu Kaisen narrative through a parallel timeline. This approach offered avenues to enrich the main story's lore or explore different eras without conflict. The concept became the foundation for Jujutsu Kaisen Modulo , which was developed from an initial abstract idea through extensive planning. [ 4 ] Set in 2086, the story takes place 68 years after the main series' Culling Game, and follows the descendants of Yuta Okkotsu and Maki Zen'in . [ 5 ]\n\nWritten by Gege Akutami and illustrated by Yūji Iwasaki, Jujutsu Kaisen Modulo started in Shueisha 's shōnen manga magazine Weekly Shōnen Jump on September 8, 2025. [ 2 ] Viz Media and Shueisha (via Manga Plus ) are publishing the manga digitally in English. [ 6 ] [ 7 ]",
    "tf_idf_text": "jujutsu kaisen modulo japanese hepburn jujutsu kaisen mojuro japanese manga series write gege akutami illustrate yji iwasaki sequel akutamis manga series jujutsu kaisen series start shueisha shnen manga magazine weekly shnen jump september story take place year cull game event jujutsu kaisen gege akutami manga artist yji iwasaki start jujutsu kaisen modulo series weekly shnen jump september akutami state manga run approximately half year three volume long long not cancel previously hesitant approve spinoffs concern creative misalignment akutami accept new proposal promise expand jujutsu kaisen narrative parallel timeline approach offer avenue enrich main story lore explore different era without conflict concept become foundation jujutsu kaisen modulo develop initial abstract idea extensive planning set story take place year main series cull game follow descendant yuta okkotsu maki zenin write gege akutami illustrate yji iwasaki jujutsu kaisen modulo start shueisha shnen manga magazine weekly shnen jump september viz medium shueisha via manga plus publish manga digitally english"
}