{
    "title": "en.wikipedia.org_wiki_Ministry_of_Education,_Culture,_Sports,_Science_0eae85ed1f",
    "url": "https://en.wikipedia.org/wiki/Ministry_of_Education,_Culture,_Sports,_Science_and_Technology",
    "transformers_text": "The Ministry of Education, Culture, Sports, Science and Technology ( 文部科学省 , Monbu-kagaku-shō ; lit. 'Ministry of Letters and Science'; MEXT ) is one of the eleven ministries of Japan that compose part of the executive branch of the government of Japan . [ 1 ] [ 2 ]\n\nThe Meiji government created the first Ministry of Education in 1871. [ 3 ] In January 2001, the former Ministry of Education, Science, Sports and Culture and the former Science and Technology Agency [ ja ] ( 科学技術庁 , Kagaku-gijutsu-chō ) merged to become the present MEXT.\n\nThe Ministry of Education, Culture, Sports, Science and Technology currently is led by the minister of education, culture, sports, science and technology . Under that position is two state ministers, two parliamentary vice-ministers, and administrative vice-minister, and two deputy ministers. Beyond that the organization is divided as follows. [ 2 ]\n\nThe Minister's Secretariat is the department that manages general policies that affect the Ministry of Education, Culture, Sports, Science and Technology as a whole. These functions include many administrative jobs such as auditing policies, community relations, and overall human resource management for domestic and international relations alike.\n\nThe Director-General for International Affairs, according to Ministry of Education, Culture, Sports, Science and Technology's site, is the main point of contact between Japan's National Commission and United Nations Educational Scientific and Cultural Organization (UNESCO). The collective goal of the two organizations is to create mutual, sustainable development through education, science, and culture.\n\nThe Department of Facilities Planning and Disaster Prevention is in charge of focusing on the ability of school facilities to reduce damage caused by disasters such as earthquakes. On top of this, Ministry of Education, Culture, Sports, Science and Technology's site, also describes part of their duties as promoting universities' endeavors in educational and research activities.\n\nThese are the segments of the ministry with focus on the education portions of organization. [ 2 ]\n\nThe Education Policy Bureau as a department upholds the concept of lifelong learning, introduced in the Basic Act on Education. Ministry of Education, Culture, Sports, Science and Technology describes this department's duties as designing educational policy based on comprehensive and objective evidence.\n\nThe Elementary and Secondary Education Bureau is in charge of enhancing the educational development of students progressing through preschool to upper secondary schools, or any equivalent.\n\nThe Ministry of Education, Culture, Sports, Science and Technology describes the Higher Education Bureau as a department that focuses on promoting the education of undergraduate and graduate schools. This includes overseeing permission of grants, teacher quality, as well as the selection and admission of both domestic and abroad students.\n\nThese are the segments of the ministry with focus on the sports and culture portions of organization. [ 2 ]\n\nThe Japan Sports Agency is tasked with the promotion of physical education and health, as well as maintaining the country's ability to compete in international athletics.\n\nThe Japanese Agency for Cultural Affairs tries to create a culture in the country that encourages participation in cultural activities and the arts. Their goal is to achieve a \"Nation Based on Culture and Art\".\n\nThese are the segments of the ministry with focus on the science and technology portions of organization. [ 2 ]\n\nThe Ministry of Education, Culture, Sports, Science and Technology's site regards the duties of the Science and Technology Policy Bureau as the department in charge of the promotion of science and technology in the country. The scope of the department includes students as well as established professionals.\n\nThe Research Promotion Bureau is a department that focuses on development of scientific research, as well as research in fields including technology and physics.\n\nThe Research and Development Bureau is slightly different from the Research Promotion Bureau as this department focuses on social problems including energy and the environment. Consequentially, this department would focus on exploration in space and deep sea.\n\nWhile the Ministry of Education, Culture, Sports, Science and Technology currently contains multiple agencies, primarily a congregation of Education, Culture, Sports, Science and Technology, it actually began as the Ministry of Education. Over the years, Japan separately created each of the agencies that would eventually combine to make the current organization. Nonetheless, each department of the Ministry of Education, Culture, Sports, Science and Technology researches programs and institutions to fund. [ 2 ]\n\nThe Ministry of Education, Culture, Sports, Science and Technology, were able to get their funding increased successfully through the years. They did so with the aid of one of their subgroups, the Japan Society for the Promotion of Science . The additional funds were likely aided in approval due to their source coming from national bonds rather than taxes. The programs, funded by the increased budget, include projects in new materials, molecular-scale surface dynamics, next-generation process technology, computer science , synthesis -based chemical engineering science, micro-mechatronics ( micromachinery ), biotechnology , human genome research, cell signaling , bioinformatics , brain research , Structural biology , life sciences , developmental biology , and biomedical engineering . [ 4 ]\n\nMEXT is one of three ministries that run the JET Programme . It also offers the Monbukagakusho Scholarship , also known as the MEXT or Monbu-shō scholarship. The Ministry sets standards for the romanization of Japanese . [ 5 ]\n\nIn cooperation with the Japanese Student Services Organization (JASSO), the ministry further funds the prestigious JASSO scholarship for international students which has been described as the \"Japanese Fulbright program\". [ 6 ] [ 7 ] It offers financial support of up to ¥80,000 per month for the top 1% of students of any foreign country for studies at a Japanese university. [ 6 ]\n\nMEXT provides the Children Living Abroad and Returnees Internet (CLARINET) which provides information to Japanese families living abroad. [ 8 ]\n\nMEXT sends teachers around the world to serve in nihonjin gakkō , full-time Japanese international schools in foreign countries. [ 9 ] The Japanese government also sends full-time teachers to hoshū jugyō kō supplementary schools that offer lessons that are similar to those of nihonjin gakkō or those which each have student bodies of 100 students or greater. [ 10 ] In addition, MEXT subsidizes weekend schools which each have over 100 students. [ 11 ]\n\nJapanese Government MEXT scholarship 2022 Japanese Government MEXT Scholarship 2021 Embassy Recommendation. The scholarship programs are for students who wish to study in Japan as Research Student (Masters/Ph.D./ Research), Undergraduate student, College of Technology student, or Specialized Training student. [ 12 ]",
    "tf_idf_text": "ministry education culture sport science technology monbukagakush light ministry letter science mext one eleven ministries japan compose part executive branch government japan meiji government create first ministry education january former ministry education science sport culture former science technology agency kagakugijutsuch merge become present mext ministry education culture sport science technology currently lead minister education culture sport science technology position two state minister two parliamentary viceministers administrative viceminister two deputy minister beyond organization divide follow minister secretariat department manage general policy affect ministry education culture sport science technology whole function include many administrative job audit policy community relation overall human resource management domestic international relation alike directorgeneral international affair accord ministry education culture sport science technology site main point contact japan national commission unite nation educational scientific cultural organization unesco collective goal two organization create mutual sustainable development education science culture department facility plan disaster prevention charge focus ability school facility reduce damage cause disaster earthquakes top ministry education culture sport science technology site also describe part duty promote university endeavor educational research activity segment ministry focus education portion organization education policy bureau department upholds concept lifelong learn introduce basic act education ministry education culture sport science technology describe department duty design educational policy base comprehensive objective evidence elementary secondary education bureau charge enhance educational development student progress preschool upper secondary school equivalent ministry education culture sport science technology describe high education bureau department focus promote education undergraduate graduate school include oversee permission grant teacher quality well selection admission domestic abroad student segment ministry focus sport culture portion organization japan sport agency task promotion physical education health well maintain country ability compete international athletics japanese agency cultural affair try create culture country encourage participation cultural activity art goal achieve nation base culture art segment ministry focus science technology portion organization ministry education culture sport science technology site regard duty science technology policy bureau department charge promotion science technology country scope department include student well establish professional research promotion bureau department focus development scientific research well research field include technology physic research development bureau slightly different research promotion bureau department focus social problem include energy environment consequentially department would focus exploration space deep sea ministry education culture sport science technology currently contain multiple agency primarily congregation education culture sport science technology actually begin ministry education year japan separately create agency would eventually combine make current organization nonetheless department ministry education culture sport science technology research program institution fund ministry education culture sport science technology able get funding increase successfully year aid one subgroup japan society promotion science additional fund likely aid approval due source come national bond rather tax program fund increased budget include project new material molecularscale surface dynamic nextgeneration process technology computer science synthesis base chemical engineering science micromechatronics micromachinery biotechnology human genome research cell signal bioinformatics brain research structural biology life science developmental biology biomedical engineering mext one three ministry run jet programme also offer monbukagakusho scholarship also know mext monbush scholarship ministry set standard romanization japanese cooperation japanese student service organization jasso ministry fund prestigious jasso scholarship international student describe japanese fulbright program offer financial support per month top student foreign country study japanese university mext provide child live abroad returnees internet clarinet provide information japanese family live abroad mext sends teacher around world serve nihonjin gakk fulltime japanese international school foreign country japanese government also send fulltime teacher hosh jugy supplementary school offer lesson similar nihonjin gakk student body student great addition mext subsidize weekend school student japanese government mext scholarship japanese government mext scholarship embassy recommendation scholarship program student wish study japan research student mastersphd research undergraduate student college technology student specialize training student"
}