{
    "title": "en.wikipedia.org_wiki_Tony_Tony_Chopper",
    "url": "https://en.wikipedia.org/wiki/Tony_Tony_Chopper",
    "transformers_text": "Tony Tony Chopper ( トニートニー・チョッパー , Tonī Tonī Choppā ) , otherwise known as \" Cotton Candy Lover \", is a fictional character in the manga series and media franchise One Piece created by Eiichiro Oda . The character made his first appearance in the 134th chapter of the series, which was first published in Japan in Shueisha 's Weekly Shōnen Jump magazine on May 8, 2000. He is the sixth member of the Straw Hat Pirates and the fifth to join, serving as their doctor. Chopper is frequently featured on official merchandise, serving as a mascot for the series.\n\nThe power of the Zoan-type Human-Human Fruit ( ヒトヒトの実 , Hito Hito no Mi ) provides him with the ability to transform into a full-sized reindeer or a reindeer-human hybrid. [ ch. 140 ] A drug he calls \"Rumble Ball\" ( ランブル・ボール , Ranburu Bōru ) enables him to perform even more transformations for a short time. [ ch. 149 ] [ ch. 1014 ]\n\nRejected by his herd because of his blue nose and eating the Devil Fruit, Chopper is rescued by Drum Island's quack doctor Doctor Hiriluk. While developing a potion to create cherry blossoms when in contact with snow, Chopper is heartbroken when Hiriluk falls ill with a deadly disease. After Hiriluk's death, Doctor Kureha takes him in as his mentor. After the Straw Hats arrive at Drum Island and take Chopper with them, Kureha uses Hiriluk's potion to turn the snowy sky into cherry blossoms, fulfilling Hiriluk's life mission. When complimented, Chopper acts flustered and sometimes yells at the person who complimented him to stop trying to make him happy. [ ch. 140 ] A running gag within the series is when other characters mistake him as a Tanuki , and he angrily corrects them, pointing out that he is a Tonakai (Japanese for \"Reindeer\").\n\nWith Chopper's back story, Oda wanted to illustrate that one need not be blood-related to be considered family. [ 5 ] [ 6 ] [ 7 ] When asked by a fan what the nationalities of the members of the Straw Hat Pirates would be if One Piece was set in the real world , Oda replied that Chopper would be Canadian . [ 8 ]\n\nChopper is initially ostracized as a monster. Chopper is very naïve, and has a tendency to believe anything told to him, even the outrageously fictitious, exaggerated lies of Usopp . Chopper loves to be complimented and is incapable of hiding his feelings. After the time-skip he embraces his status because he wants to be a \"monster for Luffy.\"\n\nThe power of the Zoan-type Human-Human Fruit ( ヒトヒトの実 , Hito Hito no Mi ) provides Tony Tony Chopper with the ability to transform into three forms: a humanoid being, human-reindeer hybrid or his default reindeer form. [ ch. 140 ] In addition to his normal transformations, Chopper developed a drug he calls the Rumble Ball ( ランブル・ボール , Ranburu Bōru ) , having the shape of round yellow pills, which allows him four additional transformations to use temporarily. [ 9 ] Although the primary effects of the rumble ball only last three minutes, [ ch. 149 ] Chopper cannot consume a second ball for six hours without adverse effects, mainly the loss of control over his transformations during the three minutes of his second Rumble Ball. [ ch. 406 ] If Chopper consumes three Rumble Balls within six hours, he grows to monstrous proportions and loses all self control and consciousness. [ ch. 407 ] This form, known as Monster Point, is extremely powerful, but also has the adverse effect of draining Chopper's life force. After the two-year timeskip Chopper is able to transform into six forms without a rumble ball and can use a rumble ball to control his Monster Point. [ ch. 645 ] [ ch. 646 ] Later with the help of their enemy and temporary prisoner Caesar Clown, Chopper was able to improve the formula and lengthen the effects of the Rumble Ball ten-fold to thirty minutes at a time, [ ch. 1014 ] albeit with new side-effects of Chopper temporarily shrinking down to an infant-like form, known as Baby Geezer, with antiqued speech. [ ch. 1017 ]\n\nSince Chopper is an animal who ate the Human-Human Fruit, he can converse with other animals and humans alike. [ ch. 154 ]\n\nIn the original Japanese anime of One Piece , Tony Tony Chopper's main voice actress is Ikue Ōtani . [ 10 ] Kazue Ikura voiced Tony Tony Chopper for episodes 254–263. [ 11 ] Brina Palencia voices Chopper in the English Funimation dub. Lisa Ortiz voiced him in the 4Kids Entertainment English dub. Emlyn Morinelli voices Chopper in Singapore 's Odex dub. He is voiced by american actress Mikaela Hoover in the second season of the live-action adaptation , set to be released in 2026. [ 12 ]\n\nChopper grew up on the winter island Drum, where he was an outcast among reindeer due to his blue nose. He ate the Human-Human Fruit ( ヒトヒトの実 , Hito Hito no Mi ) , giving him the ability to speak, think, and transform into a human. This ability further alienated him from the other reindeer, and he was rejected by the herd. He grew up an outcast until taken in by the fake doctor Hiriluk, a former thief, who accepts Chopper as his son and instills within him his initial passion for medicine. After Hiriluk's death, Chopper becomes Dr. Kureha's assistant and learns her medical knowledge.\n\nLuffy tries \"to convince Chopper to join the crew as the ship's Doctor\". A frightened Chopper continues to give Luffy the slip and later explains he can't be part of the crew because he is a monster. Luffy tells Chopper to shut up and come with them regardless, which moves Chopper to tears as he has finally found real friends, people who aren't afraid of him. [ 13 ]\n\nChopper is the doctor of the crew and has outstanding knowledge of medicine and medical drugs, as well as the preparation of remedies and ointments from regular fruits, roots and vegetables found on most islands. Most of this he learned during his apprenticeship under Dr. Kureha or from his time at the Birdie Kingdom.\n\nChopper stands at a height of 90 centimetres (2 ft 11 in) and weighs 20 kg (44 lb) in his Brain Point form. He possesses extraordinary genius-level intelligence, excelling in medicine, surgery, and pharmacology. His power ranking is classified as Class A, with attack potency ranging from Large Building to City Block level. His speed varies from Supersonic+ to Hypersonic+, and his lifting strength is rated between Class 5 and Class M. In battle, Chopper is an expert fighter who leverages his transformative abilities to gain advantages. He has enhanced stamina at an exceptional human level and durability comparable to City Block level. However, his primary weakness is that he becomes immobilized if more than half of his body is submerged in water. [ 14 ]\n\nChopper found a genuine feeling of family after joining the Straw Hats, where his friends encourage him as a person and as a doctor. He treats injuries and illnesses and creates antidotes in emergency situations because of his medical knowledge and charming demeanor, which makes him a vital member of the crew. During the Punk Hazard arc, one of his greatest accomplishments was developing an antidote to protect youngsters Caesar Clown experimented on. [ 15 ]\n\nChopper has appeared in other media besides the manga and its television anime adaptation. He is featured in most of the One Piece films starting with Movie 3: Chopper's Kingdom of Strange Animal Island , where he is the main character. He is also the main character in the ninth movie, which is a retelling of the storyline during which he was introduced.\n\nChopper has appeared in many One Piece licensed electronic video games. Though in the game, One Piece: Grand Battle he is not labeled as a Straw Hat character, and has no alliance in the game. Though like the rest of the Straw Hat's, he has unlockable costumes outside of his alternate colors. In One Piece: Grand Adventure he is aligned with the Straw Hats. He is also a support character in Jump Super Stars . In 2006, he is featured in the Dragon Ball / One Piece / Naruto crossover game Battle Stadium D.O.N. as a playable character.\n\nChopper was seen in Bokusatsu Tenshi Dokuro-chan when Sakura mentions \"reindeer who are doctors\" and other things from anime, while he was freaking out in a forest. He also appears twice in the Webcomic VG Cats . Chopper and other characters also appeared in Cross Epoch , a crossover between One Piece and Dragon Ball Z .\n\nThere have been various pieces of merchandise released for Chopper over the years. Various plush figures have been based on him, including many season based ones, [ 16 ] [ 17 ] as well as an assortment of others. [ 18 ] There have also been many figures released of Chopper. [ 19 ] [ 20 ] [ 21 ] Additionally, there have been many other pieces of merchandise based on Chopper such as cushions, [ 22 ] clothing, [ 23 ] towels, [ 24 ] key chains, [ 25 ] and clocks. [ 26 ]\n\nSean Cubillas of Screen Rant ranked Chopper third on a top ten list of the most adorable anthropomorphic anime animals, writing, \"It makes sense that the best-selling manga of all time would also have one of the cutest, talking animal characters of all time. Though berated by humans as a monster and even as an outcast by other reindeer, Tony Tony Chopper hasn't become anything less than a friendly, welcome face for all the fans. It also helps that there's just a lot of One Piece merch centered around him.\" [ 27 ] In a review, Cubillas writes \"Tony Tony Chopper on design alone is already plenty iconic. He's meant to be the mascot for the series and after seeing all of the One Piece merch with his face on it, he's done a pretty good job. The scene to define him, however, comes in his backstory. After tragically losing Dr. Hiluluk to a political assassination, his own poison mushroom soup, and an undisclosed terminal illness, Chopper runs to Dr. Kureha's office waving Hiluluk's pirate flag. He begs the old woman to teach him, proclaiming that he wants to be a doctor that can cure any disease.\" [ 28 ]\n\nIn another article, Cubillas uniquely gave Chopper two entries in his ranking of the series top ten running gags, noting \"Part of the Cowardly Trio, Chopper is as up for a fight as Usopp with an actual illness. Unfortunately for him, he can't quite hide away … it's easy to understand why most characters who see him for the first time tend to think that he's a tanuki (or a raccoon dog). While Chopper has some kinship with other animals, he certainly doesn't like being mislabeled, particularly when this denotes him as the Straw Hat's pet and not as the talented doctor that he truly is.\" [ 29 ]\n\nAn IGN review of the manga praised Chopper's character as one of the best in the series and said that he was able to be both touching and funny. [ 30 ]\n\nHowever, Chopper's status as a mascot met with criticism by both fans and critics, who view him as too stereotypical and insufficiently developed compared to the other Straw Hats. Dyler Crews wrote, \"Even before Pikachu solidified the concept of a manga and anime franchise having an adorable mascot in the '90s, the trope was already old hat. Looking to cash in on merchandising, Oda simplified Tony Tony Chopper's design to make the character resemble a plush toy. Although Oda didn't relegate Chopper to mascot status only, giving the character an essential job within the crew, Chopper's utility in the story has diminished as his marketability grew,Chopper is now often used for jokes or cute moments instead of playing a central role as the crew's doctor in important storylines [1] .Having the voice actor behind Pikachu didn't help either. [ 31 ]\n\nChopper ranked in the top ten during the second through seventh popularity polls. Chopper was the fourth most popular character in the second, third, and fourth Japanese popularity polls. He was ranked the seventh most popular character in the fifth and sixth Japanese popularity poll. In the first worldwide popularity poll, Chopper was ranked the sixteenth most-favorite character. [ 32 ] [ 33 ] [ 34 ] [ 35 ] [ 36 ] [ 37 ] [ 38 ]\n\nThe denouement of Chopper's introduction arc was rated the ninth most heartbreaking scene in One Piece, and Chopper was involved in half of the top ten most heartbreaking scenes in the manga: the Going Merry's funeral, Robin saying she wants to live, the Straw Hats' departure, the Going Merry rescuing the Straw Hats, and the aforementioned denouement, when Kureha fulfills Hiriluk's dying wish by making Drum \"bloom\" like a Sakura tree. [ 39 ] Jamie Lee Curtis said Chopper was her favorite character and that she was interested in playing Kureha, Chopper's mentor, in the live-action adaptation , [ 40 ] although she ultimately did not play the character due to scheduling conflicts. [ 41 ]",
    "tf_idf_text": "tony tony chopper ton ton chopp otherwise know cotton candy lover fictional character manga series medium franchise one piece create eiichiro oda character make first appearance chapter series first publish japan shueisha weekly shnen jump magazine may sixth member straw hat pirate fifth join serve doctor chopper frequently feature official merchandise serve mascot series power zoantype humanhuman fruit hito hito provide ability transform fullsized reindeer reindeerhuman hybrid drug call rumble ball ranburu bru enable perform even transformation short time reject herd blue nose eat devil fruit chopper rescue drum island quack doctor doctor hiriluk develop potion create cherry blossom contact snow chopper heartbroken hiriluk fall ill deadly disease hiriluks death doctor kureha take mentor straw hat arrive drum island take chopper kureha use hiriluks potion turn snowy sky cherry blossom fulfil hiriluks life mission compliment chopper act fluster sometimes yell person compliment stop try make happy run gag within series character mistake tanuki angrily correct point tonakai japanese reindeer chopper back story oda want illustrate one need not bloodrelated consider family ask fan nationality member straw hat pirate would one piece set real world oda reply chopper would canadian chopper initially ostracize monster chopper nave tendency believe anything tell even outrageously fictitious exaggerated lie usopp chopper love compliment incapable hiding feeling timeskip embrace status want monster luffy power zoantype humanhuman fruit hito hito provide tony tony chopper ability transform three form humanoid humanreindeer hybrid default reindeer form addition normal transformation chopper develop drug call rumble ball ranburu bru shape round yellow pill allow four additional transformation use temporarily although primary effect rumble ball last three minute chopper cannot consume second ball six hour without adverse effect mainly loss control transformation three minute second rumble ball chopper consumes three rumble ball within six hour grow monstrous proportion lose self control consciousness form know monster point extremely powerful also adverse effect drain chopper life force twoyear timeskip chopper able transform six form without rumble ball use rumble ball control monster point later help enemy temporary prisoner caesar clown chopper able improve formula lengthen effect rumble ball tenfold thirty minute time albeit new sideeffects chopper temporarily shrink infantlike form know baby geezer antique speech since chopper animal ate humanhuman fruit converse animal human alike original japanese anime one piece tony tony chopper main voice actress ikue tani kazue ikura voice tony tony chopper episode brina palencia voice chopper english funimation dub lisa ortiz voice kid entertainment english dub emlyn morinelli voice chopper singapore odex dub voice american actress mikaela hoover second season liveaction adaptation set release chopper grow winter island drum outcast among reindeer due blue nose ate humanhuman fruit hito hito give ability speak think transform human ability alienate reindeer reject herd grow outcast take fake doctor hiriluk former thief accepts chopper son instills within initial passion medicine hiriluks death chopper become kurehas assistant learn medical knowledge luffy try convince chopper join crew ship doctor frighten chopper continue give luffy slip later explain cant part crew monster luffy tell chopper shut come regardless move chopper tear finally find real friend people arent afraid chopper doctor crew outstanding knowledge medicine medical drug well preparation remedy ointments regular fruit root vegetable find island learned apprenticeship kureha time birdie kingdom chopper stand height centimetre weigh brain point form possess extraordinary geniuslevel intelligence excel medicine surgery pharmacology power rank classified class attack potency range large build city block level speed vary supersonic hypersonic lift strength rat class class battle chopper expert fighter leverage transformative ability gain advantage enhance stamina exceptional human level durability comparable city block level however primary weakness become immobilized half body submerge water chopper find genuine feeling family join straw hat friends encourage person doctor treat injury illnesses creates antidote emergency situation medical knowledge charm demeanor make vital member crew punk hazard arc one great accomplishment develop antidote protect youngster caesar clown experiment chopper appear medium besides manga television anime adaptation feature one piece film start movie chopper kingdom strange animal island main character also main character ninth movie retell storyline introduce chopper appear many one piece license electronic video game though game one piece grand battle not label straw hat character alliance game though like rest straw hat unlockable costume outside alternate color one piece grand adventure align straw hat also support character jump super star feature dragon ball one piece naruto crossover game battle stadium playable character chopper see bokusatsu tenshi dokurochan sakura mention reindeer doctor thing anime freak forest also appear twice webcomic cat chopper character also appear cross epoch crossover one piece dragon ball various piece merchandise release chopper year various plush figure base include many season base one well assortment others also many figure release chopper additionally many piece merchandise base chopper cushion clothe towel key chain clock sean cubillas screen rant rank chopper third top ten list adorable anthropomorphic anime animal write make sense bestselling manga time would also one cutest talk animal character time though berated human monster even outcast reindeer tony tony chopper hasnt become anything less friendly welcome face fan also help there lot one piece merch center around review cubillas write tony tony chopper design alone already plenty iconic he mean mascot series see one piece merch face hes do pretty good job scene define however come backstory tragically lose hiluluk political assassination poison mushroom soup undisclosed terminal illness chopper run kurehas office wave hiluluks pirate flag beg old woman teach proclaim want doctor cure disease another article cubillas uniquely give chopper two entry rank series top ten run gag note part cowardly trio chopper fight usopp actual illness unfortunately cant quite hide away easy understand character see first time tend think he tanuki raccoon dog chopper kinship animal certainly doesnt like mislabeled particularly denotes straw hat pet not talented doctor truly ign review manga praise chopper character one best series say able touch funny however chopper status mascot meet criticism fan critic view stereotypical insufficiently develop compare straw hat dyler crew write even pikachu solidify concept manga anime franchise adorable mascot trope already old hat look cash merchandising oda simplify tony tony chopper design make character resemble plush toy although oda didnt relegate chopper mascot status give character essential job within crew chopper utility story diminish marketability grewchopper often use joke cute moment instead play central role crew doctor important storyline voice actor behind pikachu didnt help either chopper rank top ten second seventh popularity poll chopper fourth popular character second third fourth japanese popularity poll rank seventh popular character fifth sixth japanese popularity poll first worldwide popularity poll chopper rank sixteenth mostfavorite character denouement chopper introduction arc rat ninth heartbreaking scene one piece chopper involve half top ten heartbreaking scene manga go merrys funeral robin say want live straw hat departure go merry rescue straw hat aforementioned denouement kureha fulfills hiriluks die wish make drum bloom like sakura tree jamie lee curtis say chopper favorite character interested playing kureha chopper mentor liveaction adaptation although ultimately not play character due scheduling conflict"
}