{
    "title": "en.wikipedia.org_wiki_Takarajimasha",
    "url": "https://en.wikipedia.org/wiki/Takarajimasha",
    "transformers_text": "Takarajimasha, Inc. ( Japanese : 株式会社宝島社 , Hepburn : Kabushiki Gaisha Takarajimasha ) is a Japanese publishing company based in Chiyoda , Tokyo . It is known for publishing subculture -oriented fashion magazines aimed at teens, [ 4 ] [ 5 ] fashion magazines in general, as well as guide books .\n\nThe company was founded on September 22, 1971 as a consulting business of local government titled JICC, Inc. ( 株式会社ジェー・アイ・シー・シー ) and a successor of the former Takarajima Photo Chemicals Co., Ltd. that was founded in 1918. [ 6 ] Established by some Waseda University former revolutionary students, in May 1974 it started to publish its first magazine, Takarajima , a Japanese subculture focused magazine, [ 4 ] [ 7 ] which was followed by Bessatsu Takarajima in March 1976. [ 6 ] Kono Mystery ga Sugoi! , a guide book magazine, was first published in December 1989, [ 6 ] while fashion magazine Cutie [ 5 ] was first published in September 1989. [ 6 ] On April 1, 1993, its name changed to Takarajimasha. [ 6 ] Smart , Spring , and Sweet , all young-targeted fashion magazines, [ 5 ] [ 8 ] are published since October 1995, February 1996, and March 1999 respectively. [ 6 ] Takarajimasha is also known for creating in 2005 the concept of \"brand mook\", a mook [ note 1 ] featuring a catalogue of new items of a brand and limited edition product of this brand. [ 8 ]",
    "tf_idf_text": "takarajimasha inc japanese hepburn kabushiki gaisha takarajimasha japanese publish company base chiyoda tokyo know publishing subculture orient fashion magazine aim teens fashion magazine general well guide book company found september consulting business local government title jicc inc successor former takarajima photo chemical ltd found establish waseda university former revolutionary student may start publish first magazine takarajima japanese subculture focus magazine follow bessatsu takarajima march kono mystery sugoi guide book magazine first publish december fashion magazine cutie first publish september april name change takarajimasha smart spring sweet youngtargeted fashion magazine publish since october february march respectively takarajimasha also know create concept brand mook mook note feature catalogue new item brand limited edition product brand"
}