{
    "title": "en.wikipedia.org_wiki_Tokyo_Tower",
    "url": "https://en.wikipedia.org/wiki/Tokyo_Tower",
    "transformers_text": "Tokyo Tower ( 東京タワー , Tōkyō Tawā ; pronounced [toːkʲoː taꜜɰᵝaː] ⓘ ) , a.k.a. Japan Radio Tower ( 日本電波塔 , Nippon denpatō ) is a communications and observation tower in the district of Shiba-koen in Minato, Tokyo , Japan, completed in 1958. At 332.9 m (1,092 ft), it was the tallest tower in Japan until the construction of Tokyo Skytree in 2012. It is a lattice tower inspired by the Eiffel Tower , and is painted white and international orange to comply with air safety regulations.\n\nThe tower's main sources of income are tourism and antenna leasing. FootTown, a four-story building directly under the tower, houses museums, restaurants, and shops. Departing from there, guests can visit two observation decks. The two-story Main Deck (formerly known as the Main Observatory) is at 150 m (490 ft), while the smaller Top Deck (formerly known as the \"Special Observatory\") reaches a height of 249.6 m (819 ft). The names were changed following renovation of the top deck in 2018. [ 4 ] The tower is repainted every five years, taking a year to complete the process.\n\nIn 1961, transmission antennae were added. They are used for radio and television broadcasting and now broadcast signals for media outlets such as NHK , TBS Television , and Fuji Television . The height of the tower was not suitable for Japan's planned terrestrial digital broadcasting planned for July 2011, and for the Tokyo area. A taller digital broadcasting tower, known as Tokyo Skytree , was completed on 29 February 2012. Tokyo Tower has become a prominent landmark and frequently appears in media set in Tokyo.\n\nA large broadcasting tower was needed in the Kantō region after NHK , Japan's public broadcasting station, began television broadcasting in 1953. Private broadcasting companies began operating in the months following the construction of NHK's own transmission tower. This communications boom led the Japanese government to believe that transmission towers would soon be built all over Tokyo, eventually overrunning the city. The proposed solution was the construction of one large tower capable of transmitting to the entire region. [ 5 ] Furthermore, because of the country's postwar boom in the 1950s, Japan was searching for a monument to symbolize its national recovery from World War II , as one of the countries most ravaged by the war. [ 6 ] [ 7 ]\n\nHisakichi Maeda, founder and president of Nippon Denpatō, the tower's owner and operator, originally planned for the tower to be taller than the Empire State Building , which at 381 m (1,250 ft) was the highest structure in the world at the time. However, the plan fell through because of the lack of both funds and materials. The tower's height was eventually determined by the distance the TV stations needed to transmit throughout the Kantō region, a distance of about 150 km (93 mi). [ 5 ]\n\nTachū Naitō , designer of tall buildings in Japan, was chosen to design the newly proposed tower. [ 5 ] Looking to the Western world for inspiration, Naitō based his design on the Eiffel Tower in Paris, France. [ 8 ] With the help of engineering company Nikken Sekkei Ltd., Naitō claimed his design could withstand earthquakes with twice the intensity of the 1923 Great Kantō earthquake or typhoons with wind speeds of up to 220 km/h (140 mph). [ 5 ]\n\nThe new construction project attracted hundreds of tobi ( 鳶 ), traditional Japanese construction workers who specialized in the construction of high-rise structures. The Takenaka Corporation broke ground in June 1957 and each day at least 400 laborers worked on the tower. [ 5 ] It was constructed of steel , a third of which was scrap metal taken from US tanks damaged in the Korean War . [ 9 ] [ 10 ] When the 90 m (300 ft)-long antenna was bolted into place on 14 October 1958, Tokyo Tower was the tallest freestanding tower in the world, taking the title from the Eiffel Tower by 9 m (30 ft). [ 11 ] [ failed verification ]\n\nThough it is taller than the Eiffel Tower, Tokyo Tower weighs about 4,000 tons, 3,300 less than the Eiffel Tower [ 12 ] as it is significantly thinner and simpler in construction. It was opened to the public on 23 December 1958 at a final cost of ¥ 2.8 billion ($8.4 million in 1958). [ 10 ] [ 13 ] Tokyo Tower was mortgaged for ¥10 billion in 2000. [ 14 ] It was the tallest artificial structure in Japan until April 2012, when it was surpassed by the Tokyo Skytree . [ 8 ]\n\nPlanned as an antenna for telecommunications and brightly colored in accordance with the time's Aviation Law, the tower's two panoramic observatories are mostly frequented by tourists today. The tower constitutes a clear reference point in the center's skyline, forming a strong landmark, both night and day. [ 15 ] Every five years, the tower is repainted in a process that takes about a year to complete. Tokyo Tower is next planned to be repainted in 2024. [ 16 ] [ 17 ] [ needs update ]\n\nTokyo Tower's two main revenue sources are antenna leasing and tourism. It functions as a radio and television broadcasting antenna support structure and is a tourist destination that houses several different attractions. The tower recorded its 190 millionth visitor in 2024. [ 18 ] Visitor numbers had been steadily declining, bottoming out at 2.3 million in 2000 [ 19 ] before rising since then. [ 7 ]\n\nThe first area tourists visit upon reaching the tower is FootTown, a four-story building stationed directly under the tower. There, visitors can eat, shop, and visit several museums and galleries. Elevators that depart from the first floor of FootTown can be used to reach the first of two observation decks, the two-story Main Observatory. [ 20 ] For the price of another ticket, visitors can board another set of elevators from the second floor of the Main Observatory to reach the final observation deck—the Special Observatory. [ 21 ]\n\nTokyo Tower, a member of the World Federation of Great Towers, has been used by many organizations for broadcasting purposes. The structure was intended for broadcasting television, but radio antennas were installed in 1961 because it could accommodate them. [ 7 ] While analog and digital television broadcasts are no longer conducted from the site, two FM radio stations remain on Tokyo Tower. Stations that use or have used the tower's antenna include: [ 12 ]\n\nJapan employs both analog and digital broadcasting. In July 2011 all television broadcasting was changed to solely digital. Tokyo Tower is not a reliable broadcasting antenna for completely digital broadcasting because the tower is not tall enough to transmit the higher frequency waves to areas surrounded by forests or high-rise buildings. As an alternative, a new 634 m-tall (2,080 ft) tower called the Tokyo Skytree was opened in 2012. [ 7 ] In an attempt to make Tokyo Tower more appealing to NHK and the five other commercial broadcasters who planned to move their transmitting stations to the new tower, Nihon Denpatō officials drafted a plan to extend its digital broadcasting antenna by 80 to 100 m (260 to 330 ft) at a cost of approximately ¥4 billion (US$50 million). [ 22 ]\n\nAs a result of their move to the Skytree, only one digital television station remained on Tokyo Tower: that of the Open University of Japan , whose JOUD-DTV and JOUD-FM continued on the tower until shutting down in 2018. FM radio stations will continue to use the tower for broadcasting in the Tokyo area. Masahiro Kawada, the tower's planning director, raised the possibility of the tower becoming a backup for the Tokyo Skytree, depending on what the TV broadcasters want or need. [ 7 ] [ 23 ]\n\nThe antenna's tip was damaged on 11 March 2011 by the Tōhoku earthquake . [ 24 ] On 19 July 2012, Tokyo Tower's height shrank to 315 meters while the top antenna was repaired for damage from the earthquake. [ 2 ]\n\nLocated in the base of the tower is a 4-story building known as FootTown. The first floor includes the Aquarium Gallery, a reception hall, the 400-person-capacity \"Tower Restaurant\", a FamilyMart convenience store and a souvenir shop. [ 25 ] [ 26 ] This floor's main attractions, however, are the three elevators that serve as a direct ride to the Main Observatory. [ 20 ] The second floor is primarily a food and shopping area. In addition to the five standalone restaurants, the second floor's food court consists of four restaurants, including a McDonald's and a Pizza-La . [ 27 ] [ 28 ]\n\nFootTown's third and fourth floors house several tourist attractions. The third floor is home to the Guinness World Records Museum Tokyo, a museum that houses life-size figures, photo panels and memorabilia depicting interesting records that have been authenticated by the Guinness Book. [ 29 ] The Tokyo Tower Wax Museum, opened in 1970, displayed wax figures imported from London where they were made [ 30 ] until it was closed in 2013. [ 31 ]\n\nThe figures on display range from pop culture icons such as The Beatles to religious figures such as Jesus Christ . A hologram gallery named the Gallery DeLux, a lounge and a few specialty stores are also located on this floor. [ 32 ] Tokyo Tower's Trick Art Gallery is located on the building's fourth and final floor. This gallery displays optical illusions , including paintings and objects that visitors can interact with. [ 33 ]\n\nOn the roof of the FootTown building is a small amusement park that contains several small rides and hosts live performances for children. [ 34 ] On weekends and holidays, visitors can use the roof to access the tower's outside stairwell. At approximately 660 steps, the stairwell is an alternative to the tower's elevators and leads directly to the Main Observatory. [ 35 ]\n\nBased on the hit manga and anime One Piece , Tokyo Tower featured a small One Piece themed amusement park that opened in 2015 and closed in 2020. The amusement park offered a range of attractions, shops, and restaurants, all based on the characters from Eiichiro Oda 's manga. Patrons enjoyed various games or attractions based on their favorite characters and enjoyed meals from the world of One Piece . There was a gift store that features exclusive goods for One Piece fans. [ 36 ] [ 37 ]\n\nTokyo Tower requires 28,000 L (7,400 US gal) of paint to completely paint the structure white and international orange , complying with air safety regulations. [ 12 ] Before the tower's 30th anniversary in 1987, the only lighting on the tower were light bulbs located on the corner contours that extended from the base to the antenna. In the spring of 1987, Nihon Denpatō invited lighting designer Motoko Ishii to visit the tower. Since its opening 30 years earlier, the tower's annual ticket sales had dropped significantly, and in a bid to revitalize the tower and again establish it as an important tourist attraction and symbol of Tokyo, Ishii was hired to redesign Tokyo Tower's lighting arrangement. [ 38 ]\n\nUnveiled in 1989, the new lighting arrangement required the removal of the contour-outlining light bulbs and the installation of 176 floodlights in and around the tower's frame. [ 38 ] From dusk to midnight, the floodlights illuminate the entire tower. [ 12 ] Sodium vapor lamps are used from 2 October to 6 July to cover the tower in an orange color. From 7 July to 1 October, the lights are changed to metal halide lamps to illuminate the tower with a white color. The reasoning behind the change is a seasonal one. Ishii reasoned that orange is a warmer color and helps to offset the cold winter months. Conversely, white is thought a cool color that helps during the hot summer months. [ 39 ]\n\nOccasionally, Tokyo Tower's lighting is changed to specific arrangements for special events. The tower is specially lit for some annual events. Since 2000, the entire tower has been illuminated in a pink light on 1 October to highlight the beginning of National Breast Cancer Awareness Month . The tower has also had a variety of special lighting arrangements for Christmas since 1994. During New Year's Eve , the tower lights up at midnight with a year number displayed on one side of the observatory to mark the arrival of the new year. [ 39 ]\n\nSpecial Japanese events have been cause to light the tower in several non-traditional ways. In 2002, alternating sections of the tower were lit blue to help celebrate the opening of the FIFA World Cup in Japan. Alternating sections of the tower were lit green on Saint Patrick's Day in 2007 to commemorate the 50th anniversary of Japanese–Irish relations. On a few occasions, Tokyo Tower has even been specially lit to correspond with corporate events. For example, the top half of the tower was lit green to correspond with the Japanese premiere of The Matrix Reloaded and different sections of the tower were lit red, white and black to commemorate the first day of sales of Coca-Cola C2 . [ 39 ] In the summer of 2021, the tower was lit up in Olympic colours to celebrate the 2020 Summer Olympics and 2020 Summer Paralympics in Tokyo, both of which had been delayed a year due to the COVID-19 pandemic . [ 40 ] On November 18, 2021, the tower was lit up at 17:17 in the red of Major League Baseball 's Los Angeles Angels following the awarding of the American League MVP to two-way player Shohei Ohtani . [ 41 ]\n\nThe tower was lit for the new millennium in 2000 with Motoko Ishii again reprising her role as the designer. [ 42 ] In December 2008, Nihon Denpatō spent $6.5 million to create a new night-time illumination scheme—titled the \"Diamond Veil\"—to celebrate the tower's 50th anniversary. The arrangement featured 276 lights in seven colors equally distributed across the towers four faces. [ 10 ]\n\nWhen employing specialty lighting on the tower, the Main Observatory often plays an important role. During the second international \" White Band Day\" on 10 September 2005, the tower was completely unlit except for the Main Observatory, which was lit with a bright white light. The resulting white ring represented the White Band referenced in the day's name. The two floors of windows that make up the exterior of the Main Observatory are utilized to display words or numbers. When the tower employed lighting to commemorate terrestrial digital broadcasting first being available in the Kantō region on 1 December 2005, each side of the Main Observatory displayed the characters 地デジ ( chi deji , an abbreviation for 地上デジタル放送 chijō dejitaru hōsō terrestrial digital broadcasting). [ 39 ] More recently, the observatory displayed both \"TOKYO\" and \"2016\" to stress Tokyo's 2016 Olympic bid . [ 43 ] Primitive images, such as hearts, have also been displayed using the observatory's windows. [ 39 ]\n\nOperations at the Tokyo Tower Top Deck (at the height of 250 m) were suspended in 2016. The Top Deck reopened on 3 March 2018. At that time, Tokyo Tower also announced the renaming of both decks. Renovations on the main deck, which began in September 2016, caused partial closure of the deck. [ 4 ]\n\nTokyo Tower has two mascots named Noppon ( ノッポン ) . They are two brothers: Older Brother, who wears blue dungarees , and Younger Brother, who wears red dungarees. They were unveiled on 23 December 1998 to celebrate the 40th anniversary of Tokyo Tower. [ 44 ]\n\nJust as the Eiffel Tower is often used in popular culture to immediately locate a scene in Paris, Tokyo Tower is often used in the same way for Tokyo. It is used in anime and manga such as Doraemon , Tokyo Magnitude 8.0 , Magic Knight Rayearth , Please Save My Earth , Cardcaptor Sakura , Digimon , Detective Conan , Sailor Moon , Tenchi Muyo! and Death Note . [ 45 ] The tower is frequently used in the Japanese kaiju (giant monster) film genre. It has been the location of numerous battles and visitations by Godzilla , Mothra , Gamera and King Kong ( King Kong Escapes ) wherein it is frequently destroyed and rebuilt. [ 13 ] [ 46 ]\n\nTokyo Tower is represented in Unicode as an emoji at code point U+1F5FC: 🗼\n\nTokyo Tower and its construction often appears in Shōwa nostalgia fiction and non-fiction, where it is used as a symbol of the financial prosperity of Shōwa era Japan. [ 47 ] For example, the 2005 film Always Sanchōme no Yūhi , based on the popular manga series by Ryōhei Saigan, was a nostalgic view of life in the neighborhoods beneath the construction of Tokyo Tower.",
    "tf_idf_text": "tokyo tower tky taw pronounce toko taa aka japan radio tower nippon denpat communication observation tower district shibakoen minato tokyo japan complete tall tower japan construction tokyo skytree lattice tower inspire eiffel tower paint white international orange comply air safety regulation tower main source income tourism antenna lease foottown fourstory build directly tower house museums restaurant shop depart guest visit two observation deck twostory main deck formerly know main observatory small top deck formerly know special observatory reach height names change follow renovation top deck tower repaint every five year take year complete process transmission antenna add use radio television broadcast broadcast signal medium outlet nhk tbs television fuji television height tower not suitable japan plan terrestrial digital broadcasting plan july tokyo area taller digital broadcasting tower know tokyo skytree complete february tokyo tower become prominent landmark frequently appear medium set tokyo large broadcast tower need kant region nhk japan public broadcast station begin television broadcasting private broadcasting company begin operate month follow construction nhks transmission tower communication boom lead japanese government believe transmission tower would soon build tokyo eventually overrun city propose solution construction one large tower capable transmit entire region furthermore countrys postwar boom japan search monument symbolize national recovery world war one country ravage war hisakichi maeda founder president nippon denpat tower owner operator originally plan tower taller empire state building high structure world time however plan fell lack fund material tower height eventually determine distance station need transmit throughout kant region distance tach nait designer tall building japan choose design newly propose tower look western world inspiration nait base design eiffel tower paris france help engineering company nikken sekkei ltd nait claim design could withstand earthquake twice intensity great kant earthquake typhoon wind speed kmh mph new construction project attract hundred tobi traditional japanese construction worker specialize construction highrise structure takenaka corporation break ground june day least laborer work tower construct steel third scrap metal take tank damaged korean war ftlong antenna bolt place october tokyo tower tall freestanding tower world take title eiffel tower fail verification though taller eiffel tower tokyo tower weigh ton less eiffel tower significantly thin simple construction open public december final cost billion million tokyo tower mortgage billion tall artificial structure japan april surpass tokyo skytree plan antenna telecommunication brightly color accordance time aviation law tower two panoramic observatory mostly frequent tourist today tower constitutes clear reference point center skyline form strong landmark night day every five year tower repaint process take year complete tokyo tower next plan repaint need update tokyo tower two main revenue source antenna lease tourism function radio television broadcasting antenna support structure tourist destination house several different attraction tower record millionth visitor visitor number steadily decline bottom million rise since first area tourist visit upon reach tower foottown fourstory building station directly tower visitor eat shop visit several museum gallery elevator depart first floor foottown use reach first two observation deck twostory main observatory price another ticket visitor board another set elevator second floor main observatory reach final observation deckthe special observatory tokyo tower member world federation great tower use many organization broadcast purpose structure intend broadcast television radio antenna instal could accommodate analog digital television broadcast longer conduct site two radio station remain tokyo tower station use used tower antenna include japan employ analog digital broadcasting july television broadcast change solely digital tokyo tower not reliable broadcast antenna completely digital broadcast tower not tall enough transmit high frequency wave area surround forest highrise building alternative new mtall tower call tokyo skytree open attempt make tokyo tower appeal nhk five commercial broadcaster plan move transmit station new tower nihon denpat official draft plan extend digital broadcasting antenna cost approximately billion million result move skytree one digital television station remain tokyo tower open university japan whose jouddtv joudfm continue tower shut radio station continue use tower broadcast tokyo area masahiro kawada tower plan director raise possibility tower become backup tokyo skytree depend broadcaster want need antenna tip damage march thoku earthquake july tokyo tower height shrank meter top antenna repair damage earthquake locate base tower story build know foottown first floor include aquarium gallery reception hall personcapacity tower restaurant familymart convenience store souvenir shop floor main attraction however three elevator serve direct ride main observatory second floor primarily food shop area addition five standalone restaurant second floor food court consist four restaurant include mcdonalds pizzala foottowns third fourth floor house several tourist attraction third floor home guinness world record museum tokyo museum house lifesize figure photo panel memorabilia depict interesting record authenticate guinness book tokyo tower wax museum open displayed wax figure import london make closed figure display range pop culture icon beatles religious figure jesus christ hologram gallery name gallery delux lounge specialty store also locate floor tokyo tower trick art gallery locate building fourth final floor gallery display optical illusion include painting object visitor interact roof foottown build small amusement park contain several small ride host live performance child weekend holiday visitor use roof access tower outside stairwell approximately step stairwell alternative tower elevator lead directly main observatory base hit manga anime one piece tokyo tower feature small one piece theme amusement park open closed amusement park offer range attraction shop restaurant base character eiichiro oda manga patron enjoy various game attraction base favorite character enjoy meal world one piece gift store feature exclusive good one piece fan tokyo tower require gal paint completely paint structure white international orange comply air safety regulation tower anniversary light tower light bulb locate corner contour extend base antenna spring nihon denpat invite light designer motoko ishii visit tower since opening year earlier tower annual ticket sale drop significantly bid revitalize tower establish important tourist attraction symbol tokyo ishii hire redesign tokyo tower light arrangement unveil new light arrangement require removal contouroutlining light bulb installation floodlight around tower frame dusk midnight floodlight illuminate entire tower sodium vapor lamp use october july cover tower orange color july october light change metal halide lamp illuminate tower white color reasoning behind change seasonal one ishii reason orange warmer color help offset cold winter month conversely white think cool color help hot summer month occasionally tokyo tower light change specific arrangement special event tower specially lit annual event since entire tower illuminate pink light october highlight begin national breast cancer awareness month tower also variety special light arrangement christmas since new year eve tower light midnight year number display one side observatory mark arrival new year special japanese event cause light tower several nontraditional way alternate section tower lit blue help celebrate opening fifa world cup japan alternate section tower lit green saint patrick day commemorate anniversary japaneseirish relation occasion tokyo tower even specially lit correspond corporate event example top half tower lit green correspond japanese premiere matrix reload different section tower lit red white black commemorate first day sale cocacola summer tower lit olympic colour celebrate summer olympics summer paralympics tokyo delayed year due covid pandemic november tower lit red major league baseball los angeles angel follow award american league mvp twoway player shohei ohtani tower light new millennium motoko ishii reprise role designer december nihon denpat spend million create new nighttime illumination schemetitled diamond veilto celebrate tower anniversary arrangement feature light seven color equally distribute across tower four face employ specialty light tower main observatory often play important role second international white band day september tower completely unlit except main observatory lit bright white light result white ring represent white band reference day name two floor window make exterior main observatory utilized display word number tower employ light commemorate terrestrial digital broadcasting first available kant region december side main observatory display character chi deji abbreviation chij dejitaru terrestrial digital broadcasting recently observatory displayed tokyo stress tokyos olympic bid primitive image heart also display use observatorys window operation tokyo tower top deck height suspend top deck reopen march time tokyo tower also announce rename deck renovation main deck begin september cause partial closure deck tokyo tower two mascot name noppon two brother older brother wear blue dungaree young brother wear red dungaree unveil december celebrate anniversary tokyo tower eiffel tower often use popular culture immediately locate scene paris tokyo tower often use way tokyo use anime manga doraemon tokyo magnitude magic knight rayearth please save earth cardcaptor sakura digimon detective conan sailor moon tenchi muyo death note tower frequently use japanese kaiju giant monster film genre location numerous battle visitation godzilla mothra gamera king kong king kong escape wherein frequently destroy rebuilt tokyo tower represent unicode emoji code point uffc tokyo tower construction often appear shwa nostalgia fiction nonfiction use symbol financial prosperity shwa era japan example film always sanchme yhi base popular manga series ryhei saigan nostalgic view life neighborhood beneath construction tokyo tower"
}