{
    "title": "104 72 12 \"Zero\"\"Luffy vs. Vivi! The Tearful Vow to Put Friends on the Line!\"Transliteration: \"Rufi vs Bibi! Nakama ni kakeru namida no chikai\" (Japanese:ルフィVSビビ!仲間に賭ける涙の誓い) Ken Koyama Junki Takegami March 10, 2002(2002-03-10)[38] June 17, 2006[39][40]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_4",
    "transformers_text": "104 72 12 Zero Luffy vs Viv i The Tearful Vow to Put Friends on the Line Transliteration Ru fi vs Bibi Na kama ni kake ru n amida no chi kai Japanese VS Ken Koyama Junk i Take gam i March 10 2002 2002 03 10 38 June 17 2006 39 40 In Yu ba Luffy learns that To to was entrusted by Cobra to watch over the land and figures out a way to stop the sandstorm At Rain Dinners the Officer Agents learn that their leader Mr 0 is actually Crocodile and learn that they are going to overthrow the country during the war Mr 3 reveals that the Straw Hats are alive As punishment Crocodile dries him up and drops him into a Banana gator pit for failing to kill them Crocodile has Ms All Sunday tell the rebel army to kill everyone on sight Meanwhile the Straw Hats depart to Kato re a but Luffy stops When Luffy tells Viv i of his plan to defeat Crocodile and denounces Viv i's plan to stop the rebellion as naive the two get into a struggle During this Viv i reveals that she will only risk her own life Luffy however says that she should be putting their lives on the line together and to trust her friends and Viv i is moved to tears by his statement",
    "tf_idf_text": "zero luffy viv tearful vow put friend line transliteration bibi kama kake amida chi kai japanese ken koyama junk take gam march june luffy learns entrust cobra watch land figure way stop sandstorm rain dinner officer agent learn leader actually crocodile learn go overthrow country war reveals straw hat alive punishment crocodile dry drop banana gator pit fail kill crocodile sunday tell rebel army kill everyone sight meanwhile straw hat depart kato luffy stop luffy tell viv plan defeat crocodile denounces viv plan stop rebellion naive two get struggle viv reveals risk life luffy however say put life line together trust friend viv move tear statement"
}