{
    "title": "en.wikipedia.org_wiki_Whistle!",
    "url": "https://en.wikipedia.org/wiki/Whistle!",
    "transformers_text": "Whistle! ( Japanese : ホイッスル! , Hepburn : Hoissuru! ) is a Japanese manga series written and illustrated by Daisuke Higuchi . The series was published in Shueisha 's Weekly Shōnen Jump from February 1998 to October 2002. The series was adapted into a 39-episode anime television series broadcast exclusively by Animax across Japan. In North America, the series was licensed for English language release by Viz Media . A sequel, titled Whistle! W , ran in Shogakukan 's Ura Sunday and MangaONE web platforms from September 2016 to April 2021.\n\nWhistle! is about a middle school boy named Shō Kazamatsuri. He transfers from Musashinomori School to Sakura Jōsui Junior High School for better hopes to make the soccer team, since he never got a game at his old school due to his small stature. Yūko Katori, his teacher, introduces him as a former star of the famed Musashinomori team, causing his classmates to be wrongly ecstatic. Right after that, one of the players, Tatsuya Mizuno, reveals that he was never a regular. In other words, since he never got the chance to play, Shō is a poor player. Shō struggles to improve his skill so he can make the team at his new school and to ignore the drastic disadvantage he has due to his height.\n\nWritten and illustrated by Daisuke Higuchi , Whistle! was serialized in Shueisha 's shōnen manga magazine Weekly Shōnen Jump from February 24, 1998, [ a ] to October 8, 2002. [ b ] Shueisha collected its 212 chapters in 24 tankōbon volumes, released between July 3, 1998, and March 4, 2003. [ 5 ] [ 6 ]\n\nIn North America, the series was licensed for English release by Viz Media . The 24 volumes were released from October 12, 2004, to January 5, 2010. [ 7 ] [ 8 ]\n\nA sequel manga, title Whistle! W ( ホイッスル！Ｗ , Hoissuru! Daburu ) , started in Shogakukan 's Ura Sunday manga website on September 26, 2016. [ 9 ] [ 10 ] The manga went on hiatus in April 2019 due to Higuchi's health issues. [ 11 ] The series resumed publication after nearly two years on February 8, 2021, [ 12 ] and finished on April 5, 2021. [ 13 ] Shogakukan collected its chapters in five tankobon volumes, released from to May 19, 2017, to May 19, 2021. [ 14 ] [ 15 ]\n\nA 39-episode anime television series adaptation aired in Japan on Animax from May 5, 2002, to February 3, 2003. [ 16 ] [ 17 ] [ 18 ] [ 19 ] The opening and ending themes are \"Double Wind\" and \"Sweet Days\" respectively, both performed by Minako Komukai . In 2016, a new Japanese audio track for the anime was aired. [ 20 ]\n\nGames include: Game Boy Advance and PlayStation versions.\n\nA stage play adaptation was announced in February 2016 for a late August to early September release. [ 21 ]\n\nThe Whistle! series has received good reception. A review by Greg McElhatton of Read About Comics stated that the Whistle! manga had good drawings that showed the characters move around with the soccer ball during matches. [ 22 ] David Welsh of Precocious Curmudgeon said the series is very interesting that those who do not have soccer background will enjoy reading the manga, as well as with the realistic illustration used. [ 23 ]\n\nScott Campbell and Holly Ellingwood of Active Anime have remarked that the art is clear since all the \"line and detail has obvious care and attention given to it, resulting in well-managed visuals for a well-flowing read.\", [ 24 ] while praising Sho's character development as the readers \"see him strive against so much to obtain what he worked for is uplifting.\" [ 25 ] Eduardo M. Chavez's review on Whistle! Volume 1 noted that although it does not look good for characters to run away from their problems, Sho's inner determination to play soccer is the main highlight of the series. [ 26 ]",
    "tf_idf_text": "whistle japanese hepburn hoissuru japanese manga series write illustrated daisuke higuchi series publish shueisha weekly shnen jump february october series adapt episode anime television series broadcast exclusively animax across japan north america series license english language release viz medium sequel title whistle ran shogakukan ura sunday mangaone web platform september april whistle middle school boy name kazamatsuri transfer musashinomori school sakura jsui junior high school well hope make soccer team since never get game old school due small stature yko katori teacher introduces former star famed musashinomori team cause classmate wrongly ecstatic right one player tatsuya mizuno reveals never regular word since never get chance play poor player struggle improve skill make team new school ignore drastic disadvantage due height write illustrated daisuke higuchi whistle serialized shueisha shnen manga magazine weekly shnen jump february october shueisha collect chapter tankbon volume release july march north america series license english release viz medium volume release october january sequel manga title whistle hoissuru daburu start shogakukan ura sunday manga website september manga go hiatus april due higuchis health issue series resume publication nearly two year february finish april shogakukan collect chapter five tankobon volume release may may episode anime television series adaptation air japan animax may february open end theme double wind sweet day respectively perform minako komukai new japanese audio track anime air game include game boy advance playstation version stage play adaptation announce february late august early september release whistle series receive good reception review greg mcelhatton read comic state whistle manga good drawing show character move around soccer ball match david welsh precocious curmudgeon say series interest not soccer background enjoy read manga well realistic illustration use scott campbell holly ellingwood active anime remark art clear since line detail obvious care attention give result wellmanaged visuals wellflowing read praise shos character development reader see strive much obtain worked uplifting eduardo chavez review whistle volume note although not look good character run away problem shos inner determination play soccer main highlight series"
}