{
    "title": "en.wikipedia.org_wiki_Jakarta_Globe",
    "url": "https://en.wikipedia.org/wiki/Jakarta_Globe",
    "transformers_text": "The Jakarta Globe is a daily online English-language newspaper in Indonesia , launched in November 2008. [ 2 ]\n\nThe paper initially came out as a print newspaper with an average of 48 pages a day, and was published Monday through Saturday. It had three sections. Section A contained a range of general news, including metropolitan, national and international coverage, as well as commentaries. Section B featured Indonesian and world business, news, sports and a classified advertising section. Section C offered extensive features and lifestyle content, as well as entertainment, listings, reader service and puzzle/cartoon pages. The newspaper later added a Sunday edition of the Jakarta Globe. It converted from broadsheet to tabloid format in May 2012, and then transitioned to an online-only publication from 15 December 2015. [ 3 ]\n\nThe newspaper's owner, PT Jakarta Globe Media, is part of Enggartiasto Lukita 's B Universe (formerly Globe Media Group and BeritaSatu Media Holdings, both of which are associated companies of Lippo Group ).\n\nThis article about media in Indonesia is a stub . You can help Wikipedia by expanding it .",
    "tf_idf_text": "jakarta globe daily online englishlanguage newspaper indonesia launch november paper initially come print newspaper average page day publish monday saturday three section section contain range general news include metropolitan national international coverage well commentaries section feature indonesian world business news sport classify advertising section section offer extensive feature lifestyle content well entertainment listing reader service puzzlecartoon page newspaper later add sunday edition jakarta globe convert broadsheet tabloid format may transition onlineonly publication december newspaper owner jakarta globe medium part enggartiasto lukita universe formerly globe medium group beritasatu medium holding associate company lippo group article medium indonesia stub help wikipedia expand"
}