{
    "title": "en.wikipedia.org_wiki_Original_video_animation",
    "url": "https://en.wikipedia.org/wiki/Original_video_animation",
    "transformers_text": "Original video animation ( Japanese : オリジナル・ビデオ・アニメーション , Hepburn : orijinaru bideo animēshon ) , abbreviated as OVA and sometimes as OAV ( original animation video ), are Japanese animated films and special episodes of a series made specially for release in home video formats without prior showings on television or in theaters, though the first part of an OVA series may be broadcast for promotional purposes. OVA titles were originally made available on VHS , later becoming more popular on LaserDisc and eventually DVD . [ 1 ] Starting in 2008, the term OAD ( original animation DVD ) [ 2 ] [ 3 ] began to refer to DVD releases published bundled with their source-material manga .\n\nLike anime made for television broadcast, OVAs are divided into episodes. OVA media (tapes, laserdiscs or DVDs) usually contain just one episode each. Episode length varies from title to title: each episode may run from a few minutes to two hours or more. An OVA series can run anywhere from a single episode to dozens of episodes in length.\n\nMany anime series first appeared as OVAs, and later grew to become television series or movies. [ examples needed ] Producers sometimes make other OVA releases as sequels, side stories, music-video collections, or bonus episodes that continue existing as television series or films. [ examples needed ]\n\nThe consumer base of OVAs constitutes mainly of males. Bandai Visual said in a 2004 news release (for their new OVAs aimed at women) that about 50% of the customers who had bought their anime DVDs in the past fell into the category of 25 to 40-year-old men, with only 13% of purchasers women, even with all ages included. [ 4 ] (However, these statistics cover Bandai Visual anime DVDs in general.) Nikkei Business Publications also said in a news-release that mainly 25 to 40-year-old adults bought anime DVDs. [ 5 ]\n\nSome OVAs based on television series (and especially those based on manga ) may provide closure to the plot – closure not present in the original series. [ examples needed ]\n\nOVAs originated during the early 1980s. As the VCR became a commonplace in Japanese homes, the anime industry grew. Demand for anime became so massive that consumers would go to video stores to buy new animation outright. While people in the United States used the phrase \" direct-to-video \" as a pejorative for works that could not make it onto television or movie screens, in Japan direct-to-video became common practice. [ 6 ] [ 7 ]\n\nThe earliest known attempt to release an OVA was The Green Cat in 1983, although it cannot count as the first OVA: there is no evidence that the VHS tape became available immediately and the series remained incomplete. The first OVA to be billed as such was 1983's Dallos , released by Bandai . Other companies were quick to pick up on the idea, and the mid-to-late 1980s saw the market flooded with OVAs. During this time, most OVA series were new, stand-alone titles. [ 8 ]\n\nDuring Japan's economic bubble , production companies were more than willing to spontaneously decide to make a one- or two-part OVA in the 1980s. [ 9 ] They paid money to anime studios, who would then quickly create an OVA to be released to rental shops. Judging from sales, should a longer series be deemed feasible, TV networks paid for most of the production costs of the entire series. [ 10 ]\n\nAs the Japanese economy worsened in the 1990s , the creation of new OVA titles slowed down. Production of OVAs continued, but in smaller numbers. Many anime TV series ran 13 episodes rather than the traditional 26-episodes per season. Studios often designed new titles to be released to TV if they approached these lengths. In addition, the rising popularity of cable and satellite TV networks (with their typically less strict censorship) allowed the public to see direct broadcasts of many new titles. [ citation needed ] Therefore, many violent and risque series became regular TV series, when previously those titles would have been OVAs. During this time, most OVA content was limited to that related to existing and established titles.\n\nIn 2000 and later, a new OVA trend began. Producers released many TV series without normal broadcasts of all of the episodes—but releasing some episodes on the DVD release of the series. [ example needed ]",
    "tf_idf_text": "original video animation japanese hepburn orijinaru bideo animshon abbreviate ova sometimes oav original animation video japanese animated film special episodes series make specially release home video format without prior showing television theater though first part ovum series may broadcast promotional purpose ova title originally make available vhs later become popular laserdisc eventually dvd start term oad original animation dvd begin refer dvd release publish bundle sourcematerial manga like anime make television broadcast ovas divide episode ova medium tape laserdiscs dvd usually contain one episode episode length vary title title episode may run minute two hour ova series run anywhere single episode dozen episodes length many anime series first appear ovas later grow become television series movie examples needed producer sometimes make ova release sequel side story musicvideo collection bonus episode continue exist television series film examples needed consumer base ovas constitute mainly male bandai visual say news release new ovas aim woman customer buy anime dvds past fell category yearold men purchaser woman even age include however statistic cover bandai visual anime dvd general nikkei business publication also say newsrelease mainly yearold adult buy anime dvds ovas base television series especially base manga may provide closure plot closure not present original series example need ovas originate early vcr become commonplace japanese home anime industry grow demand anime become massive consumer would video store buy new animation outright people united state use phrase directtovideo pejorative work could not make onto television movie screen japan directtovideo become common practice early know attempt release ovum green cat although cannot count first ova evidence vhs tape become available immediately series remain incomplete first ovum bill dallos release bandai company quick pick idea midtolate saw market flood ovas time ova series new standalone title japan economic bubble production company willing spontaneously decide make one twopart ovum pay money anime studio would quickly create ovum release rental shop judge sale longer series deem feasible network pay production cost entire series japanese economy worsen creation new ova title slow production ovas continue small number many anime series run episode rather traditional episode per season studio often design new title release approached lengths addition rise popularity cable satellite network typically less strict censorship allow public see direct broadcast many new title citation need therefore many violent risque series become regular series previously title would ovas time ova content limit related exist establish title later new ovum trend begin producer release many series without normal broadcast episodesbut release episode dvd release series example need"
}