{
    "title": "62 44b 1 \"Fantastic Voyage\"\"The First Line of Defence? The Giant Whale Laboon Appears!\"Transliteration: \"Sasho no Toride? Kyodai Kujira Rabūn Arawareru\" (Japanese:最初の砦?巨大クジラ·ラブーン現る) Kōnosuke Uda Michiru Shimada 613.7 March 14, 2001(2001-03-14)[n 6] July 30, 2005",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_2",
    "transformers_text": "62 44b 1 \"Fantastic Voyage\"\"The First Line of Defence? The Giant Whale Laboon Appears!\"Transliteration: \"Sasho no Toride? Kyodai Kujira Rabūn Arawareru\" (Japanese:最初の砦?巨大クジラ·ラブーン現る) Kōnosuke Uda Michiru Shimada 613.7 March 14, 2001(2001-03-14)[n 6] July 30, 2005\n\nAs the Straw Hats ride down Reverse Mountain into theGrand Line, a hugewhaleappears in front of them. With thehelmstill broken, they are about to crash into it, but Luffy fires a cannon, sufficiently slowing the ship, just breaking Luffy's beloved seat, the ship's sheep figurehead. Infuriated, Luffy punches the whale directly in the eye. The whale swallows the Straw Hats and their ship. Only Luffy falls overboard and gets on the whale. The whale submerges. In the last second, Luffy notices a door on top of the whale. While Luffy winds up in some sort of passageway, his crew finds itself in front of a small island in the middle of green waters, with a clear blue-sky overhead. There they encounter Crocus, the whale's caretaker, who painted the inside of its stomach to look like the sky. Suddenly everything starts to shake as Laboon—which is the name of the whale—rams its head against the Red Line. Crocus leaves to give Laboon a sedative. Meanwhile, Luffy and two individuals, crash into the whale's stomach. As Crocus returns, they shot two cannonballs from their bazookas, to rip a hole in the whale's stomach, but Crocus takes the cannonballs with his own body. Then Luffy knocks them both out. Leading the Straw Hats out of the whale, Crocus explains that Laboon is a whale with a heart like a person, who has been waiting for a certain group of pirates for fifty years.[n 5]",
    "tf_idf_text": "fantastic voyagethe first line defence giant whale laboon appearstransliteration sasho toride kyodai kujira rabn arawareru japanese knosuke uda michiru shimada march july straw hat ride reverse mountain thegrand line hugewhaleappears front thehelmstill break crash luffy fire cannon sufficiently slow ship break luffys beloved seat ship sheep figurehead infuriate luffy punch whale directly eye whale swallow straw hat ship luffy fall overboard get whale whale submerges last second luffy notice door top whale luffy wind sort passageway crew find front small island middle green water clear bluesky overhead encounter crocus whale caretaker paint inside stomach look like sky suddenly everything start shake laboonwhich name whalerams head red line crocus leave give laboon sedative meanwhile luffy two individual crash whale stomach crocus return shoot two cannonball bazookas rip hole whale stomach crocus take cannonball body luffy knock lead straw hat whale crocus explains laboon whale heart like person wait certain group pirate fifty yearsn"
}