{
    "title": "63 - 2 \"A Promise Between Men! Luffy and the Whale Vow to Meet Again!\"Transliteration: \"Otoko no Yakusoku! Rufi to Kujira Saikai no Chikai\" (Japanese:男の約束! ルフィとクジラ再会の誓い) Harume Kosaka Michiru Shimada 613.7 March 21, 2001(2001-03-21)[n 6][1] —",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_2",
    "transformers_text": "63 - 2 \"A Promise Between Men! Luffy and the Whale Vow to Meet Again!\"Transliteration: \"Otoko no Yakusoku! Rufi to Kujira Saikai no Chikai\" (Japanese:男の約束! ルフィとクジラ再会の誓い) Harume Kosaka Michiru Shimada 613.7 March 21, 2001(2001-03-21)[n 6][1] —\n\nWhile guiding them out of the giant whale Laboon, its caretaker, Crocus, tells the whale's story to the Straw Hats, that it was left behind by a group of pirates when they began their journey through the Grand Line and abandoned when they fled through one of thecalm beltsand that once he told Laboon what had happened, the whale started ramming its head against theRed Line, not believing what Crocus said because that would mean losing its reason to wait. After hearing that, Luffy picks a fight with the whale, breaks it off and declares it to be a draw. Then he promises to return to finish the fight. Nami tries to plot a course, but is unable to do so because her compass does not point in a single direction. Crocus explains how the Grand Line is navigated and that alog poseis needed. In return for helping Laboon, he gives them a log pose and the Straw Hats set sail for Whiskey Peak, the home town of Mr. 9 and Miss Wednesday, whom they are taking along. While watching them leave, Crocus reveals he actually knew Gol D. Roger.[n 7]",
    "tf_idf_text": "promise men luffy whale vow meet againtransliteration otoko yakusoku rufi kujira saikai chikai japanese harume kosaka michiru shimada march guide giant whale laboon caretaker crocus tell whale story straw hat leave behind group pirate begin journey grand line abandon flee one thecalm beltsand tell laboon happen whale start ram head thered line not believe crocus say would mean lose reason wait hearing luffy pick fight whale break declare draw promise return finish fight nami try plot course unable compass not point single direction crocus explain grand line navigate alog poseis need return help laboon give log pose straw hat set sail whiskey peak home town miss wednesday take along watch leave crocus reveals actually know gol rogern"
}