{
    "title": "65 45 4 \"Baroque Works\"\"Explosion! The Three Swords Style! Zoro vs. Baroque Works!\"Transliteration: \"Sakuretsu Santōryū! Zoro vs Barokku Wākusu\" (Japanese:炸裂三刀流! ゾロVSバロックワークス) Yoshihiro Ueda Michiru Shimada 217.2 April 15, 2001(2001-04-15)[n 9][21] August 6, 2005[22]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_2",
    "transformers_text": "65 45 4 \"Baroque Works\"\"Explosion! The Three Swords Style! Zoro vs. Baroque Works!\"Transliteration: \"Sakuretsu Santōryū! Zoro vs Barokku Wākusu\" (Japanese:炸裂三刀流! ゾロVSバロックワークス) Yoshihiro Ueda Michiru Shimada 217.2 April 15, 2001(2001-04-15)[n 9][21] August 6, 2005[22]\n\nNami who faked falling asleep as well, searches the town for the bounty hunters' treasures. Meanwhile, Zoro lets loose on the bounty hunters the two new swords he received in Lougetown, Yubashiri and Sandai Kitetsu. After he defeats all of them, including the frontier agents Mr. 9, Miss Wednesday, Mr. 8, and Miss Monday, a new threat arrives, the Baroque Works officer agentsMr. 5andMiss Valentine. Their mission is to eliminate two traitors, who know the true identity of the organization's boss, Mr. 0. They reveal them to be Mr. 8, who is really Igaram, captain of the royal army of the Kingdom of Alabasta, and Miss Wednesday, who is actually Alabasta's crown princess,Nefertari Vivi.",
    "tf_idf_text": "baroque worksexplosion three sword style zoro baroque workstransliteration sakuretsu santry zoro barokku wkusu japanese yoshihiro ueda michiru shimada april august nami fake fall asleep well search town bounty hunter treasure meanwhile zoro let loose bounty hunter two new sword receive lougetown yubashiri sandai kitetsu defeat include frontier agent miss wednesday miss monday new threat arrive baroque work officer agentsmr andmiss valentine mission eliminate two traitor know true identity organization bos reveal really igaram captain royal army kingdom alabasta miss wednesday actually alabastas crown princessnefertari vivi"
}