{
    "title": "66 46 5 \"Luffy vs. Zoro\"\"All Out Battle! Luffy vs. Zoro! Mysterious Grand Duel!\"Transliteration: \"Shinken Shōbu! Rufi vs Zoro Nazo no Dai Kettō\" (Japanese:真剣勝負! ルフィVSゾロ謎の大決闘!) Hidehiko Kadota Michiru Shimada 5[n 10]14.1 April 22, 2001(2001-04-22)[23] August 13, 2005[24]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_2",
    "transformers_text": "66 46 5 \"Luffy vs. Zoro\"\"All Out Battle! Luffy vs. Zoro! Mysterious Grand Duel!\"Transliteration: \"Shinken Shōbu! Rufi vs Zoro Nazo no Dai Kettō\" (Japanese:真剣勝負! ルフィVSゾロ謎の大決闘!) Hidehiko Kadota Michiru Shimada 5[n 10]14.1 April 22, 2001(2001-04-22)[23] August 13, 2005[24]\n\nMr. 5 and Miss Valentine follow after Vivi, who attempts to flee the island. Mr. 9 despite learning Vivi's a traitor tries to protect her but is beaten. Igaram, no longer able to fight himself, begs Zoro to save her, but Zoro refuses. As the Alabastan soldier promises a handsome reward, Nami chimes in. She first extorts Igaram to raise the amount, then she extorts Zoro to save the princess. Miss Monday also decides to try and protect Vivi, but is quickly beaten by Mr. 5's Bomb-Bomb Fruit powers that allow him to create explosions from any part of his body, and Miss Valentine's Kilo-Kilo Fruit powers which allow to change her weight from one to ten thousand kilograms. When Zoro is about to take on Vivi's assailants, Luffy appears. Oblivious to the townsfolk's occupation as bounty hunters, he wants to fight Zoro for cutting them all up. Unable to convince Luffy of the truth, Zoro fights him. The officer agents attempt to get past the fighting crewmates, but are caught up in the struggle and easily defeated.",
    "tf_idf_text": "luffy zoroall battle luffy zoro mysterious grand dueltransliteration shinken shbu rufi zoro nazo dai kett japanese hidehiko kadota michiru shimada april august miss valentine follow vivi attempt flee island despite learn vivis traitor try protect beat igaram longer able fight begs zoro save zoro refuse alabastan soldier promise handsome reward nami chime first extorts igaram raise amount extorts zoro save princess miss monday also decide try protect vivi quickly beat bombbomb fruit power allow create explosion part body miss valentine kilokilo fruit power allow change weight one ten thousand kilograms zoro take vivis assailant luffy appear oblivious townsfolk occupation bounty hunter want fight zoro cut unable convince luffy truth zoro fight officer agent attempt get past fighting crewmates catch struggle easily defeat"
}