{
    "title": "67 47a 6 \"Escape From Misty Peak\"\"Deliver Princess Vivi! The Luffy Pirates Set Sail!\"Transliteration: \"Ōjo Bibi o Todokero! Rufi Kaizoku Dan Shukkō\" (Japanese:王女ビビを届けろ! ルフィ海賊団出航) Kōnosuke Uda Michiru Shimada 415.0 April 29, 2001(2001-04-29)[25] August 20, 2005[10]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_2",
    "transformers_text": "67 47a 6 \"Escape From Misty Peak\"\"Deliver Princess Vivi! The Luffy Pirates Set Sail!\"Transliteration: \"Ōjo Bibi o Todokero! Rufi Kaizoku Dan Shukkō\" (Japanese:王女ビビを届けろ! ルフィ海賊団出航) Kōnosuke Uda Michiru Shimada 415.0 April 29, 2001(2001-04-29)[25] August 20, 2005[10]\n\nLuffy and Zoro are about to go all out, when Nami arrives and violently ends their duel. Out of imminent danger, Vivi explains that Baroque Works is responsible for inciting a rebellion in her home country, which is why she cannot offer a large reward, and reveals that Mr. 0's true identity isSir Crocodile, one of theSeven Warlords of the Sea. Unfortunately, two Baroque Works spies see this and capture pictures of Luffy, Zoro and Nami, making them Baroque Works top targets. Nevertheless, Luffy agrees to take her with them. Igaram sets out on the direct route to Alabasta, as a decoy. As he clears the coast, his ship is engulfed in an explosion. The Straw Hats and Vivi hurry to their ship and set sail, following the log towards Little Garden.Miss All-Sunday, the partner of Mr. 0, appears on their ship. Without explaining her reasons, she offers the crew aneternal pose. However, Luffy crushes it and the agent leaves them.",
    "tf_idf_text": "escape misty peakdeliver princess vivi luffy pirate set sailtransliteration bibi todokero rufi kaizoku dan shukk japanese knosuke uda michiru shimada april august luffy zoro nami arrive violently end duel imminent danger vivi explain baroque work responsible incite rebellion home country cannot offer large reward reveals true identity issir crocodile one theseven warlord sea unfortunately two baroque work spy see capture picture luffy zoro nami make baroque work top target nevertheless luffy agrees take igaram set direct route alabasta decoy clear coast ship engulfed explosion straw hat vivi hurry ship set sail follow log towards little gardenmiss allsunday partner appear ship without explain reason offer crew aneternal pose however luffy crush agent leaf"
}