{
    "title": "68 — 7 \"Try Hard, Coby! Coby and Helmeppo's Struggles in the Marines!\"Transliteration: \"Ganbare Kobī! Kobimeppo Kaigun Funtōki\" (Japanese:頑張れコビー! コビメッポ海軍奮闘記) Harume Kosaka Michiru Shimada 314.6 May 13, 2001(2001-05-13)[26] —",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_2",
    "transformers_text": "68 7 Try Hard Coby Coby and Helm ep po's Struggles in the Marines Transliteration Gan bare Ko b K obi mep po Kai gun Fun t ki Japanese Haru me K osaka Michiru Shimada 314 6 May 13 2001 2001 05 13 26 Coby and Helm ep po have enlisted into the navy as odd jobbers Coby works hard towards his goal of becoming an officer They get into an argument about whether it is possible which escalates into a struggle during which they accidentally fire a cannon destroying a whole building Later they are taken along on a trip to turn over Helm ep po's father the former navy captain Axe Hand Morgan to Vice Admiral Gar p to stand trial for his crimes While receiving the prisoner Gar p falls asleep Morgan slashes the admiral's chest takes Helm ep po hostage and stealing a boat makes a run for his life The marines are about to fire at them when Coby steps in front of the cannon He pleads for his friend's life and jumps into the water to swim after them Impressed with Coby risking dismissal from the navy and thus his dream Helm ep po stands up to his father Coby arrives and they fight him together Eventually Morgan throws them overboard Gar p who witnessed their struggle decides to take them with him to the navy headquarters",
    "tf_idf_text": "try hard coby coby helm po struggle marine transliteration gan bare obi mep kai gun fun japanese haru osaka michiru shimada may coby helm enlist navy odd jobber coby work hard towards goal become officer get argument whether possible escalates struggle accidentally fire cannon destroy whole building later take along trip turn helm po father former navy captain axe hand morgan vice admiral gar stand trial crime receive prisoner gar fall asleep morgan slash admiral chest take helm hostage steal boat make run life marine fire coby step front cannon pleads friend life jump water swim impressed coby risk dismissal navy thus dream helm stand father coby arrives fight together eventually morgan throw overboard gar witness struggle decides take navy headquarters"
}