{
    "title": "68 — 7 \"Try Hard, Coby! Coby and Helmeppo's Struggles in the Marines!\"Transliteration: \"Ganbare Kobī! Kobimeppo Kaigun Funtōki\" (Japanese:頑張れコビー! コビメッポ海軍奮闘記) Harume Kosaka Michiru Shimada 314.6 May 13, 2001(2001-05-13)[26] —",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_2",
    "transformers_text": "68 — 7 \"Try Hard, Coby! Coby and Helmeppo's Struggles in the Marines!\"Transliteration: \"Ganbare Kobī! Kobimeppo Kaigun Funtōki\" (Japanese:頑張れコビー! コビメッポ海軍奮闘記) Harume Kosaka Michiru Shimada 314.6 May 13, 2001(2001-05-13)[26] —\n\nCobyandHelmeppohave enlisted into the navy as oddjobbers. Coby works hard towards his goal of becoming an officer. They get into an argument about whether it is possible, which escalates into a struggle, during which they accidentally fire a cannon, destroying a whole building. Later they are taken along on a trip to turn over Helmeppo's father, the former navy captain, \"Axe-Hand\" Morgan, toVice-Admiral Garpto stand trial for his crimes. While receiving the prisoner, Garp falls asleep. Morgan slashes the admiral's chest, takes Helmeppo hostage, and, stealing a boat, makes a run for his life. The marines are about to fire at them when Coby steps in front of the cannon. He pleads for his friend's life and jumps into the water to swim after them. Impressed with Coby risking dismissal from the navy and thus his dream, Helmeppo stands up to his father. Coby arrives and they fight him together. Eventually Morgan throws them overboard. Garp, who witnessed their struggle decides to take them with him to the navy headquarters.",
    "tf_idf_text": "try hard coby coby helmeppos struggle marinestransliteration ganbare kob kobimeppo kaigun funtki japanese harume kosaka michiru shimada may cobyandhelmeppohave enlist navy oddjobbers coby work hard towards goal become officer get argument whether possible escalates struggle accidentally fire cannon destroy whole building later take along trip turn helmeppos father former navy captain axehand morgan toviceadmiral garpto stand trial crime receive prisoner garp fall asleep morgan slash admiral chest take helmeppo hostage steal boat make run life marine fire coby step front cannon pleads friend life jump water swim impressed coby risk dismissal navy thus dream helmeppo stand father coby arrives fight together eventually morgan throw overboard garp witness struggle decides take navy headquarters"
}