{
    "title": "73 — 12 \"Broggy's Bitter Tears of Victory! The Conclusion of Elbaf!\"Transliteration: \"Burogī Shōri no Gōkyū! Erubafu no Ketchaku!\" (Japanese:ブロギー勝利の号泣! エルバフの決着) Yoshihiro Ueda Junki Takegami 415.3 June 24, 2001(2001-06-24)[31] —",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_2",
    "transformers_text": "73 — 12 \"Broggy's Bitter Tears of Victory! The Conclusion of Elbaf!\"Transliteration: \"Burogī Shōri no Gōkyū! Erubafu no Ketchaku!\" (Japanese:ブロギー勝利の号泣! エルバフの決着) Yoshihiro Ueda Junki Takegami 415.3 June 24, 2001(2001-06-24)[31] —\n\nBefore he leaves to face his rival and friend for a last time, Dorry traps Luffy under a huge rock. While the giants fight, Nami and Usopp try to cross the jungle to meet up with Luffy and Vivi at Dorry's camp. While once again fleeing from a hungry dinosaur, Nami is distracted by a life-sized facsimile of Luffy and captivated by Mr. 3's Wax-Wax Fruit powers, which allow him to generate wax. Zoro is captured in a similar way. Usopp arrives alone at Dorry's camp, shortly followed by Mr. 5 and Miss Valentine. The giants' manipulated duel ends in defeat for Dorry. Broggy, who stands in tears over the lifeless body of his friend, is addressed by Mr. 3, who already encased the giant's feet in iron-hard wax. Mr. 5 captures Vivi, while his partner stomps Usopp chest-deep into the ground.",
    "tf_idf_text": "broggys bitter tear victory conclusion elbaftransliteration burog shri gky erubafu ketchaku japanese yoshihiro ueda junki takegami june leave face rival friend last time dorry trap luffy huge rock giant fight nami usopp try cross jungle meet luffy vivi dorrys camp flee hungry dinosaur nami distract lifesized facsimile luffy captivate waxwax fruit power allow generate wax zoro capture similar way usopp arrive alone dorrys camp shortly follow miss valentine giant manipulate duel end defeat dorry broggy stand tear lifeless body friend address already encased giant foot ironhard wax capture vivi partner stomp usopp chestdeep ground"
}