{
    "title": "74 — 13 \"The Devilish Candle! Tears of Regret and Tears of Anger!\"Transliteration: \"Ma no Cyandoru! Munen no Namida to Okari no Namida\" (Japanese:魔のキャンドル! 無念の涙と怒りの涙) Kōnosuke Uda Junki Takegami 315.6 July 15, 2001(2001-07-15)[32] —",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_2",
    "transformers_text": "74 — 13 \"The Devilish Candle! Tears of Regret and Tears of Anger!\"Transliteration: \"Ma no Cyandoru! Munen no Namida to Okari no Namida\" (Japanese:魔のキャンドル! 無念の涙と怒りの涙) Kōnosuke Uda Junki Takegami 315.6 July 15, 2001(2001-07-15)[32] —\n\nAfter explosively beating down on the still trapped Luffy, Mr. 5 and his partner take Vivi to the giants' duel site, where Mr. 3 is busy further restraining Broggy with his wax. After that, Mr. 3 creates a large, cake-shaped pedestal upon which Vivi, Nami, and Zoro are placed. On top of the pedestal, he creates a rotating platform upon which he places several large candles, which spray wax over his prisoners, slowly turning them into wax figures. Then he explains to Broggy how he manipulated their duel, causing the giant to burst out in anger and break his restraints. However, before he can completely free himself, Mr. 5 knocks the giant out with several explosions and Mr. 3 renews the restraints. Meanwhile, Karoo, Vivi's ostrich sized duck, digs out Luffy from under the rock. The bird, Luffy, and Usopp arrive at the scene just as Zoro attempts to free himself by cutting off his legs.",
    "tf_idf_text": "devilish candle tear regret tear angertransliteration cyandoru munen namida okari namida japanese knosuke uda junki takegami july explosively beat still trap luffy partner take vivi giant duel site busy restrain broggy wax create large cakeshaped pedestal upon vivi nami zoro place top pedestal create rotate platform upon place several large candle spray wax prisoner slowly turn wax figure explain broggy manipulate duel cause giant burst anger break restraint however completely free knock giant several explosion renew restraint meanwhile karoo vivis ostrich size duck dig luffy rock bird luffy usopp arrive scene zoro attempt free cut leg"
}