{
    "title": "76 — 15 \"Time to Fight Back! Usopp's Quick Thinking and Fire Star!\"Transliteration: \"Iza Hangeki! Usoppu no Kiten to Kaenboshi!\" (Japanese:いざ反撃! ウソップの機転と火炎星!) Harume Kosaka Junki Takegami 214.9 August 19, 2001(2001-08-19)[n 11][2] —",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_2",
    "transformers_text": "76 15 Time to Fight Back Us opp's Quick Thinking and Fire Star Transliteration Iz a Han geki Us opp u no Kite n to Ka en boshi Japanese Haru me K osaka Junk i Take gam i 214 9 August 19 2001 2001 08 19 n 11 2 Once back at the pedestal Us opp finds Luffy drinking tea with Miss Golden Week while their friends are already completely covered in wax He burns Luffy's shirt upon which Miss Golden Week had painted using a flaming projectile Luffy again himself attempts to destroy the pedestal but is interrupted by the returning Mr 3 who creates himself a waxen battle suit Us opp is finally struck down by Mr 5's explosive shots but is still able to make Karoo run around the pedestal dragging behind it a rope which Us opp soaks in flammable oil Luffy then grabs Mr 3 at his burning three shaped hairdo and uses it to inflame the rope burning the large wax structure and freeing the others As they emerge from the flames Nami and Viv i defeat Miss Valentine and Zoro makes quick work of Mr 5 Luffy and Karoo chase after Mr 3 and his partner and defeat them as Karoo see Miss Golden Week walking and defeat him respectively Meanwhile Sanji stumbles upon Mr 3's hideout where he receives a call from Mr 0",
    "tf_idf_text": "time fight back opps quick think fire star transliteration han geki opp kite boshi japanese haru osaka junk take gam august back pedestal opp find luffy drink tea miss golden week friend already completely cover wax burn luffys shirt upon miss golden week paint use flame projectile luffy attempt destroy pedestal interrupt return creates waxen battle suit opp finally struck explosive shot still able make karoo run around pedestal drag behind rope opp soak flammable oil luffy grab burn three shape hairdo us inflame rope burn large wax structure free others emerge flame nami viv defeat miss valentine zoro make quick work luffy karoo chase partner defeat karoo see miss golden week walk defeat respectively meanwhile sanji stumble upon hideout receives call"
}