{
    "title": "77 47b 16 \"Escape From Misty Peak\"\"Farewell Giant Island! Head for Alabasta!\"Transliteration: \"Saraba Kyojin no Shima! Arabasuta o Mezase\" (Japanese:さらば巨人の島! アラバスタを目指せ) Yuji Endo Junki Takegami 214.9 August 19, 2001(2001-08-19)[n 11][2] August 20, 2005",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_2",
    "transformers_text": "77 47 b 16 Escape From Misty Peak Farewell Giant Island Head for A la bast a Transliteration S araba Kyo j in no Shima Arab as uta o Meza se Japanese Yuji Endo Junk i Take gam i 214 9 August 19 2001 2001 08 19 n 11 2 August 20 2005 Once Sanji realizes that he is talking to Crocodile he pretends being Mr 3 and convinces the Warlord that he has eliminated Viv i and her Straw Hat escort During the conversation Crocodile's messengers the otter and its partner the vulture called the Un luck ies arrive to deliver an eternal pose leading to A la bast a to Mr 3 They attack Sanji but he defeats them To justify the noisy interruption Sanji tells Mr 0 that one of the Straw Hats was still alive Crocodile tells him to return to A la bast a then after the conversation orders Mr 2 to intercept and eliminate Mr 3 en route for his failure to make accurate reports While Br ogg y creates a rainfall of tears Dor ry wakes up and concludes that after a hundred years Br ogg y's axe had gotten dull and only knocked him out Using the eternal pose to guide them the crew sets sail Dor ry and Br ogg y see them off and to thank them sacrifice their worn out weapons to kill a giant goldfish as it attempts to feed on the Straw Hats ' ship n 12",
    "tf_idf_text": "escape misty peak farewell giant island head bast transliteration araba kyo shima arab uta meza japanese yuji endo junk take gam august august sanji realize talk crocodile pretend convinces warlord eliminate viv straw hat escort conversation crocodile messenger otter partner vulture call luck y arrive deliver eternal pose lead bast attack sanji defeat justify noisy interruption sanji tell one straw hat still alive crocodile tell return bast conversation order intercept eliminate route failure make accurate report ogg create rainfall tear dor wake concludes hundred year ogg axe gotten dull knock use eternal pose guide crew set sail dor ogg see thank sacrifice wear weapon kill giant goldfish attempt fee straw hat ship"
}