{
    "title": "en.wikipedia.org_wiki_One_Piece__Become_the_Pirate_King!",
    "url": "https://en.wikipedia.org/wiki/One_Piece:_Become_the_Pirate_King!",
    "transformers_text": "One Piece: Become the Pirate King! ( ONE PIECE めざせ海賊王！ , Wan Pīsu: Mezase Kaizoku Ō! ) is a Japan-exclusive Action/Strategy/Role Playing game for the WonderSwan . It is the first video game to be based on the One Piece manga and anime . [ 2 ]\n\nGol. D Roger ( ゴル･D･ロジャー , Goru D. Rojā ) , the king of the pirates had obtained wealth, fame and power from people all over the world. Before his execution, he announced that he had left his treasure, the One Piece, in a single place. Because of this, many pirates from all around the world set sail for the grand line. The time period was known as the \"Great Pirate Era\". Twenty years later a young man known as Monkey D. Luffy ( モンキー･D･ルフィ , Monkī D. Rufi ) finally sets out to sea. This game is based on the East Blue saga and the first One Piece film.\n\nThe player must use playing cards to move around the area in order to reach a certain destination. the card contains the type of pathway and the number of spaces the player can move. Along the way are surprise enemy attacks which are dealt with by using a pathway to reach the opponent standing there and give damage to him/her of the ship itself. The player wins the battle if all three enemies are defeated or the enemy ship is destroyed.\n\nAs of December 31, 2000 the game was reported to have sold 19,799 copies in Japan. [ 3 ]",
    "tf_idf_text": "one piece become pirate king one piece wan psu mezase kaizoku japanexclusive actionstrategyrole playing game wonderswan first video game base one piece manga anime gol roger goru roj king pirate obtain wealth fame power people world execution announce left treasure one piece single place many pirate around world set sail grand line time period know great pirate era twenty year later young man know monkey luffy monk rufi finally set sea game base east blue saga first one piece film player must use playing card move around area order reach certain destination card contain type pathway number space player move along way surprise enemy attack deal use pathway reach opponent stand give damage himher ship player win battle three enemy defeat enemy ship destroy december game report sell copy japan"
}