{
    "title": "en.wikipedia.org_wiki_Wanted!_Eiichiro_Oda_Before_One_Piece",
    "url": "https://en.wikipedia.org/wiki/Wanted!_Eiichiro_Oda_Before_One_Piece",
    "transformers_text": "Wanted! Eiichiro Oda Short Stories ( Japanese : WANTED! 尾田栄一郎短編集 , Hepburn : WANTED! Oda Eiichirō Tanhenshū ) is a single volume manga anthology collection of five short stories written and illustrated by Eiichiro Oda , published by Shueisha in November 1998. The stories include Wanted! , Oda's first professional work, which won a second prize Tezuka Award in 1992 when he was 17 years old, and two stories that tie into Oda's best-known work, One Piece : Monsters , retroactively included as a precursor, and Romance Dawn , which developed characters and concepts. The collection was licensed by Viz Media and published in November 2024 as Wanted! Eiichiro Oda Before One Piece with an English translation by Stephen Paul.\n\nGill Bastar , a young gunman in the American western frontier , attracts the notice of a bounty hunter , but after Bastar shoots him dead in self-defense, the bounty hunter's ghost haunts and possesses Bastar. Eventually, the ghost forces Bastar to reveal himself to notorious hitman Sino Phoenix and during the ensuing duel, Bastar prevails.\n\nWatching Branco the pickpocket plying his trade infuriates God, so He decides to strike him down with a meteorite, sealing his fate by writing it in His notebook. However, He mistakenly writes down that \"Branch\", a major department store, will be struck instead, so He forces Branco to act as his agent and evacuate Branch, using Branco's unique skills.\n\n\"Brave and talented\" wandering monk Guko is chased by a spirit and seeks shelter at sundown in a village whose residents beg him to vanquish a man-eating monster. When he visits the nearby shrine, he is frightened by a 300-year-old guardian spirit and after calming down, explains that he is seeking his master, who disappeared five years ago while fighting ghosts. He sneaks away out of cowardice and when he encounters the actual man-eater, learns that it ate his master, Koshin. Seizing the deity's sword, he cuts the monster in two.\n\nAfter getting a free meal from Flair the waitress, Ryuma , a wandering samurai, declares his gratitude; she is disgusted when he takes offense at an insignificant slight and duels Shirano, renowned as one of the greatest swordsmen in the world, second only to a man named King. Seven years ago, she was rescued by Shirano as the sole survivor of a dragon attack on her village. Outside the cafe, Ryuma runs into third-rate swordsman D.R., who accuses Ryuma of stabbing him and blows a horn to summon a dragon. D.R. and Shirano actually are thieves who robbed Flair's village and used the horn to conceal the evidence. Ryuma strikes them down and slays the dragon, revealing himself as King.\n\nMonsters was published digitally in English in January 2024, preceding the paperback collection. [ 1 ] This coincided with the release of an animated adaptation, Monsters: 103 Mercies Dragon Damnation .\n\nMonkey D. Luffy saves the wounded roc Balloon and before long is taken aboard a massive pirate ship where he meets Ann, Balloon's owner, held captive by the ship's captain, Spiel the Hexagon. Spiel imprisons Luffy, but Luffy's abilities, powered by the gum-gum devil fruit, allow him to escape easily. He had been drifting on the ocean seeking fellow \"peace-main\" pirates like his grandfather, who seek adventure and prey on \"morganeers\" like Spiel, pirates who attack and pillage the innocent. After nearly drowning, he frees Ann, defeats Spiel, and saves Balloon.\n\nOda wrote two versions of Romance Dawn prior to the debut of One Piece ; the version published in Wanted! is the second, which Oda explains is more concise than the first in an afternote. : 202 This version was adapted into an animated episode which debuted as episode 907 in October 2019 , celebrating the 20th anniversary of the One Piece anime. [ 2 ]\n\nA panel review for Anime News Network resulted in mixed opinions; the three reviewers agreed the collection of Oda's early works is interesting as an exhibit of his first works, but the stories themselves were not generally engaging. [ 3 ] In the United States, it was the seventh best-selling manga volume in November 2024. [ 4 ]",
    "tf_idf_text": "want eiichiro oda short story japanese want hepburn want oda eiichir tanhensh single volume manga anthology collection five short story write illustrated eiichiro oda publish shueisha november story include wanted odas first professional work second prize tezuka award year old two story tie odas bestknown work one piece monster retroactively include precursor romance dawn develop character concept collection license viz medium publish november wanted eiichiro oda one piece english translation stephen paul gill bastar young gunman american western frontier attracts notice bounty hunter bastar shoot dead selfdefense bounty hunter ghost haunt possesses bastar eventually ghost force bastar reveal notorious hitman sino phoenix ensue duel bastar prevail watch branco pickpocket ply trade infuriates god decide strike meteorite seal fate writing notebook however mistakenly write branch major department store struck instead force branco act agent evacuate branch use brancos unique skill brave talented wander monk guko chase spirit seek shelter sundown village whose resident beg vanquish maneating monster visit nearby shrine frightened yearold guardian spirit calm explains seek master disappear five year ago fight ghost sneaks away cowardice encounter actual maneater learns eat master koshin seize deitys sword cut monster two get free meal flair waitress ryuma wander samurai declares gratitude disgust take offense insignificant slight duel shirano renowned one great swordsmen world second man name king seven year ago rescue shirano sole survivor dragon attack village outside cafe ryuma run thirdrate swordsman accuses ryuma stab blow horn summon dragon shirano actually thieve robbed flairs village use horn conceal evidence ryuma strike slay dragon reveal king monster publish digitally english january precede paperback collection coincide release animate adaptation monster mercy dragon damnation monkey luffy save wound roc balloon long take aboard massive pirate ship meet ann balloon owner hold captive ship captain spiel hexagon spiel imprisons luffy luffys ability power gumgum devil fruit allow escape easily drift ocean seek fellow peacemain pirate like grandfather seek adventure prey morganeers like spiel pirate attack pillage innocent nearly drown free ann defeat spiel save balloon oda write two version romance dawn prior debut one piece version publish want second oda explains concise first afternote version adapt animated episode debut episode october celebrate anniversary one piece anime panel review anime news network result mixed opinion three reviewer agree collection odas early work interesting exhibit first work story not generally engage united state seventh bestselling manga volume november"
}