{
    "title": "en.wikipedia.org_wiki_One_Piece_(video_game)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_(video_game)",
    "transformers_text": "One Piece , also referred to as Shonen Jump's One Piece , is a side-scrolling beat 'em up game for the Game Boy Advance . It is based on the One Piece anime series . Developed by Dimps and published by Bandai America's games division , it was released on September 7, 2005. It is the only One Piece game to be released exclusively in North America , and the first of two to not see a release in Japan. Due to being an American-only title released while 4Kids Entertainment was involved in the dubbing and localization of the anime , there are a few discrepancies compared to the canon material, matching 4Kids' edits and changes of the anime.\n\n\"Follow the adventures of Monkey D. Luffy and the Straw Hat Pirates and explore the Grand Line in search of the famed treasure, the \"One Piece!\" Use your stretchy Gum-Gum abilities to defeat marines and other pirates of the sea that you encounter on your journey!\" [ 2 ]\n\nSimilar to the first One Piece video game, One Piece: Become the Pirate King! , the main game covers the East Blue Saga.\n\nControl Monkey D. Luffy through platformer styled levels, with a one button masher combo system. Roronoa Zoro and other crew members can be used as summons and a total of 15 characters appear in the story mode. There are 12 different bosses, including Buggy and Smoker. Items that appear in the manga and anime are used as collectable treasure, which the player can revisit after initially clearing a stage. The stages also have interactive environment objects. [ 2 ]\n\nThis game uses some assets from the WonderSwan Color game One Piece Grand Battle: Swan Colosseum , a Japan-only title. [ citation needed ]\n\nThe game was met with positive to average reception upon release, as GameRankings gave it a score of 72.30%, [ 3 ] while Metacritic gave it 76 out of 100. [ 4 ]",
    "tf_idf_text": "one piece also refer shonen jump one piece sidescrolling beat game game boy advance base one piece anime series develop dimps publish bandai americas game division release september one piece game release exclusively north america first two not see release japan due americanonly title release kid entertainment involve dub localization anime discrepancy compare canon material match kid edits change anime follow adventure monkey luffy straw hat pirate explore grand line search famed treasure one piece use stretchy gumgum ability defeat marine pirate sea encounter journey similar first one piece video game one piece become pirate king main game cover east blue saga control monkey luffy platformer style level one button masher combo system roronoa zoro crew member use summons total character appear story mode different boss include buggy smoker item appear manga anime use collectable treasure player revisit initially clear stage stage also interactive environment object game use asset wonderswan color game one piece grand battle swan colosseum japanonly title citation need game meet positive average reception upon release gamerankings give score metacritic give"
}