{
    "title": "581 3 \"The Straw Hats Stunned! Enter: A Samurai's Horrifying Severed Head!\"Transliteration: \"Ichimi Sōzen! Shōgeki no Kubi dake Samurai Tōjō!\" (Japanese:一味騒然！衝撃の首だけ侍登場！) Hiroaki Miyamoto Yoshiyuki Suga January 20, 2013(2013-01-20) September 11, 2022",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "581 3 \"The Straw Hats Stunned! Enter: A Samurai's Horrifying Severed Head!\"Transliteration: \"Ichimi Sōzen! Shōgeki no Kubi dake Samurai Tōjō!\" (Japanese:一味騒然！衝撃の首だけ侍登場！) Hiroaki Miyamoto Yoshiyuki Suga January 20, 2013(2013-01-20) September 11, 2022\n\nLuffy, Zoro, Usopp, and Robin stand near the dead dragon that Zoro killed, with Luffy trying to pull out the man who is stuck in the dragon's back. Luffy succeeds by pulling out only the legs, making everyone think that he killed the man. However, the legs are alive, and they run away trying to look for a Warlord. Luffy runs after him and gets stuck to the legs after they fall on top of him. Elsewhere, the captured Straw Hats (Sanji, Nami, Chopper, and Franky) are in a prison cell and are shown to a gaseous figure known as \"Master\" who is very interested in Franky. They wake up minutes later in the cell and try to figure out how to get out. They then see a man's head which was cut into pieces and put it together. The head is alive, and it tells them that his body was cut into pieces by a Warlord, and he feels shameful for not getting killed after getting sliced. Back with Luffy's group, Usopp sees a harpy girl on top of a burned down building, but after he yells for everyone to look, she disappears. They then approach a lake that separates the fiery and icy halves of Punk Hazard. Luffy befriends a centaur that thought that Luffy was one of his kind. The people of Punk Hazard who work for Master see Luffy's group and tell the harpy girl about them.",
    "tf_idf_text": "straw hat stun enter samurais horrifying sever headtransliteration ichimi szen shgeki kubi dake samurai japanese hiroaki miyamoto yoshiyuki suga january september luffy zoro usopp robin stand near dead dragon zoro kill luffy try pull man stick dragon back luffy succeed pull leg make everyone think kill man however legs alive run away try look warlord luffy run get stuck legs fall top elsewhere capture straw hat sanji nami chopper franky prison cell show gaseous figure know master interested franky wake minute later cell try figure get see man head cut piece put together head alive tell body cut piece warlord feel shameful not get kill get slice back luffys group usopp see harpy girl top burn build yell everyone look disappear approach lake separate fiery icy half punk hazard luffy befriend centaur think luffy one kind people punk hazard work master see luffys group tell harpy girl"
}