{
    "title": "585 7 \"The Warlord! Trafalgar Law!\"Transliteration: \"Shichibukai! Torafarugā Rō\" (Japanese:七武海！トラファルガー・ロー) Directed by:Takahiro ImamuraStoryboarded by:Naotoshi Shida Tomohiro Nakayama February 17, 2013(2013-02-17) October 2, 2022",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "585 7 \"The Warlord! Trafalgar Law!\"Transliteration: \"Shichibukai! Torafarugā Rō\" (Japanese:七武海！トラファルガー・ロー) Directed by:Takahiro ImamuraStoryboarded by:Naotoshi Shida Tomohiro Nakayama February 17, 2013(2013-02-17) October 2, 2022\n\nChopper and Nami try to escape with the children and enter a cold room filled with frozen people. Meanwhile, Sanji and Franky defeat the hazmat-suited enemies. Sanji considers killing the samurai for mocking his mercy, then they rush to find Nami, Chopper, and the kids. Luffy, Zoro, Usopp, and Robin are attacked by Brownbeard and the centaurs, but Zoro destroys their cannons while Luffy deflects the rest. Brownbeard orders his men to target the water, but the Straw Hats escape by paddling away. Brook, fleeing from the samurai's torso, watches it get trapped in a snowball rolling toward a lake. Elsewhere, Smoker and Tashigi review a transmission from Luffy and the centaur, supposedly from Punk Hazard. Law claims it's fake, reminding them that the Marines often forge transmissions in order to catch pirates. Sanji's group reaches the exterior of the lab and spots Law, Smoker, Tashigi, and the G-5 Marines. Sanji tells everyone to run. Chopper and Nami suspect Law is responsible for imprisoning the children. Tashigi orders the G-5 to pursue them. Law declares that he won't let the Marines escape and lifts their ship using his Devil Fruit ability. As tensions rise, Smoker warns his men they can't defeat Law and prepares to fight him himself.",
    "tf_idf_text": "warlord trafalgar lawtransliteration shichibukai torafarug japanese direct bytakahiro imamurastoryboarded bynaotoshi shida tomohiro nakayama february october chopper nami try escape child enter cold room fill frozen people meanwhile sanji franky defeat hazmatsuited enemy sanji considers kill samurai mock mercy rush find nami chopper kid luffy zoro usopp robin attack brownbeard centaur zoro destroys cannon luffy deflects rest brownbeard order men target water straw hat escape paddle away brook flee samurais torso watch get trap snowball roll toward lake elsewhere smoker tashigi review transmission luffy centaur supposedly punk hazard law claim fake remind marine often forge transmission order catch pirate sanjis group reach exterior lab spot law smoker tashigi marine sanji tell everyone run chopper nami suspect law responsible imprison child tashigi order pursue law declare wont let marine escape lift ship use devil fruit ability tension rise smoker warns men cant defeat law prepares fight"
}