{
    "title": "586 8 \"In a Real Pinch! Luffy Sinks into the Ice-cold Lake!\"Transliteration: \"Dai Pinchi - Rufi Gokkan no Mizuumi ni Shizumu\" (Japanese:大ピンチ ルフィ極寒の湖に沈む) Katsumi Tokoro Jin Tanaka March 3, 2013(2013-03-03) October 2, 2022",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "586 8 \"In a Real Pinch! Luffy Sinks into the Ice-cold Lake!\"Transliteration: \"Dai Pinchi - Rufi Gokkan no Mizuumi ni Shizumu\" (Japanese:大ピンチ ルフィ極寒の湖に沈む) Katsumi Tokoro Jin Tanaka March 3, 2013(2013-03-03) October 2, 2022\n\nLuffy, Zoro, Usopp and Robin try to get to the frozen side of Punk Hazard, but their ship gets capsized by Brownbeard. As Brownbeard's troops prepare to attack them again, Zoro gets ready to destroy their bullets, but gets dragged down by sharks. At the last second, Brook saves Zoro and defeats Brownbeard's shooters. Once Luffy and the gang get out of the freezing water after killing the sharks, they opt to take the centaur's warm coats. Having realized that the Straw Hats are fighting them, Brownbeard orders an immediate retreat, only to be stopped by Luffy, Zoro, and Robin. Meanwhile, the other Straw Hats attempt to go back into the building to find another escape route, but their \"hearts\" get switched by Law making them swap bodies: Franky in Chopper's, Chopper in Sanji's, Nami in Franky's and Sanji in Nami's, with Sanji overjoyed to have big breasts. Law then returns his attention to the marines and destroys their ship. The G-5 marines attempt to contact marine headquarters about Law, but he takes away all their Transponder Snails. Smoker then fights Law and warns his men to stay back from the fight to not get cut to pieces (which they do) by Law's Op-Op Fruit powers. Feeling useless in the situation, Tashigi attempts to strike the Warlord but is promptly bisected.",
    "tf_idf_text": "real pinch luffy sink icecold laketransliteration dai pinchi rufi gokkan mizuumi shizumu japanese katsumi tokoro jin tanaka march october luffy zoro usopp robin try get frozen side punk hazard ship get capsize brownbeard brownbeards troop prepare attack zoro get ready destroy bullet get drag shark last second brook save zoro defeat brownbeards shooter luffy gang get freezing water kill shark opt take centaur warm coat realize straw hat fight brownbeard order immediate retreat stop luffy zoro robin meanwhile straw hat attempt back building find another escape route heart get switched law make swap body franky chopper chopper sanjis nami frankys sanji namis sanji overjoyed big breast law return attention marine destroy ship marine attempt contact marine headquarters law take away transponder snail smoker fight law warn men stay back fight not get cut piece law opop fruit power feel useless situation tashigi attempt strike warlord promptly bisect"
}