{
    "title": "594 16 \"Formed! Luffy and Law's Pirate Alliance!\"Transliteration: \"Kessei! Rufi to Rō Kaizoku Dōmei!\" (Japanese:結成！ルフィ・ロー海賊同盟！) Directed by: Ayako HiraikeStoryboarded by:Kenji Yokoyama Tomohiro Nakayama May 5, 2013(2013-05-05) November 6, 2022",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "594 16 Formed Luffy and Law's Pirate Alliance Transliteration Kes sei Ru fi to R Kai z oku D mei Japanese Directed by Aya ko Hira ike Story boarded by Kenji Yokoyama Tomohiro Nakayama May 5 2013 2013 05 05 November 6 2022 Luffy and Law agree on an alliance the rest of the Straw Hats disapprove while Robin approves even if she warns Luffy about a possible betrayal in a pirate alliance Law returns Franky and Chopper back to their bodies while Nami ends up in Sanji's body because Sanji is far away with Zoro and Brook Law tells them that they can't go back once things start moving for example capturing Caesar Clown who has the Gas Gas Fruit He warns them that he is highly dangerous therefore they need Hak i users to beat him Luffy says that the Hak i users there are him Law Zoro and Sanji The marines are continuing their fight against Caesar's men The three centaurs open the door and see a big glop of Slime that seeps out poison gas most of them die and two survive so they run as it chases them Caesar calls the pet slime monster Smiley and says that the Straw Hats and the G 5 marines are being used as test subjects for it",
    "tf_idf_text": "form luffy law pirate alliance transliteration kes sei kai oku mei japanese direct aya hira ike story board kenji yokoyama tomohiro nakayama may november luffy law agree alliance rest straw hat disapprove robin approves even warn luffy possible betrayal pirate alliance law return franky chopper back body nami end sanjis body sanji far away zoro brook law tell cant back thing start move example capture caesar clown gas gas fruit warn highly dangerous therefore need hak user beat luffy say hak user law zoro sanji marine continue fight caesar men three centaur open door see big glop slime seep poison gas die two survive run chase caesar call pet slime monster smiley say straw hat marine use test subject"
}