{
    "title": "596 18 \"On the Verge of Annihilation! A Deadly Monster Comes Flying In!\"Transliteration: \"Zenmetsu no Kiki - Shi no Monsutā Hirai\" (Japanese:全滅の危機 死のモンスター飛来) Directed by:Takahiro ImamuraStoryboarded by:Kōhei Kureta[ja] Shōji Yonemura May 19, 2013(2013-05-19) November 20, 2022",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "596 18 \"On the Verge of Annihilation! A Deadly Monster Comes Flying In!\"Transliteration: \"Zenmetsu no Kiki - Shi no Monsutā Hirai\" (Japanese:全滅の危機 死のモンスター飛来) Directed by:Takahiro ImamuraStoryboarded by:Kōhei Kureta[ja] Shōji Yonemura May 19, 2013(2013-05-19) November 20, 2022\n\nLuffy declares that he will capture Caesar. Law says he will deal with Monet while Chopper tries to find an antidote. Luffy and his group try to find the entrance to lab. Tashigi and Smoker attack Luffy, with Smoker gaining an advantage until Luffy uses Gear Second and tells Smoker to fight him later when he is at full strength. Back in the lab, the children start to wake up until Usopp puts them to sleep again. They then see pieces of Smiley falling onto the stolen warship. Franky, not being able to find an entrance, uses his Radical Beam to make an opening. The Marines try attacking it but discover that it emits poison gas when they touch it. One of them tries to burn it but it explodes when it catches on fire, destroying the ship. Back in the burning lands, Zoro, Sanji, Brook and The Samurai see Smiley shooting pieces of itself across the lake. Caesar then appears on top of the lab, explaining that Smiley was his experiment and that it is weak against water which is why it is shooting itself across the lake. After his speech, Luffy jumps up and grabs him.",
    "tf_idf_text": "verge annihilation deadly monster come fly intransliteration zenmetsu kiki shi monsut hirai japanese direct bytakahiro imamurastoryboarded bykhei kuretaja shji yonemura may november luffy declares capture caesar law say deal monet chopper try find antidote luffy group try find entrance lab tashigi smoker attack luffy smoker gain advantage luffy use gear second tell smoker fight later full strength back lab child start wake usopp put sleep see piece smiley fall onto steal warship franky not able find entrance us radical beam make open marine try attack discover emits poison gas touch one try burn explodes catch fire destroy ship back burn land zoro sanji brook samurai see smiley shoot piece across lake caesar appear top lab explain smiley experiment weak water shoot across lake speech luffy jump grab"
}