{
    "title": "597 19 \"An Intense Battle! Caesar Exercises His True Power!\"Transliteration: \"Dai-Gekisen - Shīzā Shin no Nōryoku Hatsudō!\" (Japanese:大激戦 シーザー真の能力発動！) Aya Komaki Yoshiyuki Suga May 26, 2013(2013-05-26) December 4, 2022",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "597 19 \"An Intense Battle! Caesar Exercises His True Power!\"Transliteration: \"Dai-Gekisen - Shīzā Shin no Nōryoku Hatsudō!\" (Japanese:大激戦 シーザー真の能力発動！) Aya Komaki Yoshiyuki Suga May 26, 2013(2013-05-26) December 4, 2022\n\nSanji, Kin'emon, Brook and Zoro see Smiley. Brook talks about a story about slime eating the clothes off of women making everyone act perverted except for Zoro, who points out that the slime is killing the fish in the lake, prompting Sanji to jump in to find the samurai's torso. Law tells Monet to take a walk with him while Chopper is left in the lab to find the antidote. Luffy faces off against Caesar who uses his Gas Robe attack until he discovers that Luffy is immune to poison. Caesar then uses his Gastanets and Smiley to injure Luffy who then grabs Caesar. Caesar then knocks Luffy out with an unknown ability. Robin, Franky, Tashigi and Smoker get knocked out as well. Law and Monet are walking down a hallway and encounter a mysterious figure who causes Law to break down in pain while the mysterious figure tells him that it has been a long time since they last met.",
    "tf_idf_text": "intense battle caesar exercise true powertransliteration daigekisen shz shin nryoku hatsud japanese aya komaki yoshiyuki suga may december sanji kinemon brook zoro see smiley brook talk story slime eat clothes woman make everyone act pervert except zoro point slime kill fish lake prompt sanji jump find samurais torso law tell monet take walk chopper leave lab find antidote luffy face caesar us gas robe attack discovers luffy immune poison caesar use gastanets smiley injure luffy grab caesar caesar knock luffy unknown ability robin franky tashigi smoker get knock well law monet walk hallway encounter mysterious figure cause law break pain mysterious figure tell long time since last met"
}