{
    "title": "599 21 \"Shocking! The True Identity of the Mystery Man Vergo!\"Transliteration: \"Shōgeki! Nazo no Otoko Verugo no Shōtai!\" (Japanese:衝撃！謎の男ヴェルゴの正体！) Yoshihiro Ueda Jin Tanaka June 9, 2013(2013-06-09) December 18, 2022",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "599 21 \"Shocking! The True Identity of the Mystery Man Vergo!\"Transliteration: \"Shōgeki! Nazo no Otoko Verugo no Shōtai!\" (Japanese:衝撃！謎の男ヴェルゴの正体！) Yoshihiro Ueda Jin Tanaka June 9, 2013(2013-06-09) December 18, 2022\n\nWhile punishing Law, Vergo is revealed to be the G-5 Marine Base commander. On another island, rude G-5 Marines dismiss citizens searching for missing children, claiming they died at sea based on false information given to them by Vergo, who was covering up their kidnapping as they were in actuality taken to Caesar Clown's lab. Nami and Usopp struggle to help the children through their withdrawal symptoms until Caesar appears and lures them back with drug-laced candy. Meanwhile, Zoro's group faces Smiley, who becomes enraged at Kin'emon for damaging its body and escalates its attacks, forcing them to retreat toward the lab. Luffy, Law, Robin, Franky, Tashigi, and Smoker awaken in a prison cell, where they confront Vergo and Monet. Caesar's men seal off the lab, trapping the G-5 Marines outside with Smiley. Inside, Monet and Vergo discuss Caesar's vague plans. Smoker protests that the G-5 soldiers will die if nothing is done, but Vergo, unconcerned, reveals his true allegiance. Smoker realizes Vergo covered up the child abductions. Law exposes Vergo's past as a pirate and his double agent position for the underworld broker \"Joker\". When Vergo threatens to kill Tashigi and Smoker to protect his secret, Law reveals Joker's true identity: the Warlord Donquixote Doflamingo.",
    "tf_idf_text": "shock true identity mystery man vergotransliteration shgeki nazo otoko verugo shtai japanese yoshihiro ueda jin tanaka june december punish law vergo reveal marine base commander another island rude marine dismiss citizen search miss child claim die sea base false information give vergo cover kidnap actuality take caesar clown lab nami usopp struggle help child withdrawal symptom caesar appear lure back druglaced candy meanwhile zoros group face smiley becomes enrage kinemon damaging body escalate attack force retreat toward lab luffy law robin franky tashigi smoker awaken prison cell confront vergo monet caesar men seal lab trap marine outside smiley inside monet vergo discus caesar vague plan smoker protest soldier die nothing do vergo unconcerned reveals true allegiance smoker realize vergo cover child abduction law expose vergos past pirate double agent position underworld broker joker vergo threaten kill tashigi smoker protect secret law reveal joker true identity warlord donquixote doflamingo"
}