{
    "title": "600 22 \"Save the Children! The Master's Evil Hands Close In!\"Transliteration: \"Kodomo-tachi o Mamore! Semaru Masutā no Ma no Te\" (Japanese:子供達を守れ！迫るMの魔の手) Ayako Hiraike Shōji Yonemura June 16, 2013(2013-06-16) January 8, 2023",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "600 22 \"Save the Children! The Master's Evil Hands Close In!\"Transliteration: \"Kodomo-tachi o Mamore! Semaru Masutā no Ma no Te\" (Japanese:子供達を守れ！迫るMの魔の手) Ayako Hiraike Shōji Yonemura June 16, 2013(2013-06-16) January 8, 2023\n\nAs Luffy and Law remain captive in Caesar's lab along with the others who were captured, Caesar Clown goes to retrieve the children from the remaining Straw Hats. Meanwhile, Zoro's group are still running from the slime monster who had finally transferred itself to the ice lands, causing all of its pieces to converge together. At the ruined Lab, Usopp and Nami were confronted by Caesar who mercilessly suffocated them the same way he did to Luffy but was interrupted by the revived Brownbeard, who demanded his crew back. However, Caesar beats him and proceeds to do the same to the two escaping Straw Hats. With the children secured and returning to the lab, Caesar Clown sent orders to Monet to prepare the Transponder Snail to broadcast his \"special experiment\" to all known brokers to show them his weapon of mass destruction, among the viewers were the two supernovas, Eustass Kid and Killer.",
    "tf_idf_text": "save child master evil hand close intransliteration kodomotachi mamore semaru masut japanesem ayako hiraike shji yonemura june january luffy law remain captive caesar lab along others capture caesar clown go retrieve child remain straw hat meanwhile zoros group still run slime monster finally transfer ice land cause piece converge together ruin lab usopp nami confront caesar mercilessly suffocate way luffy interrupt revive brownbeard demand crew back however caesar beat proceed two escape straw hat child secure return lab caesar clown send order monet prepare transponder snail broadcast special experiment know broker show weapon mass destruction among viewer two supernovas eustass kid killer"
}