{
    "title": "601 23 \"Shaking Up the New World! Caesar's Horrendous Experiment!\"Transliteration: \"Shin Sekai Gekishin - Shīzā Akumu no Jikken\" (Japanese:新世界激震 シーザー悪夢の実験) Directed by:Takahiro ImamuraStoryboarded by:Keiji Gotoh Tomohiro Nakayama June 23, 2013(2013-06-23) January 15, 2023",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "601 23 \"Shaking Up the New World! Caesar's Horrendous Experiment!\"Transliteration: \"Shin Sekai Gekishin - Shīzā Akumu no Jikken\" (Japanese:新世界激震 シーザー悪夢の実験) Directed by:Takahiro ImamuraStoryboarded by:Keiji Gotoh Tomohiro Nakayama June 23, 2013(2013-06-23) January 15, 2023\n\nAt the lab, the G-5 Marine soldiers are banging on the door, demanding entry. Meanwhile, the children were returned to the Lab where Caesar ordered his subordinates to make sure they didn't escape again. However, Mocha begins to regain her senses, seeing Caesar's subordinates as monsters. Within Caesar's private quarters, Vergo and Monet are waiting for Caesar's return. As soon as he arrived, he revealed that he made a deal with Law in the past to give his heart to him, and in exchange, he would get to keep Monet's. He shows Law that Vergo is now in possession of his heart while he himself has Smoker's heart, but before he tortures him, Monet informs Caesar that the broadcast is ready. In the broadcast, it is shown that a very large candy is being offered to Smiley, which is a deadly weaponized gas known asShinokuni(The Land of the Dead). Caesar then ordered the men who brought the candy to quickly return to the Lab. As Zoro's Group is being chased by Smiley, the poison beast sees the candy and promptly swallows it, ignoring the false heartfelt words from Caesar. He then laughs as everyone watching the broadcast sees the creature behaving strangely.",
    "tf_idf_text": "shake new world caesars horrendous experimenttransliteration shin sekai gekishin shz akumu jikken japanese direct bytakahiro imamurastoryboarded bykeiji gotoh tomohiro nakayama june january lab marine soldier bang door demand entry meanwhile child return lab caesar order subordinate make sure didnt escape however mocha begin regain sens see caesar subordinate monster within caesar private quarter vergo monet wait caesar return soon arrive reveal make deal law past give heart exchange would get keep monet show law vergo possession heart smoker heart torture monet informs caesar broadcast ready broadcast show large candy offer smiley deadly weaponize gas know asshinokunithe land dead caesar order men bring candy quickly return lab zoros group chase smiley poison beast see candy promptly swallow ignore false heartfelt word caesar laugh everyone watch broadcast see creature behave strangely"
}