{
    "title": "602 24 \"The Deadliest Weapon of Mass Destruction in History! Land of the Dead!\"Transliteration: \"Shijō Saiaku no Satsuriku Heiki! Shinokuni\" (Japanese:史上最悪の殺戮兵器！シノクニ) Takashi Ōtsuka Yoshiyuki Suga June 30, 2013(2013-06-30) January 22, 2023",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "602 24 \"The Deadliest Weapon of Mass Destruction in History! Land of the Dead!\"Transliteration: \"Shijō Saiaku no Satsuriku Heiki! Shinokuni\" (Japanese:史上最悪の殺戮兵器！シノクニ) Takashi Ōtsuka Yoshiyuki Suga June 30, 2013(2013-06-30) January 22, 2023\n\nAfter Smiley swallows the over-sized candy, the candy coat dissolves revealing a special drug designed to convert the entire content of Smiley's body into a \"perfect\" weapon of destruction,Shinokuni. In the process, Smiley dies and in a sack of apples, an apple turns into a Devil Fruit. The beast's body transforms into poison gas spreading quickly throughout the island. Its lethal power was demonstrated when Caesar's men were caught in it, being petrified before the eyes of the Brokers and the captive Straw Hats. Zoro's team are seen desperately trying to outrun the approaching gas while Nami and Usopp help Brownbeard after their vicious attack by Caesar. At the Lab, Caesar reveals to his captives that they will get to experience the poison gas as well, moving them outside dangling in a cave. In spite of their situation, Law told Luffy that their original plan will still carry on and that it is time to strike back at Caesar.",
    "tf_idf_text": "deadly weapon mass destruction history land deadtransliteration shij saiaku satsuriku heiki shinokuni japanese takashi tsuka yoshiyuki suga june january smiley swallow oversized candy candy coat dissolve reveal special drug design convert entire content smiley body perfect weapon destructionshinokuni process smiley die sack apple apple turn devil fruit beast body transform poison gas spread quickly throughout island lethal power demonstrate caesar men catch petrified eye broker captive straw hat zoros team see desperately try outrun approach gas nami usopp help brownbeard vicious attack caesar lab caesar reveals captives get experience poison gas well move outside dangle cave spite situation law tell luffy original plan still carry time strike back caesar"
}