{
    "title": "604 26 \"Get to Building R! The Pirate Alliance's Great Advance!\"Transliteration: \"Mezase Āru-tō! Kaizoku Dōmei Kai-Shingeki!\" (Japanese:めざせR棟！海賊同盟快進撃！) Tetsuya Endō Jin Tanaka July 14, 2013(2013-07-14) February 12, 2023",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "604 26 \"Get to Building R! The Pirate Alliance's Great Advance!\"Transliteration: \"Mezase Āru-tō! Kaizoku Dōmei Kai-Shingeki!\" (Japanese:めざせR棟！海賊同盟快進撃！) Tetsuya Endō Jin Tanaka July 14, 2013(2013-07-14) February 12, 2023\n\nThe Straw Hats and Brownbeard escape into the lab but leave behind a hole, allowing the deadly gas ofShinokunito seep in. The G-5 Marines frantically seal it off with wood and metal as the gas spreads across the island. Brook uses his Devil Fruit power to scout outside as a soul and observes that the land now resembles the \"land of the dead\". Once composed, the G-5 Marines turn on the Straw Hats, preparing to arrest them. Nami demands that Law switch her and Sanji's bodies back to normal. Sanji privately refuses, but Law complies anyways and usesShamblesto return their hearts back where they belong. Nami, noticing she's now wearing a different coat since the original switch, punches Sanji for allegedly peeping. Law warns they have only two hours to escape and explains that the only safe exit is through passage R-66 in Room R. The Marines hesitate but follow orders once Smoker backs Law up. Smoker then tells Tashigi to lead the men and rescue the children while he goes to confront Vergo. Elsewhere, Caesar Clown celebrates what he assumes is a successful test ofShinokuni— until he discovers that the bodies he was expecting aren't there. He panics upon learning that the Straw Hats and G-5 Marines broke into the lab. As Luffy charges forward to fight Caesar, Zoro reminds him not to let his guard down in the New World.",
    "tf_idf_text": "get building pirate alliance great advancetransliteration mezase rut kaizoku dmei kaishingeki japaneser tetsuya end jin tanaka july february straw hat brownbeard escape lab leave behind hole allow deadly gas ofshinokunito seep marine frantically seal wood metal gas spread across island brook use devil fruit power scout outside soul observes land resembles land dead compose marine turn straw hat prepare arrest nami demand law switch sanjis body back normal sanji privately refuse law complies anyways usesshamblesto return heart back belong nami noticing shes wear different coat since original switch punch sanji allegedly peep law warn two hour escape explain safe exit passage room marine hesitate follow order smoker back law smoker tell tashigi lead men rescue child go confront vergo elsewhere caesar clown celebrates assumes successful test ofshinokuni discovers body expect arent panic upon learn straw hat marine break lab luffy charge forward fight caesar zoro remind not let guard new world"
}