{
    "title": "605 27 \"Tashigi's Tears! G-5's Desperate Breakthrough Plan!\"Transliteration: \"Tashigi no Namida - Jī-Faibu Kesshi no Toppa Sakusen\" (Japanese:たしぎの涙G5決死の突破作戦) Yoshihiro Ueda Tomohiro Nakayama July 21, 2013(2013-07-21) March 5, 2023",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "605 27 \"Tashigi's Tears! G-5's Desperate Breakthrough Plan!\"Transliteration: \"Tashigi no Namida - Jī-Faibu Kesshi no Toppa Sakusen\" (Japanese:たしぎの涙G5決死の突破作戦) Yoshihiro Ueda Tomohiro Nakayama July 21, 2013(2013-07-21) March 5, 2023\n\nCaesar Clown, incensed with the humiliation that his prisoners escaped and are inside his lab, orders the passage between building A and B to be closed and Shinokuni to be let in to kill the intruders. Vergo, however decided to take care of them himself. Chopper, who was eavesdropping, sneaks out and tries to find his way to the children within the labyrinth that is the lab. Luffy, Smoker and Law were the first to cross the gate before the alarm sounded, indicating the gate is beginning to close. Tashigi instead heard the alarm and quickly ordered the G-5 marines to let the Straw Hats go and hurry towards the closing gate. When a wall was blown up in building A, Shinokuni flows in petrifying some marines while the rest hasten their escape. The Straw Hats and most of the marines got through the gate safety but a few stayed behind to help Tashigi across before the gate closes, losing themselves to the poison gas while their captain watches in horror. Caesar, angered that they survived, promised that no one will escape this lab alive.",
    "tf_idf_text": "tashigis tear desperate breakthrough plantransliteration tashigi namida jfaibu kesshi toppa sakusen japaneseg yoshihiro ueda tomohiro nakayama july march caesar clown incensed humiliation prisoner escape inside lab order passage building close shinokuni let kill intruder vergo however decided take care chopper eavesdrop sneaks try find way child within labyrinth lab luffy smoker law first cross gate alarm sound indicate gate begin close tashigi instead hear alarm quickly order marine let straw hat hurry towards close gate wall blown build shinokuni flow petrify marine rest hasten escape straw hat marine get gate safety stay behind help tashigi across gate close lose poison gas captain watch horror caesar anger survive promised one escape lab alive"
}