{
    "title": "613 35 \"Showing Off His Techniques! Zoro's Formidable One-Sword Style!\"Transliteration: \"Ōgi Sakuretsu! Zoro Saikyō no Ittō-ryū!\" (Japanese:奥義炸裂！ゾロ最強の一刀流！) Yoshihiro Ueda Tomohiro Nakayama September 22, 2013(2013-09-22) April 23, 2023",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "613 35 \"Showing Off His Techniques! Zoro's Formidable One-Sword Style!\"Transliteration: \"Ōgi Sakuretsu! Zoro Saikyō no Ittō-ryū!\" (Japanese:奥義炸裂！ゾロ最強の一刀流！) Yoshihiro Ueda Tomohiro Nakayama September 22, 2013(2013-09-22) April 23, 2023\n\nMocha is still running away with the candy, and the kids are chasing her. Chopper, Nami, and Robin come to her and the children's aid. Then, G-5 and Sanji goes in their direction. At the Biscuit Room, Tashigi battles Monet alone after making Zoro stay out of it, due to believing through their past encounters that Zoro can't cut women. Believing that she found Zoro's weakness Monet continues her assault and almost breaks Tashigi's shoulder with her snow powers, but Zoro comes in and vertically splits Monet in half with a powerful One Sword Style technique, shocking both her and Tashigi. Despite being unable to reform due to her fear knowing Zoro would've killed her if he'd used Haki, Monet tries to use one-half of her body to attack Zoro from behind but is promptly cut down by Tashigi. At the bottom of the C building, Luffy barely manages to hold onto a small ledge and begins to climb out, carrying an unconscious Momonosuke up the chute.",
    "tf_idf_text": "show technique zoros formidable onesword styletransliteration sakuretsu zoro saiky ittry japanese yoshihiro ueda tomohiro nakayama september april mocha still run away candy kid chase chopper nami robin come childrens aid sanji go direction biscuit room tashigi battle monet alone make zoro stay due believe past encounter zoro cant cut woman believe find zoros weakness monet continue assault almost breaks tashigis shoulder snow power zoro come vertically splits monet half powerful one sword style technique shock tashigi despite unable reform due fear know zoro wouldve kill hed use haki monet try use onehalf body attack zoro behind promptly cut tashigi bottom building luffy barely manage hold onto small ledge begin climb carry unconscious momonosuke chute"
}