{
    "title": "613 35 \"Showing Off His Techniques! Zoro's Formidable One-Sword Style!\"Transliteration: \"Ōgi Sakuretsu! Zoro Saikyō no Ittō-ryū!\" (Japanese:奥義炸裂！ゾロ最強の一刀流！) Yoshihiro Ueda Tomohiro Nakayama September 22, 2013(2013-09-22) April 23, 2023",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "613 35 Showing Off His Techniques Zoro's Formidable One Sword Style Transliteration gi S a kure tsu Zoro Sai ky no It t ry Japanese Yoshihiro Ueda Tomohiro Nakayama September 22 2013 2013 09 22 April 23 2023 Mocha is still running away with the candy and the kids are chasing her Chopper Nami and Robin come to her and the children's aid Then G 5 and Sanji goes in their direction At the Biscuit Room T as hig i battles Monet alone after making Zoro stay out of it due to believing through their past encounters that Zoro can't cut women Believing that she found Zoro's weakness Monet continues her assault and almost breaks T as hig i's shoulder with her snow powers but Zoro comes in and vertically splits Monet in half with a powerful One Sword Style technique shocking both her and T as hig i Despite being unable to reform due to her fear knowing Zoro would've killed her if he'd used Hak i Monet tries to use one half of her body to attack Zoro from behind but is promptly cut down by T as hig i At the bottom of the C building Luffy barely manages to hold on to a small ledge and begins to climb out carrying an unconscious Momo no suke up the chute",
    "tf_idf_text": "show technique zoros formidable one sword style transliteration kure tsu zoro sai japanese yoshihiro ueda tomohiro nakayama september april mocha still run away candy kid chase chopper nami robin come childrens aid sanji go direction biscuit room hig battle monet alone make zoro stay due believe past encounter zoro cant cut woman believe find zoros weakness monet continue assault almost breaks hig shoulder snow power zoro come vertically splits monet half powerful one sword style technique shock hig despite unable reform due fear know zoro wouldve kill hed use hak monet try use one half body attack zoro behind promptly cut hig bottom building luffy barely manage hold small ledge begin climb carry unconscious momo suke chute"
}