{
    "title": "614 36 \"To Save Her Friends! Mocha Runs at the Risk of Her Life!\"Transliteration: \"Tomodachi o Mamoru! Mocha Inochi-gake no Tōsō\" (Japanese:友達を守る！モチャ命がけの逃走) Aya Komaki Shōji Yonemura September 29, 2013(2013-09-29) April 30, 2023",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "614 36 \"To Save Her Friends! Mocha Runs at the Risk of Her Life!\"Transliteration: \"Tomodachi o Mamoru! Mocha Inochi-gake no Tōsō\" (Japanese:友達を守る！モチャ命がけの逃走) Aya Komaki Shōji Yonemura September 29, 2013(2013-09-29) April 30, 2023\n\nMocha runs away with the candy while the children are on hot pursuit. Chopper, Nami and Robin try to fend off the children, but they manage to break through them making Mocha leave herself with no choice but to eat the candy. She eats the candy and Chopper watches in horror. Zoro and Tashigi are running away from the poisonous gas while Tashigi wake up and admires Zoro's sword, Shusui which he got from Ryuma at Thriller Bark. Chopper walks on over to Mocha to check and see if she is still alive and Mocha wanted to save her friends, so she sacrificed herself for them. In a flashback, Chopper is holding off the children by closing the door while Mocha is supposed to run away. Mocha hesitates to run off, but Chopper explains the situation to her. Luffy and Momonosuke finally got out of the garbage chute and immediately ran into Caesar's subordinates who quickly recognize Luffy. Luffy uses Conqueror's Haki to knock most of them out when they were about to attack them, and he asked one of them where Caesar is.",
    "tf_idf_text": "save friend mocha run risk lifetransliteration tomodachi mamoru mocha inochigake japanese aya komaki shji yonemura september april mocha run away candy child hot pursuit chopper nami robin try fend child manage break making mocha leave choice eat candy eat candy chopper watch horror zoro tashigi run away poisonous gas tashigi wake admires zoros sword shusui get ryuma thriller bark chopper walk mocha check see still alive mocha want save friend sacrifice flashback chopper hold child close door mocha suppose run away mocha hesitates run chopper explain situation luffy momonosuke finally get garbage chute immediately run caesar subordinate quickly recognize luffy luffy us conqueror haki knock attack ask one caesar"
}