{
    "title": "615 37 \"Brownbeard in Grief! Luffy Lands a Furious Blow!\"Transliteration: \"Chahige Hitsū! Rufi Ikari no Ichigeki\" (Japanese:茶ひげ悲痛！ルフィ怒りの一撃) Tetsuya Endō Hirohiko Kamisaka October 6, 2013(2013-10-06) May 7, 2023",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "615 37 \"Brownbeard in Grief! Luffy Lands a Furious Blow!\"Transliteration: \"Chahige Hitsū! Rufi Ikari no Ichigeki\" (Japanese:茶ひげ悲痛！ルフィ怒りの一撃) Tetsuya Endō Hirohiko Kamisaka October 6, 2013(2013-10-06) May 7, 2023\n\nZoro carries Tashigi away from the poisonous gas. Sanji and the G-5 marines continue to assist Chopper vaccinate the children. Usopp finds a door that leads to the room where Caesar and his subordinates are watching the Straw Hats and the Marines on a screen. Caesar notices Brownbeard on the screen and confronts him. Brownbeard tells Caesar that he wants to get his crew back, but Caesar tells him they were all killed by the poison gas. Brownbeard tries to warn Caesar's subordinates, but Caesar drugs him to keep him quiet. Caesar orders his subordinates to get rid of Brownbeard, and they fire at him. Luffy arrives just in time and punches Caesar, before asking him about the island. Caesar tells him Punk Hazard is not supposed to exist, and nobody is supposed to know what happens on that island. Vergo covers up any information about that island and anything that happens there – the SAD production is run by Doflamingo, and SAD produces SMILE, an artificial Zoan Devil Fruit. One of the Emperors is forming an army of people who have eaten these artificial fruits. Caesar challenges Luffy to dare pick a fight with such people, only for Luffy to punch Caesar, and tell him that he has been picking fights all along.",
    "tf_idf_text": "brownbeard grief luffy land furious blowtransliteration chahige hit rufi ikari ichigeki japanese tetsuya end hirohiko kamisaka october may zoro carry tashigi away poisonous gas sanji marine continue assist chopper vaccinate child usopp find door lead room caesar subordinate watch straw hat marines screen caesar notice brownbeard screen confronts brownbeard tell caesar want get crew back caesar tell kill poison gas brownbeard try warn caesar subordinate caesar drug keep quiet caesar order subordinate get rid brownbeard fire luffy arrive time punch caesar ask island caesar tell punk hazard not suppose exist nobody suppose know happen island vergo cover information island anything happen sad production run doflamingo sad produce smile artificial zoan devil fruit one emperor form army people eat artificial fruit caesar challenge luffy dare pick fight people luffy punch caesar tell pick fight along"
}