{
    "title": "616 38 \"A Surprising Outcome! White Hunter vs. Vergo!\"Transliteration: \"Shōgeki no Ketchaku! Sumōkā tai Verugo!\" (Japanese:衝撃の決着！白猟VSヴェルゴ！) Takashi Ōtsuka Yoshiyuki Suga October 13, 2013(2013-10-13) May 14, 2023",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "616 38 \"A Surprising Outcome! White Hunter vs. Vergo!\"Transliteration: \"Shōgeki no Ketchaku! Sumōkā tai Verugo!\" (Japanese:衝撃の決着！白猟VSヴェルゴ！) Takashi Ōtsuka Yoshiyuki Suga October 13, 2013(2013-10-13) May 14, 2023\n\nCaesar tells Luffy to not underestimate Doflamingo, but Luffy keeps on attacking Caesar. Smoker continues his fight with Vergo. The Straw Hats, G-5 marines and the children run from the gas and continue to head towards building R-66. Caesar's subordinates find Usopp and attempt to attack him. After being told Momonosuke turned into a dragon Kin'emon runs back to Building B, believing the dragon he and Brook killed was him with Brook trying to stop him as the room is now filled with poison gas. Vergo beats Smoker but Smoker manages to retrieve Law's heart and gives it back to him. Law tells Doflamingo he is going to defeat Vergo. Doflamingo tells Law to not underestimate Vergo because of his Haki. Vergo imbues Haki onto his whole body and attempts to kill Law but Law cuts him in half along with the SAD and the island. Law tells Doflamingo that he and the supernovas are going to be the leaders of the new era.",
    "tf_idf_text": "surprising outcome white hunter vergotransliteration shgeki ketchaku sumk tai verugo japanesevs takashi tsuka yoshiyuki suga october may caesar tell luffy not underestimate doflamingo luffy keep attack caesar smoker continue fight vergo straw hat marines child run gas continue head towards building caesar subordinate find usopp attempt attack tell momonosuke turn dragon kinemon run back build believing dragon brook kill brook try stop room fill poison gas vergo beat smoker smoker manages retrieve law heart give back law tell doflamingo go defeat vergo doflamingo tell law not underestimate vergo haki vergo imbues haki onto whole body attempt kill law law cut half along sad island law tell doflamingo supernova go leader new era"
}