{
    "title": "616 38 \"A Surprising Outcome! White Hunter vs. Vergo!\"Transliteration: \"Shōgeki no Ketchaku! Sumōkā tai Verugo!\" (Japanese:衝撃の決着！白猟VSヴェルゴ！) Takashi Ōtsuka Yoshiyuki Suga October 13, 2013(2013-10-13) May 14, 2023",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "616 38 A Surprising Outcome White Hunter vs Ver go Transliteration Sh geki no Ketch aku Sum k tai Ver ugo Japanese VS Takashi tsuka Yoshiyuki Suga October 13 2013 2013 10 13 May 14 2023 Caesar tells Luffy to not underestimate Do flamingo but Luffy keeps on attacking Caesar Smoker continues his fight with Ver go The Straw Hats G 5 marines and the children run from the gas and continue to head towards building R 66 Caesar's subordinates find Us opp and attempt to attack him After being told Momo no suke turned into a dragon Kin ' em on runs back to Building B believing the dragon he and Brook killed was him with Brook trying to stop him as the room is now filled with poison gas Ver go beats Smoker but Smoker manages to retrieve Law's heart and gives it back to him Law tells Do flamingo he is going to defeat Ver go Do flamingo tells Law to not underestimate Ver go because of his Hak i Ver go imbues Hak i on to his whole body and attempts to kill Law but Law cuts him in half along with the SAD and the island Law tells Do flamingo that he and the supernovas are going to be the leaders of the new era",
    "tf_idf_text": "surprising outcome white hunter ver transliteration geki ketch aku sum tai ver ugo japanese takashi tsuka yoshiyuki suga october may caesar tell luffy not underestimate flamingo luffy keep attack caesar smoker continue fight ver straw hat marines child run gas continue head towards building caesar subordinate find opp attempt attack tell momo suke turn dragon kin run back build believing dragon brook kill brook try stop room fill poison gas ver beat smoker smoker manages retrieve law heart give back law tell flamingo go defeat ver flamingo tell law not underestimate ver hak ver imbues hak whole body attempt kill law law cut half along sad island law tell flamingo supernova go leader new era"
}