{
    "title": "619 41 \"Running Wild! Invincible General Franky!\"Transliteration: \"Ō-abare! Muteki no Furankī Shōgun\" (Japanese:大暴れ！無敵のフランキー将軍) Aya Komaki Hirohiko Kamisaka November 3, 2013(2013-11-03) June 11, 2023",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "619 41 \"Running Wild! Invincible General Franky!\"Transliteration: \"Ō-abare! Muteki no Furankī Shōgun\" (Japanese:大暴れ！無敵のフランキー将軍) Aya Komaki Hirohiko Kamisaka November 3, 2013(2013-11-03) June 11, 2023\n\nFranky begins to attack the two Donquixote pirates who retaliate with Baby 5 turning into weapons with her Arms-Arms Fruit powers and Buffalo launching her at their robot foe. Caesar Clown regains consciousness and, after realizing his defeat remembers he still possesses Smoker's heart and prepares to stab it. Inside Room R, the Straw Hats and everyone else are waiting for their comrades to return with Mocha before riding the transport cart out of the collapsing building. They managed to reach the group at the same time Ussop returned with Sea Stone handcuffs and the former subordinates of Caesar Clown. Momonosuke however was shockingly alarmed to see his father petrified. In Dressrosa, Doflamingo sent his farewells to Vergo and Monet who survived her encounter with Tashigi and Zoro. Doflamingo then asks Monet to activate the island's self-destruct, but Monet tells him that she is already doing that. With the island's destruction in her hands, Monet says her goodbyes as she reaches for the switch. Moments later a massive explosion rocks the entire mountain base.",
    "tf_idf_text": "run wild invincible general frankytransliteration abare muteki furank shgun japanese aya komaki hirohiko kamisaka november june franky begin attack two donquixote pirate retaliate baby turn weapon armsarms fruit power buffalo launch robot foe caesar clown regain consciousness realize defeat remembers still possess smoker heart prepare stab inside room straw hat everyone else wait comrade return mocha rid transport cart collapse build manage reach group time ussop return sea stone handcuff former subordinate caesar clown momonosuke however shockingly alarmed see father petrify dressrosa doflamingo send farewell vergo monet survive encounter tashigi zoro doflamingo ask monet activate island selfdestruct monet tell already islands destruction hand monet say goodbye reach switch moment later massive explosion rock entire mountain base"
}