{
    "title": "620 42 \"A Critical Situation! Punk Hazard Explodes!\"Transliteration: \"Zettai Zetsumei! Panku Hazādo Dai-bakuhatsu\" (Japanese:絶体絶命！パンクハザード大爆発) Ayako Hiraike Jin Tanaka November 10, 2013(2013-11-10) June 18, 2023",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "620 42 \"A Critical Situation! Punk Hazard Explodes!\"Transliteration: \"Zettai Zetsumei! Panku Hazādo Dai-bakuhatsu\" (Japanese:絶体絶命！パンクハザード大爆発) Ayako Hiraike Jin Tanaka November 10, 2013(2013-11-10) June 18, 2023\n\nMonet is moments away from activating the self-destruct button when she feels her heart being stabbed and collapses. At the same time, Caesar Clown stabs the heart believing it to be Smoker's. The Straw Hats are still racing towards the exit of the collapsing lab when they feel the explosion of the SAD room and then seeShinokunion their trail. Smoker, seeing that they nearly reached safety, questions Trafalgar Law as to why he possessed his heart the whole time. Law reveals the clever deception he played on the mad scientist where he returned Monet's heart to Caesar without him knowing. At the tanker, Baby 5'sMissile Girlattack failed to take down theFranky Shogunand their duel continued whereas Buffalo contacted Doflamingo of the situation. After confirming that the island wasn't destroyed as intended, Doflamingo decided to tend to the matter himself and is seen somehow flying over the sea towards Punk Hazard.",
    "tf_idf_text": "critical situation punk hazard explodestransliteration zettai zetsumei panku hazdo daibakuhatsu japanese ayako hiraike jin tanaka november june monet moment away activate selfdestruct button feel heart stab collapse time caesar clown stab heart believe smoker straw hat still race towards exit collapse lab feel explosion sad room seeshinokunion trail smoker see nearly reach safety question trafalgar law possess heart whole time law reveals clever deception play mad scientist return monet heart caesar without know tanker baby smissile girlattack fail take thefranky shogunand duel continue whereas buffalo contact doflamingo situation confirm island wasnt destroy intend doflamingo decide tend matter see somehow fly sea towards punk hazard"
}