{
    "title": "621 43 \"Capture Caesar! General Cannon Blasts!\"Transliteration: \"Shīzā o Hokaku-seyo - Jeneraru Kyanon Sakuretsu\" (Japanese:シーザーを捕獲せよ将軍砲炸裂) Yoshihiro Ueda Yoshiyuki Suga November 17, 2013(2013-11-17) June 25, 2023",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "621 43 \"Capture Caesar! General Cannon Blasts!\"Transliteration: \"Shīzā o Hokaku-seyo - Jeneraru Kyanon Sakuretsu\" (Japanese:シーザーを捕獲せよ将軍砲炸裂) Yoshihiro Ueda Yoshiyuki Suga November 17, 2013(2013-11-17) June 25, 2023\n\nGeneral Franky puts up a good fight against Buffalo and Baby 5. He sends them flying away with aGeneral Cannon(a land-based version of the Sunny'sGoan Cannon), but the two refuse to stay defeated despite their injuries. The fight however was interrupted with the arrival of the mine cart filled with all of the lab escapees. Seeing that Law is allied with the enemy and that the odds are against them, the two decided to hightail out of Punk Hazard along with Caesar Clown in their possession. Before Law could stop them, Luffy told Law that Usopp and Nami would handle this. The two Straw Hats proved Luffy right as they easily stopped the fleeing pirates and succeeded in capturing Caesar Clown. Doflamingo is still flying toward Punk Hazard imagining what torture he would inflict on the brats. Meanwhile, on a giant penguin, a mysterious man is wondering which direction leads to Punk Hazard.",
    "tf_idf_text": "capture caesar general cannon blaststransliteration shz hokakuseyo jeneraru kyanon sakuretsu japanese yoshihiro ueda yoshiyuki suga november june general franky put good fight buffalo baby send fly away ageneral cannona landbased version sunnysgoan cannon two refuse stay defeat despite injury fight however interrupt arrival mine cart fill lab escape see law ally enemy odds two decide hightail punk hazard along caesar clown possession law could stop luffy tell law usopp nami would handle two straw hat prove luffy right easily stop flee pirate succeed capture caesar clown doflamingo still fly toward punk hazard imagining torture would inflict brat meanwhile giant penguin mysterious man wonder direction lead punk hazard"
}