{
    "title": "623 45 \"It's Time to Say Goodbye! Leaving Punk Hazard!\"Transliteration: \"Sekibetsu no Toki - Panku Hazādo Shukkō!\" (Japanese:惜別の時 パンクハザード出航！) Directed by:Takahiro ImamuraStoryboarded by:Kenji Yokoyama Tomohiro Nakayama December 1, 2013(2013-12-01) July 16, 2023",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "623 45 \"It's Time to Say Goodbye! Leaving Punk Hazard!\"Transliteration: \"Sekibetsu no Toki - Panku Hazādo Shukkō!\" (Japanese:惜別の時 パンクハザード出航！) Directed by:Takahiro ImamuraStoryboarded by:Kenji Yokoyama Tomohiro Nakayama December 1, 2013(2013-12-01) July 16, 2023\n\nThe Straw Hats, Kin'emon, Momonosuke, G-5, and the rescued children enjoy a lighthearted feast, while Law and Smoker talk privately. A flashback reveals Law and Luffy's true goal: to form an alliance and take down one of the Four Emperors, Kaido of the Beasts. As the Straw Hats prepare to leave, they say goodbye to the children. However, the G-5 Marines put up a barricade and insult the pirates, insisting that the children shouldn't admire them. Though the kids cry and beg to say goodbye, the Marines claim that if they stop the insults, they'll start liking the pirates — something they don't want. Tashigi protests but is overruled. Despite the harsh send-off, the children remain thankful towards the Straw Hats. Back on theThousand Sunny, Zoro questions why Law is joining them. Usopp explains that Luffy agreed to something that'll bring them trouble once again. Meanwhile, Doflamingo, flying through the sky, spots a life raft carrying the severed heads of Baby 5 and Buffalo, plus a Transponder Snail resembling Law. Through it, Law reveals they've taken Caesar Clown and warns Doflamingo that without Caesar, he can't produce SMILEs — which will anger Kaido and bring about his demise. Law demands that he resign his position as a Warlord by morning or end up losing Caesar permanently. Furious, Doflamingo curses Law as the call ends.",
    "tf_idf_text": "time say goodbye leave punk hazardtransliteration sekibetsu toki panku hazdo shukk japanese direct bytakahiro imamurastoryboarded bykenji yokoyama tomohiro nakayama december july straw hat kinemon momonosuke rescue child enjoy lighthearted feast law smoker talk privately flashback reveals law luffys true goal form alliance take one four emperor kaido beast straw hat prepare leave say goodbye child however marine put barricade insult pirate insist child shouldnt admire though kid cry beg say goodbye marine claim stop insult theyll start like pirate something dont want tashigi protest overrule despite harsh sendoff child remain thankful towards straw hat back thethousand sunny zoro question law join usopp explains luffy agree something thatll bring trouble meanwhile doflamingo fly sky spot life raft carry sever head baby buffalo plus transponder snail resemble law law reveals theyve take caesar clown warns doflamingo without caesar cant produce smile anger kaido bring demise law demand resign position warlord morning end lose caesar permanently furious doflamingo curse law call end"
}