{
    "title": "624 46 \"The G-5 Wiped Out! Doflamingo's Sudden Attack!\"Transliteration: \"Jī-Faibu Kaimetsu! Dofuramingo Kyūshū!\" (Japanese:G5壊滅！ドフラミンゴ急襲！) Masahiro Hosoda Jin Tanaka December 8, 2013(2013-12-08) July 23, 2023",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "624 46 The G 5 Wiped Out Do flamingo's Sudden Attack Transliteration J Fai bu Kai mets u Do fur amin go Ky sh Japanese G 5 Masahiro Ho soda J in Tanaka December 8 2013 2013 12 08 July 23 2023 On Punk Hazard Caesar's former minions go in search of those who were petrified by S hino kuni All of a sudden Do flamingo appears from the sky and throws Baby 5 and Buffalo's heads back on to their body Before any of the G 5 soldiers could attack Do flamingo used Conqueror's Hak i and knocked out a very large majority of them Even then the remaining soldier couldn't move because of his devil fruit powers Do flamingo even has some of the G 5 soldiers kill each other demanding the whereabouts of Law Smoker steps into the fight launching White Blow at Do flamingo As the fight progressed some G 5 soldiers decided to aid Smoker Do flamingo moved to confront the soldiers but his attack hit Smoker instead as he was moving to defend the soldiers and was severely injured On the Sunny Luffy asks why they are going to Dress rosa Law states he has business to attend to All of a sudden the sea currents start to shift at an angle as they slide down a sea slope After they get out of rough water Luffy explains to the crew about the alliance and the plan to kill Kai do Back on Punk Hazard Do flamingo is about to unleash the final blow on to Smoker Then Ku zan appears and asks Do flamingo to step aside as Smoker's friend",
    "tf_idf_text": "wipe flamingo sudden attack transliteration fai kai mets fur amin japanese masahiro soda tanaka december july punk hazard caesars former minion search petrify hino kuni sudden flamingo appear sky throw baby buffalos head back body soldier could attack flamingo use conqueror hak knock large majority even remain soldier couldnt move devil fruit power flamingo even soldier kill demand whereabouts law smoker step fight launch white blow flamingo fight progress soldier decide aid smoker flamingo move confront soldier attack hit smoker instead move defend soldier severely injured sunny luffy ask go dress rosa law state business attend sudden sea current start shift angle slide sea slope get rough water luffy explain crew alliance plan kill kai back punk hazard flamingo unleash final blow smoker zan appear ask flamingo step aside smoker friend"
}