{
    "title": "625 47 \"Intense! Aokiji vs. Doflamingo!\"Transliteration: \"Kinpaku! Aokiji tai Dofuramingo\" (Japanese:緊迫！青キジVSドフラミンゴ) Tetsuya Endō Yoshiyuki Suga December 15, 2013(2013-12-15) July 30, 2023",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "625 47 Intense Aoki ji vs Do flamingo Transliteration Kin pak u Aoki ji tai Do fur amin go Japanese VS Tetsuya End Yoshiyuki Suga December 15 2013 2013 12 15 July 30 2023 Do flamingo prepares to finish Smoker off but is stopped by Ku zan's ice which freezes everything around the Warlord including himself But he manages to break free from the ice before freezing completely After some talk Do flamingo leaves with Baby 5 and Buffalo back to Dress rosa as Ku zan asks for G 5 to treat Smoker After getting treated Smoker starts talking with Ku zan about the Marines and Underworld insinuating that the former Admiral has business unseen to the government At the Thousand Sunny Law tells some details about the recently formed pirate alliance which makes some of them afraid of being targeted by an Emperor due to holding Caesar Clown captive After having some fun Momo no suke is introduced to the Straw Hats ship by Nami which makes Sanji Kin ' em on and Brook jealous of his luck with women At night a mysterious figure is seen making contact with Kung Fu Dugongs that have just found the Straw Hat pirates",
    "tf_idf_text": "intense aoki flamingo transliteration kin pak aoki tai fur amin japanese tetsuya end yoshiyuki suga december july flamingo prepare finish smoker stop zans ice freeze everything around warlord include manages break free ice freeze completely talk flamingo leave baby buffalo back dress rosa zan ask treat smoker get treat smoker start talk zan marine underworld insinuate former admiral business unseen government thousand sunny law tell detail recently form pirate alliance make afraid target emperor due hold caesar clown captive fun momo suke introduce straw hat ship nami make sanji kin brook jealous luck woman night mysterious figure see make contact kung dugong find straw hat pirate"
}