{
    "title": "628 50 \"A Major Turnaround! Luffy's Angry Iron Fist Strikes!\"Transliteration: \"Dai-gyakuten! Sakuretsu Rufi Ikari no Tekken\" (Japanese:大逆転！炸裂ルフィ怒りの鉄拳) Ayako Hiraike Jin Tanaka January 12, 2014(2014-01-12) August 20, 2023",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_16",
    "transformers_text": "628 50 \"A Major Turnaround! Luffy's Angry Iron Fist Strikes!\"Transliteration: \"Dai-gyakuten! Sakuretsu Rufi Ikari no Tekken\" (Japanese:大逆転！炸裂ルフィ怒りの鉄拳) Ayako Hiraike Jin Tanaka January 12, 2014(2014-01-12) August 20, 2023\n\nChopper and Dugong attempt to go against Breed, but Breed orders the other animals to attack them. At that point, Law, Caesar, and Luffy enter the room and Luffy knocks the animals out. Law explains how he saw through the Peto-Peto's weakness, which requires the victim to hear Breed's voice to obey him. Breed uses his Devil Fruit on himself and manages to enhance his strength and muscles and tries to attack Luffy and the others. However, his control over the other animals' fades, which allows them to work together and hold Breed still. Luffy and Dugong throw a combined punch to Breed and manage to defeat him. After thanking everyone for their help the Sea Monster Pirates set off for new adventures. Later on, on theSunny, the news about Doflamingo's resignation arrives along with the news of Law's and Luffy's alliance. The news also announces the alliance between the Kid Pirates, On Air Pirates, and Hawkins Pirates. The day's news causes chaos in the New World.",
    "tf_idf_text": "major turnaround luffys angry iron fist strikestransliteration daigyakuten sakuretsu rufi ikari tekken japanese ayako hiraike jin tanaka january august chopper dugong attempt breed breed order animal attack point law caesar luffy enter room luffy knock animal law explain saw petopetos weakness require victim hear breed voice obey breed us devil fruit manages enhance strength muscle try attack luffy others however control animal fade allow work together hold breed still luffy dugong throw combine punch breed manage defeat thank everyone help sea monster pirate set new adventure later thesunny news doflamingos resignation arrive along news law luffys alliance news also announce alliance kid pirate air pirate hawkins pirate day news cause chaos new world"
}