{
    "title": "en.wikipedia.org_wiki_Blue_Box_(manga)",
    "url": "https://en.wikipedia.org/wiki/Blue_Box_(manga)",
    "transformers_text": "Blue Box ( Japanese : アオのハコ , Hepburn : Ao no Hako ) is a Japanese manga series written and illustrated by Kouji Miura . It has been serialized in Shueisha 's Weekly Shōnen Jump since April 2021, with its chapters collected in 23 tankōbon volumes as of December 2025. An anime television series adaptation produced by TMS Entertainment and animated by Telecom Animation Film aired from October 2024 to March 2025. A second season has been announced.\n\nThe series focuses on Taiki Inomata, a student at Eimei Junior and Senior High, an athletics-oriented school, where he is a member of the boys' badminton team and is considered simply average. Every morning, he trains to get better early in the gym, often at the same time and place as his upperclasswoman Chinatsu Kano, the star of the girls' basketball team. Taiki quickly develops a crush on her, but is initially too shy to speak to her despite their continual alone time together. His fortunes change, however, when Chinatsu moves in with Taiki's family after her parents leave Japan to work abroad . With Chinatsu now living with him, Taiki aims to slowly develop his relationship with her as they both strive to make it to the national championship with their respective teams. [ 4 ]\n\nWritten and illustrated by Kouji Miura , Blue Box began its serialization in Shueisha 's shōnen manga magazine Weekly Shōnen Jump on April 12, 2021, [ 14 ] [ 15 ] after the one-shot version had been published on August 3, 2020. [ 16 ] [ 17 ] Shueisha has collected its chapters into individual tankōbon volumes. The first volume was released on August 4, 2021. [ 18 ] [ 19 ] As of December 4, 2025, 23 volumes have been released. [ 20 ]\n\nBlue Box has been licensed for simultaneous publication in North America as it is released in Japan, with its chapters being digitally launched by Viz Media on its Shonen Jump website. [ 21 ] Shueisha also simulpublishes the series in English for free on the Manga Plus app and website. [ 22 ] In February 2022, Viz Media announced that they had licensed the series in print format; the first volume was released on November 1 of the same year. [ 23 ] [ 24 ] The manga is also licensed in Indonesia by Elex Media Komputindo . [ 25 ]\n\nAn anime television series adaptation was announced in November 2023. [ 5 ] Planned and produced by TMS Entertainment , [ a ] it is animated by Telecom Animation Film and directed by Yūichirō Yano, with Yūko Kakihara [ ja ] handling series composition and Miho Tanino [ ja ] designing the characters. [ 7 ] The series aired for two consecutive cours from October 3, 2024, to March 27, 2025, on TBS and its affiliates. [ 8 ] [ 26 ] [ 27 ] [ b ] For the first cour, the opening theme is \"Same Blue\" by Official Hige Dandism , while the ending theme is \"Teenage Blue\" ( ティーンエイジブルー ) by Eve ; [ 26 ] for the second cour, the opening theme is \"Saraba\" ( 然らば ) by Macaroni Empitsu [ ja ] , while the ending theme is \"Contrast\" ( コントラスト ) by Tomoo . [ 12 ] Netflix licensed the series and is streaming it worldwide. [ 29 ]\n\nA second season was announced immediately following the airing of the first season finale. [ 30 ] [ 31 ]\n\nIn August 2021, the first volume of the manga had over 170,000 copies in circulation in less than a week after its release. [ 32 ]\n\nIn June 2021, Blue Box was nominated for the seventh Next Manga Award in the Best Print Manga category; [ 33 ] it placed eighth out of 50 nominees, but won the Global Prize. [ 34 ] [ 35 ] The series ranked fourth on the Nationwide Bookstore Employees' Recommended Comics of 2022. [ 36 ]\n\nBlue Box received critical acclaim. Anthony Gramuglia of Comic Book Resources ( CBR ) stated, \" Blue Box is a sentimental story about human connection. It's beautifully drawn, at times resembling a shōjo manga more than a typical shōnen . If Blue Box continues, it will likely become an earnest, sincere entry in Shōnen Jump ' s romantic catalog\". [ 37 ] Timothy Donohoo of CBR compared Blue Box to Kenta Shinohara 's Witch Watch and Shigure Tokita's Don't Blush, Sekime-san! due to both series having concepts and romantic aspects similar to Blue Box ' s. [ 38 ]",
    "tf_idf_text": "blue box japanese hepburn hako japanese manga series write illustrated kouji miura serialize shueisha weekly shnen jump since april chapter collect tankbon volume december anime television series adaptation produce tms entertainment animate telecom animation film air october march second season announce series focus taiki inomata student eimei junior senior high athleticsoriented school member boys badminton team consider simply average every morning train get well early gym often time place upperclasswoman chinatsu kano star girl basketball team taiki quickly develop crush initially shy speak despite continual alone time together fortune change however chinatsu move taikis family parent leave japan work abroad chinatsu live taiki aim slowly develop relationship strive make national championship respective team write illustrated kouji miura blue box begin serialization shueisha shnen manga magazine weekly shnen jump april oneshot version publish august shueisha collect chapter individual tankbon volume first volume release august december volume release blue box license simultaneous publication north america release japan chapter digitally launch viz medium shonen jump website shueisha also simulpublishes series english free manga plus app website february viz medium announce licensed series print format first volume release november year manga also license indonesia elex medium komputindo anime television series adaptation announce november plan produce tms entertainment animate telecom animation film direct yichir yano yko kakihara handle series composition miho tanino design character series air two consecutive cours october march tb affiliate first cour open theme blue official hige dandism end theme teenage blue eve second cour open theme saraba macaroni empitsu end theme contrast tomoo netflix license series stream worldwide second season announce immediately follow air first season finale august first volume manga copy circulation less week release june blue box nominate seventh next manga award best print manga category place eighth nominee global prize series rank fourth nationwide bookstore employee recommend comic blue box receive critical acclaim anthony gramuglia comic book resource cbr state blue box sentimental story human connection beautifully draw time resemble shjo manga typical shnen blue box continue likely become earnest sincere entry shnen jump romantic catalog timothy donohoo cbr compare blue box kenta shinohara witch watch shigure tokitas dont blush sekimesan due series concept romantic aspect similar blue box"
}