{
    "title": "en.wikipedia.org_wiki_Sondermann",
    "url": "https://en.wikipedia.org/wiki/Sondermann#Sondermann_Award",
    "transformers_text": "Sondermann is a cartoon character of the painter and cartoonist Bernd Pfarr , which appeared, until August 1994, in a column of the same name by the writer Simone Borowiak and, from 1987 to August 2004, regularly in the satirical magazine Titanic . Model for the name was Gerhard Sondermann, the first publisher of Titanic .\n\nSondermann is a creation of an illustrator, who, as Bernd Pfarr himself once said, wants \"to drive reality out of the pictures\" ( German : \"den Bildern die Realität austreiben\" ).\n\nThe world of Sondermann is subject to its own, individual laws: \"Negro scrubbing\" (German: \"Negerschrubben\") is a traditional ritual at Sondermann's company, Sondermann and his boss subdue their hunger by \"huddling softly together\" (German: \"sich weich aneinander schmiegen\"), consuming a Schnitzel and taking out the trash are common yoga exercises, and Sondermann defeats God (German: \"den lieben Gott\") in Tennis.\n\nSondermann's world is populated by strange creatures:\n\nEarly Sondermann episodes mostly limited themselves to the master-servant relationship between Sondermann and his boss. The pandemonium of the above-listed characters grew gradually out of this fundamental conflict. According to writer Robert Gernhardt , the character very soon developed a \"life of its own\" (German: \"Eigenleben\"), for which even the editorial staff of Titanic was not prepared.\n\nSince 2004, the name of Bernd Pfarr's character also denotes an audience prize for comics awarded by and at the Frankfurt Book Fair in collaboration with the magazine Comixene , the Frankfurter Rundschau , and Spiegel Online . Some of the prizes include a cash sum. [ 1 ] [ 2 ]",
    "tf_idf_text": "sondermann cartoon character painter cartoonist bernd pfarr appear august column name writer simone borowiak august regularly satirical magazine titanic model name gerhard sondermann first publisher titanic sondermann creation illustrator bernd pfarr say want drive reality picture german den bildern die realitt austreiben world sondermann subject individual law negro scrub german negerschrubben traditional ritual sondermanns company sondermann bos subdue hunger huddle softly together german sich weich aneinander schmiegen consume schnitzel take trash common yoga exercise sondermann defeat god german den lieben gott tennis sondermanns world populate strange creature early sondermann episode mostly limit masterservant relationship sondermann bos pandemonium abovelisted character grow gradually fundamental conflict accord writer robert gernhardt character soon develop life german eigenleben even editorial staff titanic not prepared since name bernd pfarrs character also denote audience prize comic award frankfurt book fair collaboration magazine comixene frankfurter rundschau spiegel online prize include cash sum"
}