{
    "title": "en.wikipedia.org_wiki_Template_Series_in_Weekly_Sh%C5%8Dnen_Jump",
    "url": "https://en.wikipedia.org/wiki/Template:Series_in_Weekly_Sh%C5%8Dnen_Jump",
    "transformers_text": "This is a navigational template created using {{ navbox }} . It can be transcluded on pages by placing {{Series in Weekly Shōnen Jump}} below the standard article appendices .\n\nThis template's initial visibility currently defaults to autocollapse , meaning that if there is another collapsible item on the page (a navbox, sidebar , or table with the collapsible attribute ), it is hidden apart from its title bar; if not, it is fully visible.\n\nTo change this template's initial visibility, the |state= parameter may be used:\n\nTemplates using the classes class=navbox ( {{ navbox }} ) or class=nomobile ( {{ sidebar }} ) are not displayed in article space on the mobile web site of English Wikipedia. Mobile page views accounted for 60% to 70% of all page views from 2020 through 2025. Briefly, these templates are not included in articles because 1) they are not well designed for mobile, and 2) they significantly increase page sizes—bad for mobile downloads—in a way that is not useful for the mobile use case. You can review/watch phab:T124168 for further discussion.\n\nA navigational box that can be placed at the bottom of articles.\n\nTemplate parameters [ Edit template data ]\n\nThe initial visibility of the navbox",
    "tf_idf_text": "navigational template create use navbox transcluded page place series weekly shnen jump standard article appendix templates initial visibility currently default autocollapse mean another collapsible item page navbox sidebar table collapsible attribute hidden apart title bar not fully visible change templates initial visibility state parameter may use template use class classnavbox navbox classnomobile sidebar not display article space mobile web site english wikipedia mobile page view account page view briefly templates not include article not well design mobile significantly increase page sizesbad mobile downloadsin way not useful mobile use case reviewwatch phabt discussion navigational box place bottom article template parameter edit template data initial visibility navbox"
}