{
    "title": "en.wikipedia.org_wiki_Ichi_the_Witch",
    "url": "https://en.wikipedia.org/wiki/Ichi_the_Witch",
    "transformers_text": "Ichi the Witch ( Japanese : 魔男のイチ , Hepburn : Madan no Ichi ) is a Japanese manga series written by Osamu Nishi [ ja ] and illustrated by Shiro Usazaki . It began serialization in Shueisha 's Weekly Shōnen Jump magazine in September 2024.\n\nThe series takes place in a world where monsters composed of magic called Majiks exist. Specialized hunters called Witches can obtain magic from them after performing a trial, but it is thought only women can become witches. A young boy called Ichi, who lives in Druid Mountain and hunts for a living, defeats a Majik, and ends up being the first male witch.\n\nWritten by Osamu Nishi [ ja ] and illustrated by Shiro Usazaki , the series began serialization in Weekly Shōnen Jump on September 9, 2024. [ 2 ] It is Usazaki's first major work since her previous work, Act-Age , was canceled due to its writer getting arrested. [ 3 ] The first tankōbon volume was released on January 4, 2025. [ 4 ] As of December 4, 2025, six volumes have been released. [ 5 ]\n\nViz Media and Manga Plus are publishing the series in English simultaneously with its Japanese release. [ 6 ]\n\nThese chapters have yet to be published in a tankōbon volume. They were originally serialized in Japanese in issues of Weekly Shōnen Jump .\n\nNick Valdez of ComicBook.com described the first chapter of Ichi the Witch as the \"strongest the magazine has seen since the likes of Kagurabachi \", and said \"it could be the next big thing\". [ 12 ] Joshua Fox of Screen Rant praised the worldbuilding, artwork, and protagonist of the story. [ 1 ]\n\nThe series has been recommended by manga authors Kōhei Horikoshi and Katsura Hoshino . [ 13 ] [ 14 ]\n\nThe series won the 11th Next Manga Award in the print category in 2025. [ 15 ] [ 16 ]",
    "tf_idf_text": "ichi witch japanese hepburn madan ichi japanese manga series write osamu nishi illustrate shiro usazaki begin serialization shueisha weekly shnen jump magazine september series take place world monster compose magic call majiks exist specialized hunter call witch obtain magic perform trial think woman become witch young boy call ichi life druid mountain hunt live defeat majik end first male witch write osamu nishi illustrate shiro usazaki series begin serialization weekly shnen jump september usazakis first major work since previous work actage cancel due writer get arrest first tankbon volume release january december six volume release viz medium manga plus publishing series english simultaneously japanese release chapter yet publish tankbon volume originally serialize japanese issue weekly shnen jump nick valdez comicbookcom describe first chapter ichi witch strong magazine see since like kagurabachi say could next big thing joshua fox screen rant praise worldbuilding artwork protagonist story series recommend manga author khei horikoshi katsura hoshino series next manga award print category"
}