{
    "title": "en.wikipedia.org_wiki_Roronoa_Zoro",
    "url": "https://en.wikipedia.org/wiki/Roronoa_Zoro",
    "transformers_text": "Roronoa Zoro ( ロロノア・ゾロ , Roronoa Zoro ; spelled as \"Roronoa Zolo\" in some English adaptations) , also known as \" Pirate Hunter \" Zoro ( 海賊狩りのゾロ , Kaizoku-Gari no Zoro ) , is a fictional character in the manga series and media franchise One Piece created by Eiichiro Oda . The character made his first appearance in the 3rd chapter of the series, which was first published in Japan in Shueisha 's Weekly Shōnen Jump magazine on August 4, 1997.\n\nZoro is the second member of the Straw Hat Pirates and the first to join, doing so after he is rescued by Monkey D. Luffy from execution. He is a highly skilled swordsman and serves as the crew's combatant. [ a ] He possesses an extremely poor sense of direction, which is a running gag throughout the series.\n\nZoro originally used two swords instead of three, [ 4 ] and was originally planned to be part of Buggy the Clown 's pirate crew and would have been recruited by Luffy away from Buggy. Zoro's surname, Roronoa, is based on the Japanese pronunciation of French pirate François l'Olonnais 's name. In several Western adaptations, his name was spelled as Zolo.\n\nZoro commonly wears a plain white shirt (though he can be seen wearing other types of shirts), black pants, and a light-green haramaki sash that holds his three swords. These swords' names are Enma, Wado Ichimonji, and Sandai Kitetsu. Zoro also has a black bandanna tied around his left bicep that he only wears on his head while in a serious battle. This bandana was inspired by Nobuhiro Watsuki , one of Oda's best friends and his mentor, as well as aspects of his character. Under his shirt, his torso is heavily scarred from many of the battles he has fought, especially since he joined the Straw Hats (like the one acquired during the battle against Dracule Mihawk , one of the Seven Warlords of the Sea ). He has three golden earrings in his left ear, which denote his style of combat using three swords. After a two-year time-skip, Zoro has a scar across his left eye (obtained during his training under Dracule Mihawk, although not confirmed by the anime) and replaces his shirt with a long dark green samurai 's coat which he opens the torso while fighting (against the New Fishman Pirates) or when he experiences heat (burning side of Punk Hazard ). Concerning his ethnic appearance, Oda stated that he imagines Zoro to be of Japanese descent , albeit in a real-world context. [ 5 ]\n\nZoro has many scars on his body. The most noticeable is the long scar running down his left eye, which is the one he got after returning from the two-year time skip. It is currently unknown how he acquired it, but he either can't or won't open his left eye because of it. He also has a heavily scarred torso, having a diagonal cut mark from the top left to the bottom right of his torso due to fighting Dracule Mihawk. He also has scars on both of his ankles, which he obtained from trying to cut his own legs off to escape the candle prison of Mr. 3 in Little Garden.\n\nIn the original Japanese version of the One Piece anime series, Zoro is voiced by Kazuya Nakai as an adult and Megumi Urawa as a child. In the first OVA Defeat Him! The Pirate Ganzack from 1998 is voiced by Wataru Takagi .\n\nIn Odex 's dubs of the first 104 episodes of One Piece in Singapore, Zoro was voiced by Brian Zimmerman. In the 4kids Entertainment 's dub of the first 104 episodes of One Piece , Zoro was renamed \"Zolo,\" which was later implemented in the Viz Media adaption of the manga series; he was voiced by Marc Diraison and Andrew Rannells as a child. In Funimation Entertainment 's dubs of the entire One Piece franchise, adult Zoro is voiced by Christopher Sabat with Cynthia Cranz playing the role of child Zoro for episode 2 and by Brina Palencia for the rest of the franchise. Sabat compared Zoro's characterization with Tsubasa: Reservoir Chronicle ' s Kurogane and YuYu Hakusho ' s Kazuma Kuwabara , describing them as \"the tough guy with a heart of gold\". As a result, Sabat feared that he sometimes performs similar voices despite the fact that the characters are different. He also tried seeing the original actors' works to avoid getting a more specific delivery. [ 6 ] In the game One Piece: Unlimited Adventure , Sabat reprises his role as adult Zoro, with child Zoro voiced by Aaron Dismuke .\n\nZoro is portrayed by Mackenyu in the live action adaptation of One Piece , [ 7 ] while Maximilian Lee Piazza portrays young Zoro.\n\nZoro is a confident and serious individual who tends to act impulsively like his captain. He responds in a comical, short-tempered way towards minor conflicts. A running gag is that he always gets lost even when shown where to go, having gotten lost even while walking in a straight line; he is very insecure about this and always blames someone else. While the crew is out at sea, Zoro can (usually) be found sleeping or training towards his goal of becoming the world's best swordsman. He and Sanji have a great rivalry, often resorting to fighting and insults over the most minuscule of problems. He never calls Sanji by his name in the original Japanese manga; he uses phrases like \"dumb-cook\", etc. Sanji calls him phrases like marimo (moss-head). etc.\n\nThough not a samurai, he appears to maintain a certain degree of bushido and is frequently mistaken for one. Unlike Luffy and most of the Straw Hat Pirates, Zoro has killed his opponents if it is necessary, though never in cold blood. Zoro enjoys fighting a strong opponent, and he usually faces down the second strongest villain in each arc. Zoro tends to have a maniacal grin and serious glare when battling a worthy opponent.\n\nOn the ship, he normally either trains with weights or sleeps. The only work he is seen doing regularly is hoisting the anchor using his great strength and maintaining a lookout in the ship's crow's nest (which on the Thousand Sunny also doubles as his gym). He also likes sake , almost to the degree that Luffy likes meat, but like Nami , he never gets drunk due to his inhumanly high endurance and tolerance for alcohol. Despite his poor sense of direction, he is often the first to sense an enemy or danger and react. He is often displayed as being well aware of dangerous situations and the people around him.\n\nDespite his stern personality, Zoro had a strong sense of loyalty and mutual respect towards his crewmates when accomplishing their dreams. After his humiliating loss to Dracule Mihawk, Zoro pledged his loyalty to Luffy as his captain, vowing that he will never lose again. As Luffy's first mate, Zoro often reminds others of the harsh reality of a sudden situation, which shocks some other crew members, although they usually decide he is right. Zoro insisted that Usopp apologize to his crewmates before he returned to the Straw Hats from an internal conflict he caused, displaying emotional maturity. Zoro has stated that he does not pray to any god, does not care one way or the other, and has never believed in anything except himself, and for him, only one man is above him (his captain, Luffy). He has also stated that he would follow Luffy till the end of his journey - becoming the King of the Pirates - but Luffy should not come between him and his dream either - becoming the world's strongest swordsman and surpassing Dracule Mihawk in the process. Zoro knows he still has much untapped potential and is constantly seen training and improving his fighting skills. He adheres to a sword master's code of honor and never brags or lies about his abilities, and outright admitting a weakness, even to an enemy. He never tries to escape from a fight or use trickery to win, believing that doing so is cowardly and scorning anyone who uses such tactics.\n\nHe is proficient in Armament and Observation Haki and is one of the few known characters who possess Conqueror's Haki. During his battle against King, Zoro unlocks an advanced form of Conqueror Haki, which allows him to coat his swords with it, similar to Armament Haki, which could further enhance his attacks. Although it hasn't been confirmed, Zoro is heavily linked with conqueror Haki by the beast pirate captain himself after the wound he gave him. He also uses an advanced form of Armament Haki to shoot a short blast of Haki from a distance. [ 8 ]\n\nRoronoa Zoro first appears in the manga chapter \"Enter Pirate Hunter Zoro\" ( \"海賊狩りのゾロ\"登場 , Kaizoku-gari no Zoro Tōjō ) , first published in Japan's Weekly Shōnen Jump magazine on August 4, 1997. [ 9 ] He first appears as a captured criminal awaiting his execution at the hands of the Marines, having offended Helmeppo by killing his pet wolf. [ 9 ] Before the beginning of the series' narrative, Zoro made a pact with his childhood friend Kuina, vowing to become the strongest swordsman in the world, only for Kuina to pass away the next day from an accident. [ 10 ] For years, Zoro hunts pirates as a bounty hunter for a living alongside friends Johnny and Yosaku , after getting lost trying to locate Dracule Mihawk . When Luffy offers Zoro the opportunity to join his crew, Zoro initially refuses. But after Luffy saves him from execution, Zoro pledges loyalty to him. Zoro locates Mihawk at the Baratie in a chance encounter, where he is easily defeated but nevertheless impresses the latter. [ 11 ]\n\nZoro's loyalty to Luffy is incomparable among the crew and develops through the series. Even though he joined Luffy's crew, his main goal was to become the strongest swordsman. Originally, Zoro threatened to kill Luffy if he ever got in the way of this goal. He listens to his captain's order and follows the order until the very end. On Jaya, Zoro followed Luffy's orders not to fight an enemy in a bar, no matter what, and followed it without hesitation. After fighting Daz Bonez in Alabasta, Zoro's bounty is initially set at 60,000,000 but is later raised to 120,000,000 after fighting the World Government at Enies Lobby. At Water 7, Zoro upholds the authority of Luffy as captain during Luffy's fight with Usopp and Usopp's leaving of the crew. Zoro pointedly refuses to allow Usopp to rejoin the crew without an apology and threatens to be the next to leave because letting Usopp \"back as if nothing happened was an insult to Luffy's authority as captain. [ 12 ]\n\nAt Thriller Bark, Bartholomew Kuma knocked out the Straw Hats, with Zoro trying to save Luffy and Sanji to no avail, as none of the pirates were aware of Kuma's intentions of having them separated to train for the New World far away. [ 12 ] Zoro encounters Mihawk again and trains under him for two years before reuniting with the crew. He receives a bounty of 320,000,000 after cutting up an antagonist as large as a mountain and assisting Luffy at the end of Doflamingo's tyrannical rule of Dressrosa. After the events in Wano Country and his contributions in the Onigashima Raid, such as defeating King, he receives a bounty of 1,111,000,000.\n\nIn One Piece volume 105, Oda revealed Zoro's family history. His father, Roronoa Arashi, was killed by pirates, and his mother, Tera, died of illness when he was young. Zoro is a descendant of the Shimotsuki family of Wano Country through his grandmother Furiko, the older sister of Ushimaru, the daimyo of Ringo, who is Zoro's great-uncle. Zoro is related to Kuina as distant cousins and is the descendant of Shimotsuki Ryuma, protagonist of one-shot Monsters and posthumously a One Piece character. [ 13 ]\n\nZoro has appeared in every One Piece licensed electronic video game to date, as well as crossover games such as Jump Super Stars , Jump Ultimate Stars , Battle Stadium D.O.N. , and Jump Force .\n\nZoro is always among the top three most popular characters, usually only below Luffy in popularity. He ranked second in every Shōnen Jump character popularity poll except the fifth, where he ranked third after Trafalgar Law . [ 14 ] [ 15 ] [ 16 ] Furthermore, in a 2007 poll by Oricon , Zoro was voted as the 4th most desired character to receive a spinoff. [ 17 ] DVD Talk praises Zoro's \"hilarious\" three-sword fighting style as a great example of the show's sense of humor. [ 18 ] Holly Ellingwood from Activeanime praised Zoro's fight against Luffy as one of the best moments from the 10th DVD from the series released by Viz Media, praising the action scenes. [ 19 ] Sabat's work with Zoro has resulted in him being nominated in the category \"Best Voice Actor (English)\" in the Society for the Promotion of Japanese Animation (SPJA) Awards from 2008. [ 20 ] Carl Kimlinger of Anime News Network commented on Sabat's work with Zoro as a \"standout\", noting that Zoro and Sabat are \"well-matched. [ 21 ] Kimlinger also found that his and Sanji's flashbacks from the anime \"really do jerk tears, even if they are less than gracefully executed\". [ 22 ]\n\nWhen Nico Robin refers to the two as the \"Wings of the Pirate King,\" it \"suggests that they're the two most important people to Luffy becoming the Pirate King, for their ability to carry their responsibility effectively and fight at the highest level, if not more.\" [ 23 ]",
    "tf_idf_text": "roronoa zoro roronoa zoro spell roronoa zolo english adaptation also know pirate hunter zoro kaizokugari zoro fictional character manga series medium franchise one piece create eiichiro oda character make first appearance chapter series first publish japan shueisha weekly shnen jump magazine august zoro second member straw hat pirate first join rescue monkey luffy execution highly skilled swordsman serve crew combatant possesses extremely poor sense direction run gag throughout series zoro originally use two sword instead three originally plan part buggy clown pirate crew would recruit luffy away buggy zoros surname roronoa base japanese pronunciation french pirate franois lolonnais name several western adaptation name spell zolo zoro commonly wear plain white shirt though see wear type shirt black pant lightgreen haramaki sash hold three sword sword name enma wado ichimonji sandai kitetsu zoro also black bandanna tie around left bicep wear head serious battle bandana inspire nobuhiro watsuki one odas best friend mentor well aspects character shirt torso heavily scar many battle fight especially since join straw hat like one acquire battle dracule mihawk one seven warlord sea three golden earring leave ear denote style combat use three sword twoyear timeskip zoro scar across leave eye obtain train dracule mihawk although not confirm anime replaces shirt long dark green samurai coat open torso fight new fishman pirate experience heat burn side punk hazard concern ethnic appearance oda state imago zoro japanese descent albeit realworld context zoro many scar body noticeable long scar run leave eye one get return twoyear time skip currently unknown acquire either cant wont open leave eye also heavily scar torso diagonal cut mark top leave bottom right torso due fight dracule mihawk also scar ankle obtain try cut legs escape candle prison little garden original japanese version one piece anime series zoro voice kazuya nakai adult megumi urawa child first ova defeat pirate ganzack voice wataru takagi odex dub first episodes one piece singapore zoro voice brian zimmerman kid entertainment dub first episodes one piece zoro rename zolo later implement viz medium adaption manga series voice marc diraison andrew rannells child funimation entertainment dub entire one piece franchise adult zoro voice christopher sabat cynthia cranz play role child zoro episode brina palencia rest franchise sabat compare zoros characterization tsubasa reservoir chronicle kurogane yuyu hakusho kazuma kuwabara describe tough guy heart gold result sabat fear sometimes performs similar voice despite fact character different also try see original actor work avoid get specific delivery game one piece unlimited adventure sabat reprise role adult zoro child zoro voice aaron dismuke zoro portray mackenyu live action adaptation one piece maximilian lee piazza portray young zoro zoro confident serious individual tends act impulsively like captain responds comical shorttempered way towards minor conflict run gag always get lose even show gotten lose even walk straight line insecure always blame someone else crew sea zoro usually find sleep training towards goal become world best swordsman sanji great rivalry often resort fight insult minuscule problem never call sanji name original japanese manga use phrase like dumbcook etc sanji call phrase like marimo mosshead etc though not samurai appear maintain certain degree bushido frequently mistake one unlike luffy straw hat pirate zoro kill opponent necessary though never cold blood zoro enjoy fight strong opponent usually face second strongest villain arc zoro tend maniacal grin serious glare battle worthy opponent ship normally either train weight sleep work see regularly hoist anchor use great strength maintain lookout ship crow nest thousand sunny also double gym also like sake almost degree luffy like meat like nami never get drunk due inhumanly high endurance tolerance alcohol despite poor sense direction often first sense enemy danger react often display well aware dangerous situation people around despite stern personality zoro strong sense loyalty mutual respect towards crewmates accomplish dream humiliate loss dracule mihawk zoro pledge loyalty luffy captain vow never lose luffys first mate zoro often remind others harsh reality sudden situation shock crew member although usually decide right zoro insist usopp apologize crewmates return straw hat internal conflict cause display emotional maturity zoro state not pray god not care one way never believe anything except one man captain luffy also state would follow luffy till end journey become king pirate luffy not come dream either become world strong swordsman surpass dracule mihawk process zoro know still much untapped potential constantly see train improve fight skill adhere sword master code honor never brag lie ability outright admit weakness even enemy never try escape fight use trickery win believe cowardly scorn anyone use tactic proficient armament observation haki one know character possess conqueror haki battle king zoro unlocks advance form conqueror haki allow coat sword similar armament haki could enhance attack although hasnt confirm zoro heavily link conqueror haki beast pirate captain wound give also use advanced form armament haki shoot short blast haki distance roronoa zoro first appear manga chapter enter pirate hunter zoro kaizokugari zoro first publish japan weekly shnen jump magazine august first appear captured criminal await execution hand marine offend helmeppo kill pet wolf begin series narrative zoro make pact childhood friend kuina vow become strong swordsman world kuina pass away next day accident year zoro hunt pirate bounty hunter living alongside friend johnny yosaku get lose try locate dracule mihawk luffy offer zoro opportunity join crew zoro initially refuse luffy save execution zoro pledge loyalty zoro locates mihawk baratie chance encounter easily defeat nevertheless impress latter zoros loyalty luffy incomparable among crew develops series even though join luffys crew main goal become strong swordsman originally zoro threaten kill luffy ever get way goal listen captain order follow order end jaya zoro follow luffys order not fight enemy bar matter follow without hesitation fight daz bonez alabasta zoros bounty initially set later raise fight world government enies lobby water zoro upholds authority luffy captain luffys fight usopp usopps leave crew zoro pointedly refuse allow usopp rejoin crew without apology threatens next leave let usopp back nothing happen insult luffys authority captain thriller bark bartholomew kuma knock straw hat zoro try save luffy sanji avail none pirate aware kumas intention separate train new world far away zoro encounter mihawk train two year reunite crew receives bounty cut antagonist large mountain assist luffy end doflamingos tyrannical rule dressrosa event wano country contribution onigashima raid defeating king receives bounty one piece volume oda reveal zoros family history father roronoa arashi kill pirate mother tera die illness young zoro descendant shimotsuki family wano country grandmother furiko old sister ushimaru daimyo ringo zoros greatuncle zoro relate kuina distant cousin descendant shimotsuki ryuma protagonist oneshot monster posthumously one piece character zoro appear every one piece license electronic video game date well crossover game jump super star jump ultimate star battle stadium jump force zoro always among top three popular character usually luffy popularity rank second every shnen jump character popularity poll except fifth ranked third trafalgar law furthermore poll oricon zoro vote desired character receive spinoff dvd talk praise zoros hilarious threesword fight style great example show sense humor holly ellingwood activeanime praise zoros fight luffy one best moment dvd series release viz medium praise action scene sabats work zoro result nominated category best voice actor english society promotion japanese animation spja award carl kimlinger anime news network comment sabats work zoro standout note zoro sabat wellmatched kimlinger also find sanjis flashback anime really jerk tear even less gracefully execute nico robin refers two wing pirate king suggests theyre two important people luffy become pirate king ability carry responsibility effectively fight high level not"
}