{
    "title": "en.wikipedia.org_wiki_Seikimatsu_Leader_den_Takeshi!",
    "url": "https://en.wikipedia.org/wiki/Seikimatsu_Leader_den_Takeshi!",
    "transformers_text": "Seikimatsu Leader den Takeshi! ( Japanese : 世紀末リーダー伝たけし! , Hepburn : Seikimatsu Rīdā den Takeshi! ; 'The Tale of Takeshi, the End-of-the-Century Leader!') is a Japanese manga series written and illustrated by Mitsutoshi Shimabukuro . It started in Shueisha 's shōnen manga magazine Weekly Shōnen Jump in July 1997. It was suspended from the magazine in August 2002, following Shimabukuro's arrest for violating child prostitution laws. Its chapters were collected in 24 tankōbon volumes. The series briefly resumed in Shueisha's seinen manga magazine Super Jump in 2005, with the added subtitle Kanketsu-hen .\n\nIn 2001, the series won the 46th Shogakukan Manga Award in the children's manga category.\n\nFrom birth, Takeshi, a seven-year-old boy with a distinctly middle-aged appearance, was perceived as a natural leader. His first word was \"leader\", and his father, Hiroshi, was a quintessential leader among salarymen. Following Hiroshi's sudden death, Takeshi dedicates himself to emulating his father. He joins his first-grade class with the singular goal of becoming a true leader to his peers.\n\nWritten and illustrated by Mitsutoshi Shimabukuro , Seikimatsu Leader den Takeshi! started in Shueisha 's shōnen manga magazine Weekly Shōnen Jump on July 15, 1997. [ a ] Following Shimabukuro's arrest for violating child prostitution laws on August 7, 2002, the series was suspended from the magazine, [ 4 ] [ 5 ] [ 6 ] finishing with its 237th chapter, released on August 13 of that same year. [ b ] Shueisha collected its chapters into individual tankōbon volumes; the first volume was released on December 29, 1997, [ 10 ] and, prior to the suspension, the 24th and last volume was released on July 9, 2002. [ 11 ]\n\nThe series briefly resumed in Shueisha's seinen manga magazine Super Jump in 2005, with the added subtitle Kanketsu-hen ( 完結編 ; \"The Final Chapter\") , [ 12 ] [ 7 ] and Shueisha re-released the series in 13 bunkoban volumes from August 4, 2004, to December 2, 2005. [ 13 ] [ 14 ]\n\nA pilot film was shown as part of the \"Jump Super Anime Tour\" of 1998 alongside pilots for One Piece and Hunter × Hunter . [ 15 ]\n\nIn 2001, the series won the 46th Shogakukan Manga Award in the children's manga category. [ 16 ]\n\n2023–",
    "tf_idf_text": "seikimatsu leader den takeshi japanese hepburn seikimatsu den takeshi tale takeshi endofthecentury leader japanese manga series write illustrated mitsutoshi shimabukuro start shueisha shnen manga magazine weekly shnen jump july suspend magazine august follow shimabukuros arrest violate child prostitution law chapter collect tankbon volume series briefly resume shueishas seinen manga magazine super jump add subtitle kanketsuhen series shogakukan manga award childrens manga category birth takeshi sevenyearold boy distinctly middleaged appearance perceive natural leader first word leader father hiroshi quintessential leader among salarymen follow hiroshis sudden death takeshi dedicate emulate father join firstgrade class singular goal become true leader peer write illustrated mitsutoshi shimabukuro seikimatsu leader den takeshi start shueisha shnen manga magazine weekly shnen jump july follow shimabukuros arrest violate child prostitution law august series suspend magazine finish chapter release august year shueisha collect chapter individual tankbon volume first volume release december prior suspension last volume release july series briefly resume shueishas seinen manga magazine super jump add subtitle kanketsuhen final chapter shueisha rereleased series bunkoban volume august december pilot film show part jump super anime tour alongside pilot one piece hunter hunter series shogakukan manga award childrens manga category"
}