{
    "title": "en.wikipedia.org_wiki_One_Piece__Pirate_Warriors_4",
    "url": "https://en.wikipedia.org/wiki/One_Piece:_Pirate_Warriors_4",
    "transformers_text": "One Piece: Pirate Warriors 4 [ a ] is a 2020 hack and slash video game developed by Koei Tecmo 's Omega Force and published by Bandai Namco Entertainment . It was released for the Nintendo Switch , PlayStation 4 , Windows , and Xbox One on March 27, 2020. It is the fourth installment in the Pirate Warriors sub-series , based on the One Piece franchise and Koei Tecmo's Dynasty Warriors series. It was released on March 27, 2020, [ 2 ] with ports for Nintendo Switch 2 , PlayStation 5 , and Xbox Series X/S set for release on November 21, 2025. [ 3 ]\n\nThe game features game play similar to the previous installments. [ 4 ] The game has its own original story that takes the Wano arc from One Piece and changes it. [ 5 ] It also features four new multiplayer modes called Giant Boss Battle, Total Bounty Battle, Timed Defense Battle, and Territory Battle. [ 6 ]\n\nThis story adapts numerous story arcs from the original manga series, but the plot of the Wano Country arc was modified significantly due to its incompletion at the time of its release. Cavendish, Bartolomeo, Sabo, Smoker, Tashigi and Kuzan appear in the arc to help the Straw Hats to free Luffy from his cell. As the battle intensifies between Big Mom and Kaido, a new enemy appears in the form of Blackbeard and his crew. Fighting Blackbeard, Big Mom, and Kaido's crew, players are met with a final battle against Kaido who turns into a dragon after defeating Big Mom, Blackbeard, and Kaido's underlings. Luffy defeats Kaido at the end, prompting him to flee the country in revenge while everyone cheers and celebrates Luffy's victory. [ 7 ]\n\nPirate Warriors 4 features 43 playable characters, with an additional 24 available as downloadable content for a total of 67. [ 8 ] This includes nearly every character from the previous entries, with the exception of Bartholomew Kuma, Caesar Clown, Gecko Moria, Magellan, and Perona.\n\nNewcomers to the series are marked in bold .\n\nOn July 5, 2019, the game was announced at Anime Expo 2019 with a reveal trailer. [ 9 ] [ 10 ]\n\nOn February 11, 2025, in celebration of a successful 4 million sales, ports to the PlayStation 5 and Xbox Series X/S were announced, along with the announcement of additional downloadable content which will be decided by fan votes. [ 11 ] On August 9, it was announced that Enel, a returning character; King, a new character from the Wano Country Arc; and Z from One Piece Film: Z had the most votes and would be added as playable characters in a future update. [ 12 ] A port for Nintendo Switch 2 was announced on September 13, 2025. [ 13 ]\n\nIGN 's Mitchell Saltzman gave the game a score of 8 out of 10, saying \"Pirate Warriors 4 is a great One Piece-flavored spin on the Musou genre with a deep roster and simple but fun combat\". [ 18 ]\n\nThe PlayStation 4 version of One Piece: Pirate Warriors 4 was the second best-selling retail game during its first week on sale in Japan, with 75,998 copies being sold. The Switch version was the third bestselling retail game during the same week, selling 61,571 copies. [ 22 ] By December 2020, One Piece: Pirate Warriors 4 had sold over 1 million copies, becoming the fastest entry in the Pirate Warriors series to achieve that milestone. [ 23 ] By August 2022, it had sold over 2 million copies. [ 24 ] By August 2023, it had sold 3 million copies. [ 25 ] By February 2025, it had sold 4 million copies. [ 26 ]",
    "tf_idf_text": "one piece pirate warrior hack slash video game develop koei tecmo omega force publish bandai namco entertainment release nintendo switch playstation windows xbox one march fourth installment pirate warrior subseries base one piece franchise koei tecmos dynasty warrior series release march port nintendo switch playstation xbox series set release november game feature game play similar previous installment game original story take wano arc one piece change also feature four new multiplayer mode call giant bos battle total bounty battle time defense battle territory battle story adapts numerous story arc original manga series plot wano country arc modify significantly due incompletion time release cavendish bartolomeo sabo smoker tashigi kuzan appear arc help straw hat free luffy cell battle intensify big mom kaido new enemy appear form blackbeard crew fight blackbeard big mom kaidos crew player meet final battle kaido turn dragon defeat big mom blackbeard kaidos underling luffy defeat kaido end prompt flee country revenge everyone cheer celebrate luffys victory pirate warrior feature playable character additional available downloadable content total include nearly every character previous entry exception bartholomew kuma caesar clown gecko moria magellan perona newcomer series mark bold july game announce anime expo reveal trailer february celebration successful million sale port playstation xbox series announce along announcement additional downloadable content decide fan vote august announce enel return character king new character wano country arc one piece film vote would add playable character future update port nintendo switch announce september ign mitchell saltzman give game score say pirate warrior great one pieceflavored spin musou genre deep roster simple fun combat playstation version one piece pirate warrior second bestselling retail game first week sale japan copy sell switch version third bestselling retail game week sell copy december one piece pirate warrior sell million copy become fast entry pirate warrior series achieve milestone august sell million copy august sell million copy february sell million copy"
}