{
    "title": "en.wikipedia.org_wiki_Merfolk",
    "url": "https://en.wikipedia.org/wiki/Merfolk",
    "transformers_text": "Merfolk , Mercreatures , Mermen or Merpeople are legendary water-dwelling, human-like beings. They are attested in folklore and mythology throughout the ages in various parts of the world. Merfolk, Merpeople, or simply Mer refers to humanoid creatures that live in deep waters like Mermaids, Sirens, Cecaelia etc.\n\nIn English, female merfolk are called mermaids , although in a strict sense, mermaids are confined to beings who are half-woman and half-fish in appearance; male merfolk are called mermen . Depending on the story, they can be described as either ugly or beautiful.\n\nChinese rényú ( 人魚 ) stands for \"merfolk\", but in ancient geographical or natural historical tracts, the term referred to \"human-fish\" or \"man-fish\" purported to inhabit rivers or lakes in certain parts of China. The Japanese analogue ningyo ( 人魚 ) likewise translates to \"human-fish\" while, at the same time, having also applied to various human-like fish recorded in writings from medieval times into the Edo Period.\n\nCertain fantastical types of \"fish\", generically referred to as renyu ( 人 魚 , \"human-fish\") are alleged to occur in various parts of China according to the Shan Hai Jing ( Classic of Mountains and Seas , 4th century BC). It is mentioned in the Bei Shan Jing (\"Classic of the Northern mountains\"), Zhong Shan Jing (Central Mountains), and Xi Shan Jing (Western Mountains) sections of this work. [ 1 ] [ 2 ]\n\nThis work and others also mention several additional types of \"anthropomorphic fish\" [ 3 ] with limbs in other regions such as the chiru [ zh ] ( 赤 鱬 ; \"red ru fish\" [ 4 ] ) and lingyu [ zh ] ( 陵 魚 ; \"hill-fish\"), considered to be in the same category of creatures. Certain tribes or races of humans were also described being part-fish, namely the Di people [ zh ] . [ 5 ] [ 1 ]\n\nIt is recorded that the Mausoleum of the First Qin Emperor was illuminated with lamps fueled by the oil of the human-fish ( renyu ), whose flames were meant to last a very long time. [ 6 ] [ 7 ]\n\nIn the Chinese Song Dynasty's supernatural tale collection Yijian Zhi (夷堅志), there are stories of sea sirens similar to those in other folklore. One tale describes a beautiful female demon living on a cliff of an island. A man sailed to the island, married a woman there, and she taught him how to recognize plants and avoid dangers, protecting him from wild beasts. They had two sons together. However, when a fellow townsman arrived on the island and took the man back by boat, the woman cursed him, throwing their sons into the water in a fit of rage and yelling at him to leave. The man stayed silent after boarding the ship. [ 8 ]\n\nAnother tale from Guangzhou tells of a merchant who, upon reaching an island, was captured by two women and taken into the mountains. They fed him daily, but he couldn't tell if he was still alive. After about a year, he overheard the women discussing magic, and he begged them to take him to the place where it was performed. When they did, he sought help, causing the women to flee by flying away. Though he was revived, his food gradually dwindled, and he died two months later. [ 8 ]\n\nThe renyu ( 人魚 ; human-fish) is described in the Bei Shan Jing (\"Classic of the North Mountains\") section as dwelling on Mt. Longhou ( 龍侯山 , \"Dragon-Marquis Mountain\") in the waters of the Jueshui ( 決水 , \"Bursting River\"), which flows eastward into the Yellow River . [ 12 ] It is said to \"resemble the tiyu \" [ 13 ] [ 14 ] (translated as \"resemble catfish\" [ 15 ] [ 11 ] [ 16 ] ) [ 17 ] [ c ] [ 21 ] possess four legs, with a voice like baby crying. [ 22 ]\n\nEating the fish purportedly cured idiocy [ 15 ] or dementia. [ 23 ] [ 24 ] This fish as a cure was also quoted in the Compendium of Materia Medica or Bencao Gangmu (1596) under its entry for Tiyu ( Chinese : 䱱魚 ) [ 22 ]\n\nThe Bencao Gangmu categorized the tiyu ( 䱱 魚 ) as one of two types of \"human-fish\" ( renyu ). The human-fish were also known as \"child-fish\" or haieryu ( 孩 兒 魚 ; 孩儿鱼 ). [ 22 ] [ 30 ]\n\nThe other type, called the niyu ( 鯢 魚 ) is elaborated in a separate section. [ 33 ] It has been noted by Li Shizhen that the character for the Niyu ( Ni 鯢 fish) consists of the \"fish\" indexing component ( 魚 ) and \"child\" ( 兒 ) radical. [ 32 ]\n\nTranslators of the Bencao Gangmu attempt to match entries with actual taxa of animals, forbs, etc., where possible, and the tiyu type is glossed as \"newts\" while the niyu type is \" Chinese giant salamander \". [ 27 ]\n\nThe chiru [ zh ] ( 赤鱬 ; \"red ru fish\". [ 4 ] Wade–Giles: ch'ih-ju ; \"red ju\" [ 35 ] ) is described in the Nan Shan Jing (\"Classic of the Southern Mountains\") as a human-headed fish. It is said to be found in the Qingqushan ( 青丘山 \"Green-Hills Mountains\") in the Pool-of-Yi (Yì zhī zé 翼之澤 ; \"Carp-Wings Lake\"). It is described as basically fish-form but having a human face, and issuing sounds like the mandarin duck . Eating it purportedly prevented scabies or itchy skin. [ 36 ] [ 4 ]\n\nThe illustration of the chiru from China may have influenced the legless, human-faced fish visualization of some of the ningyo in Japan, according to the hypothesis of Morihiko Fujisawa [ ja ] . [ 37 ]\n\nThe jiaoren ( 蛟 人 \" flood dragon people\" or 鮫 人 \"shark people\") [ 39 ] [ e ] that appear in medieval writings are considered to be references to merfolk . [ 3 ] [ 41 ] [ 42 ]\n\nThis mythical southern mermaid or merman is recorded in Ren Fang [ zh ] 's Shuyi ji [ zh ] \"Records of Strange Things\" (early 6th century CE). [ 44 ] [ 45 ]\n\nIn the midst of the South Sea are the houses of the kău ( Chinese : 鮫 ; pinyin : jiao ; Wade–Giles : chiao [ 46 ] ) people who dwell in the water like fish, but have not given up weaving at the loom. Their eyes have the power to weep, but what they bring forth is pearls. [ 47 ]\n\nSimilar passages appear in other texts such as the Bowuzhi ( 博物志 , \"Treatise of Manifold \" c. 290 CE ) as \"weep[ing] tears that became pearls\". [ 48 ] [ 49 ] [ 50 ] [ f ]\n\nThese aquatic people supposedly spun a type of raw silk called jiaoxiao 蛟 綃 \"mermaid silk\" or jiaonujuan 蛟 女 絹 \"mermaid woman's silk\". Schafer equates this with sea silk , the rare fabric woven from byssus filaments produced by Pinna \"pen shell\" mollusks. [ 51 ] [ g ]\n\nLoting (盧亭) is a mysterious ethnic group residing in Hong Kong's Myths. [ 53 ] They are legendary merfolk half human and half fish, also known as Lo Yu, Lu Heng, or Lo Ting Fish Man. [ 54 ] They have lived on Tai O' Lantau Island in Hong Kong since the local civil uprising in the Eastern Jin Dynasty of China. [ 55 ] It is said that Loting has fish scales on his fish-like human body, a face that resembles humans, and he enjoys sucking chicken blood. [ 56 ] They could use their catch to fish from Tai O and trade chickens with the local human inhabitants to survive.\n\nThe ningyo ( 人魚 \"human-fish\") of Japan has its own history in the country's literary record. The earliest references (in the Nihon shoki , entry for year 619, reign of Empress Suiko ) do not specifically use the term ningyo , and the \"thing\" appeared in fresh water (a river in Ōmi Province , canal Settsu Province ), and may presumed to be a giant salamander. [ 57 ] Later accounts claim that Empress Suiko's regent Prince Shōtoku knew the creature to be a ningyo when one was presented to him by representatives of Ōmi. [ 58 ] The appearance of the human-fish was strongly associated with ill omen in later treatments of the Prince's encounter with the human-fish. [ 59 ]\n\nDuring the Kamakura Period, ningyo of the marine sort were frequently reported as washing ashore, and these were taken to be ominous signs usually prefiguring bloody battles. [ 60 ]\n\nThe ningyo , or rather renyu ( 人魚 ) and the like found in Chinese sources ( chiru , tiyu etc., etc., discussed above) were also discussed in Japanese literature, for example, works of scholars of herbal and traditional medicine, such as Kaibara Ekiken (d. 1714) and Ono Ranzan (d. 1810). These Japanese scholars were also aware of European discussions on \"sirens\", \"anthropomorphic fish\", \" peixe muller (fish-woman)\", etc. [ 61 ] [ 62 ]\n\nMerfolk, known collectively as Taga-Dagat or sometimes Bantay Tubig (\"Water Guardians\"), are aquatic beings in Philippine mythology . Due to the country's diverse cultures and languages across its many islands, tales of merfolk vary widely. These beings are often considered engkanto or supernatural entities or nature spirits and are believed to guard bodies of water. [ 63 ] [ 64 ] [ 65 ] The most well-known merfolk figure is the Sirena , a mermaid-like creature with the upper body of a human female and the tail of a fish. Sirenas are known for their mesmerizing voices, which they use to lure fishermen or sailors to their deaths by drowning or abduction. In some stories, Sirenas are portrayed as malevolent, while in others, they can become kind and loyal if they fall in love with a human. [ 66 ] The Sireno is the male counterpart of the Sirena, though it appears less frequently in stories. Sometimes, Sirena are paired with the Siyokoy (also spelled Shokoy or Syokoy), another type of aquatic creature. Siyokoy are depicted as hostile sea monsters with scales, webbed limbs, and grotesque features. Unlike the Sirena, Siyokoy are more animalistic and are believed to drown humans. Their name is thought to originate from the Hokkien term shui gui , referring to water spirits in Chinese folklore. [ 63 ] [ 64 ] [ 67 ] [ 68 ] Another merfolk being is the Kataw , often considered a higher-ranking water entity than the Sirena or Siyokoy. Kataw resemble humans but have gills, fins, and sometimes even human feet and the ability to manipulate water elements. They are known to disguise themselves as fishermen and lure humans into the sea. A human-eating version of the Sirena is the Magindara, often portrayed in Bicolano folklore. [ 65 ] [ 69 ] [ 70 ]\n\nCitations\n\nBibliography",
    "tf_idf_text": "merfolk mercreatures mermen merpeople legendary waterdwelling humanlike being attest folklore mythology throughout age various part world merfolk merpeople simply m refers humanoid creature live deep water like mermaid siren cecaelia etc english female merfolk call mermaid although strict sense mermaid confine being halfwoman halffish appearance male merfolk call merman depend story describe either ugly beautiful chinese rny stand merfolk ancient geographical natural historical tract term refer humanfish manfish purport inhabit river lakes certain part china japanese analogue ningyo likewise translate humanfish time also apply various humanlike fish record writing medieval time edo period certain fantastical type fish generically refer renyu humanfish allege occur various part china accord hai jing classic mountains seas century mention bei jing classic northern mountain zhong jing central mountain jing western mountain section work work others also mention several additional type anthropomorphic fish limb region chiru red fish lingyu hillfish consider category creature certain tribes race human also describe partfish namely people record mausoleum first qin emperor illuminate lamp fuel oil humanfish renyu whose flame mean last long time chinese song dynastys supernatural tale collection yijian zhi story sea siren similar folklore one tale describe beautiful female demon live cliff island man sail island marry woman teach recognize plant avoid danger protect wild beast two son together however fellow townsman arrive island take man back boat woman curse throw son water fit rage yell leave man stay silent board ship another tale guangzhou tell merchant upon reach island capture two woman take mountain fed daily couldnt tell still alive year overheard woman discuss magic beg take place perform seek help cause woman flee fly away though revive food gradually dwindle die two month later renyu humanfish describe bei jing classic north mountain section dwell longhou dragonmarquis mountain water jueshui burst river flow eastward yellow river say resemble tiyu translate resemble catfish possess four legs voice like baby cry eat fish purportedly cure idiocy dementia fish cure also quote compendium materia medica bencao gangmu entry tiyu chinese bencao gangmu categorize tiyu one two type humanfish renyu humanfish also know childfish haieryu type call niyu elaborate separate section note shizhen character niyu fish consist fish index component child radical translator bencao gangmu attempt match entry actual taxon animal forbs etc possible tiyu type gloss newts niyu type chinese giant salamander chiru red fish wadegiles chihju red described nan jing classic southern mountain humanheaded fish say find qingqushan greenhills mountains poolofyi carpwings lake describe basically fishform human face issue sound like mandarin duck eat purportedly prevent scabies itchy skin illustration chiru china may influence legless humanfaced fish visualization ningyo japan accord hypothesis morihiko fujisawa jiaoren flood dragon people shark people appear medieval writing consider reference merfolk mythical southern mermaid merman record ren fang shuyi record strange thing early century midst south sea house chinese pinyin jiao wadegiles chiao people dwell water like fish not give weave loom eye power weep bring forth pearl similar passage appear texts bowuzhi treatise manifold weep tear become pearls aquatic people supposedly spin type raw silk call jiaoxiao mermaid silk jiaonujuan mermaid womans silk schafer equate sea silk rare fabric weave byssus filament produce pinna pen shell mollusk lot mysterious ethnic group reside hong kongs myth legendary merfolk half human half fish also know heng ting fish man live tai lantau island hong kong since local civil uprising eastern jin dynasty china say loting fish scale fishlike human body face resembles human enjoy suck chicken blood could use catch fish tai trade chickens local human inhabitant survive ningyo humanfish japan history countrys literary record early reference nihon shoki entry year reign empress suiko not specifically use term ningyo thing appear fresh water river province canal settsu province may presume giant salamander later account claim empress suikos regent prince shtoku knew creature ningyo one present representative appearance humanfish strongly associate ill omen later treatment prince encounter humanfish kamakura period ningyo marine sort frequently report wash ashore take ominous sign usually prefigure bloody battle ningyo rather renyu like find chinese source chiru tiyu etc etc discuss also discuss japanese literature example work scholar herbal traditional medicine kaibara ekiken ono ranzan japanese scholar also aware european discussion sirens anthropomorphic fish peixe muller fishwoman etc merfolk know collectively tagadagat sometimes bantay tubig water guardian aquatic being philippine mythology due country diverse culture languages across many island tale merfolk vary widely being often consider engkanto supernatural entity nature spirit believe guard body water wellknown merfolk figure sirena mermaidlike creature upper body human female tail fish sirenas know mesmerize voice use lure fisherman sailor death drown abduction story sirenas portray malevolent others become kind loyal fall love human sireno male counterpart sirena though appear less frequently stories sometimes sirena pair siyokoy also spell shokoy syokoy another type aquatic creature siyokoy depict hostile sea monster scale web limbs grotesque feature unlike sirena siyokoy animalistic believe drown human name thought originate hokkien term shui gui refer water spirit chinese folklore another merfolk kataw often consider higherranking water entity sirena siyokoy kataw resemble human gill fin sometimes even human foot ability manipulate water element know disguise fisherman lure human sea humaneating version sirena magindara often portrayed bicolano folklore citation bibliography"
}