{
    "title": "en.wikipedia.org_wiki_Alabasta",
    "url": "https://en.wikipedia.org/wiki/Alabasta",
    "transformers_text": "Alabasta (from Greek αλάβαστρος (alábastros) ' alabaster ' ) is a genus of arcellinid testate amoebae belonging to the family Hyalospheniidae . [ 2 ] It contains species with an elongated test and a strongly curved \"pseudostome\" (the test opening) with a flare and a notch in narrow view. These species previously belonged to the genus Nebela , but were later found to be a distinct monophyletic group different from Nebela . It is the sister group to Planocarina . [ 1 ]\n\nMembers of Alabasta have a rigid, elongated test that is colourless or yellowish, with a maximum width at about two thirds of the distance from the test's aperture and sides, then thinner towards the aperture. The test is proteinaceous , often incorporating silica scales taken from euglyphid preys. The pseudostome (i.e. aperture) is strongly convex with a flare (i.e. fan shape) in broad view and a deep notch in profile view. Lateral pores are usually present at about one third of the distance from the pseudostome to the fundus (i.e. the bottom of the test, opposite to the aperture). [ 1 ]\n\nAlabasta was described in 2018 by Clément Duckert, Quentin Blandenier, Anush Kosakyan and David Singer. The description of the genus was published in the European Journal of Protistology . [ 1 ]\n\nThe genus was named after the greek word αλάβαστρος (alábastros), as a reference to the diaphanous and yellowish appearance of the test. It is also related to Alabasta, a fictitious desert island described in the manga One Piece , which is reminiscent of the ecological preferences of Alabasta militaris , used in the monitoring of peatlands as an indicator of dryness. [ 1 ]\n\nThere are 3 species of Alabasta : [ 1 ]\n\nThis Amoebozoa -related article is a stub . You can help Wikipedia by expanding it .",
    "tf_idf_text": "alabasta greek albastros alabaster genus arcellinid testate amoeba belong family hyalospheniidae contain specie elongate test strongly curve pseudostome test opening flare notch narrow view specie previously belong genus nebela later find distinct monophyletic group different nebela sister group planocarina member alabasta rigid elongate test colourless yellowish maximum width two third distance test aperture side thinner towards aperture test proteinaceous often incorporate silica scale take euglyphid preys pseudostome aperture strongly convex flare fan shape broad view deep notch profile view lateral pore usually present one third distance pseudostome fundus bottom test opposite aperture alabasta describe clment duckert quentin blandenier anush kosakyan david singer description genus publish european journal protistology genus name greek word albastros reference diaphanous yellowish appearance test also relate alabasta fictitious desert island describe manga one piece reminiscent ecological preference alabasta militaris use monitoring peatlands indicator dryness specie alabasta amoebozoa related article stub help wikipedia expand"
}