{
    "title": "en.wikipedia.org_wiki_Bomber_Girl",
    "url": "https://en.wikipedia.org/wiki/Bomber_Girl",
    "transformers_text": "Bomber Girl (stylized in all caps ) is a Japanese manga series written and illustrated by Makoto Niwano . It was published in Shueisha 's Weekly Shōnen Jump from January to April 1994.\n\nIn North America, the series was published by Gutsoon Entertainment and serialized in its Raijin Comics manga anthology.\n\nThe series is about Emi Rashomon ( 羅生門エミー , Rashomon Emii ) , a bounty hunter who uses her sex appeal to defeat enemies. Guy Kurosaki ( 黒崎 ガイ , Kurosaki Gai ) is a police officer who initially opposes Emi's methods.\n\nBomber Girl is written and illustrated by Makoto Niwano . It was published in Shueisha 's Weekly Shōnen Jump from January 31 to April 11, 1994. [ 3 ] The eleven individual chapters were compiled in a single tankōbon volume on August 4, 1994. [ 4 ]\n\nIn North America, the series was published by Gutsoon Entertainment and serialized in its Raijin Comics manga anthology. [ 5 ] [ 6 ]\n\nThe series received very negative critics from manga and anime reviewers. John Jakala said that the first instalment of the series was okay, but the second was even more amateur. He referred to a car panel as it looked like something an elementary school child would draw in the margins of his math notebook. [ 7 ] He also noted that he does not want to pay for work of such unprofessional quality. He cast his vote against Bomber Girl on an online survey. [ 7 ] John Jakala continuously made fun of the series in the later reviews.\n\nJason Thompson described it as \"amoral girl with big boobs killing and torturing people,\" despising the manga as he stated, \"[it] is so awful that I assume it got published because [Makoto] Niwano jumped into an icy river to save [Tetsuo] Hara and [Tsukasa] Hojo from drowning.\" [ 8 ] Eduardo M. Chavez of Mania Entertainment pondered, \"For those looking for a manga with a lot of action, a good amount of fan-service, and some crazy looking characters this might be a good call. ... For those looking for something with a decent plot, character designs that won't disturb you, and fan-service that does not involved greased up male cult members or a gang boss that has a gattling gun [ sic ] on ... his phallus you should pass.\" [ 2 ]",
    "tf_idf_text": "bomber girl stylize cap japanese manga series write illustrated makoto niwano publish shueisha weekly shnen jump january april north america series publish gutsoon entertainment serialize raijin comic manga anthology series emi rashomon rashomon emii bounty hunter use sex appeal defeat enemy guy kurosaki kurosaki gai police officer initially oppose emis method bomber girl write illustrated makoto niwano publish shueisha weekly shnen jump january april eleven individual chapter compile single tankbon volume august north america series publish gutsoon entertainment serialize raijin comic manga anthology series receive negative critic manga anime reviewer john jakala say first instalment series okay second even amateur referred car panel look like something elementary school child would draw margin math notebook also note not want pay work unprofessional quality cast vote bomber girl online survey john jakala continuously make fun series later review jason thompson describe amoral girl big boob kill torture people despise manga state awful assume get publish makoto niwano jump icy river save tetsuo hara tsukasa hojo drown eduardo chavez mania entertainment ponder look manga lot action good amount fanservice crazy look character might good call look something decent plot character design wont disturb fanservice not involve grease male cult member gang bos gattling gun sic phallus pas"
}