{
    "title": "en.wikipedia.org_wiki_Monsters_(manga)",
    "url": "https://en.wikipedia.org/wiki/Monsters_(manga)",
    "transformers_text": "Monsters (stylized in all caps ) is a Japanese one-shot manga written and illustrated by Eiichiro Oda . It was published by Shueisha in the Autumn Special issue of Weekly Shōnen Jump in October 1994. An original net animation (ONA) adaptation, titled Monsters: 103 Mercies Dragon Damnation , was produced by E&H Production and premiered on Netflix in January 2024. Oda would later feature characters from Monsters in his subsequent manga series One Piece , setting the two in the same universe.\n\nWritten and illustrated by Eiichiro Oda, the Monsters one-shot was published by Shueisha in 1994 in the Autumn Special issue of Weekly Shōnen Jump (with cover date October 30). [ 7 ] [ 8 ] The chapter was collected in Oda's short stories volume Wanted! , released on November 4, 1998. [ 9 ] The character Ryuma would later appear as a zombie in Oda's One Piece manga series during the Thriller Bark story arc , thus officially linking the events of both works. [ 10 ] [ 11 ] [ 12 ]\n\nViz Media published the one-shot digitally on January 22, 2024, [ 13 ] and published the Wanted! volume (under the title Wanted! Eiichiro Oda Before One Piece ) on November 12 of the same year. [ 14 ]\n\nIn July 2023, it was announced that Monsters would be receiving an anime adaptation. [ 15 ] [ 16 ] Titled Monsters: 103 Mercies Dragon Damnation ( MONSTERS 一百三情飛龍侍極 , Monsutāzu: Ippaku Sanjō Hiryū Jigoku ) , the original net animation (ONA) premiered worldwide on Netflix on January 21, 2024, [ 17 ] [ 18 ] and January 23 in Japan. [ 19 ] [ a ] Medialink sub-licensed the ONA in Asia-Pacific for streaming on their Ani-One Asia YouTube channel. [ 20 ]\n\nThe ONA was directed by Sunghoo Park , who was also in charge of composition, and animated by his studio E&H Production. Takashi Kojima served as character designer, with Fuminao Akai as art director, Ryoji Nagasawa as color designer, Lee Ju-Mi as director of photography, Keisuke Yanagi as editor, and Akiko Fujita as sound director. The music was composed by Hiroaki Tsutsumi and produced by Takeki Kobayashi. [ 21 ]",
    "tf_idf_text": "monster stylize cap japanese oneshot manga write illustrated eiichiro oda publish shueisha autumn special issue weekly shnen jump october original net animation ona adaptation title monster mercy dragon damnation produce production premier netflix january oda would later feature character monster subsequent manga series one piece set two universe write illustrated eiichiro oda monster oneshot publish shueisha autumn special issue weekly shnen jump cover date october chapter collect odas short story volume want released november character ryuma would later appear zombie odas one piece manga series thriller bark story arc thus officially link event work viz medium publish oneshot digitally january publish wanted volume title want eiichiro oda one piece november year july announce monster would receive anime adaptation title monster mercy dragon damnation monster monsutzu ippaku sanj hiry jigoku original net animation ona premier worldwide netflix january january japan medialink sublicensed ona asiapacific stream anione asia youtube channel ona direct sunghoo park also charge composition animate studio production takashi kojima serve character designer fuminao akai art director ryoji nagasawa color designer lee jumi director photography keisuke yanagi editor akiko fujita sound director music compose hiroaki tsutsumi produce takeki kobayashi"
}