{
    "title": "en.wikipedia.org_wiki_Onigiri",
    "url": "https://en.wikipedia.org/wiki/Onigiri",
    "transformers_text": "Onigiri ( お握り or 御握り ) , also known as omusubi ( お結び ) or nigirimeshi ( 握り飯 ) , is a Japanese rice ball made from white rice . It is usually formed into triangular or cylindrical shapes, and wrapped in nori (seaweed). [ a ] Onigiri traditionally have sour or salty fillings such as umeboshi (pickled Chinese plum ), salted salmon , katsuobushi (smoked and fermented bonito ), kombu , tarako or mentaiko ( pollock roe ), or takanazuke (pickled Japanese giant red mustard greens). Because it is easily portable and eaten by hand, onigiri has been used as portable food or bento from ancient times to the present day. Originally, it was used as a way to use and store left-over rice, but it later became a regular meal. Many Japanese convenience stores and supermarkets stock onigiri with various fillings and flavors. It has become so mainstream that it is even served in izakayas and sit-down restaurants. There are even specialized shops which only sell onigiri to take out . Due to the popularity of this trend in Japan, onigiri has become a popular staple in Japanese restaurants worldwide.\n\nOnigiri is not a form of sushi and should not be confused with the type of sushi called nigirizushi or simply nigiri . Onigiri is made with plain rice (sometimes lightly salted), while sushi is made of rice with vinegar , sugar, and salt. [ 1 ] Onigiri makes rice portable and easy to eat as well as preserving it, while sushi originated as a way of preserving fish .\n\nOn November 12, 1987, [ 2 ] lumps of carbonized grains of rice, thought to be riceballs, were excavated from a building belonging to the Yayoi period (2000 years ago) in the Sugitani Chanobatake Ruins in Ishikawa Prefecture . The carbonized rice had traces which revealed that it was formed by human hands, thus it was initially documented as \"the oldest onigiri.\" [ 2 ] [ 3 ] In subsequent research, it was thought to be steamed and grilled, rather than boiled like today's rice, similar to another dish called chimaki . [ 2 ] [ 4 ] Since then, it has been academically called the \"chimaki-shaped carbonized rice lumps (チマキ状炭化米塊)\".\n\nIn Nakanoto, there is a replica of the relic on display at the roadside station Orihime-no-sato Nakanoto. [ 5 ]\n\nBefore the use of chopsticks became widespread, in the Nara period , rice was often rolled into a small ball so that it could be easily picked up. In the Heian period , rice was made into small rectangular shapes known as tonjiki so that they could be piled onto a plate and easily eaten. At that time, onigiri were called tonjiki and often consumed at outdoor picnic lunches. [ 6 ]\n\nThe first incarnation of the word onigiri is attested in the Hitachi no Kuni Fudoki ( Hitachi Province Gazette ), dated to 721 AD. In it, the word used is nigiri-ihi (握飯) or \"crumpled rice\": [ 7 ]\n\nNigiri-ihi Tsukuba no kuni, kuniburi no kotoba-ni ifu.\n\n(\"In the Tsukuba [ b ] dialect, it is known as nigiri-ihi.\")\n\nIn Murasaki Shikibu 's 11th-century diary Murasaki Shikibu Nikki , she writes of people eating tonjiki rice balls. [ 9 ] [ 10 ] Other writings, dating back as far as the seventeenth century, state that many samurai stored rice balls wrapped in bamboo sheath as a quick lunchtime meal during war.\n\nFrom the Kamakura period to the early Edo period , onigiri was used as a quick meal. This made sense as cooks simply had to think about making enough onigiri and did not have to concern themselves with serving. These onigiri were simply balls of rice flavored with salt . Nori did not become widely available until the Genroku era (1688–1704) of the mid-Edo period, when the farming of nori and fashioning it into sheets became widespread. [ citation needed ]\n\nIn the 1980s, a machine to make triangular onigiri was invented. Rather than rolling the filling inside, the flavoring was put into a hole in the onigiri and the hole was hidden by nori. Since the onigiri made by this machine came with nori already applied to the rice ball, over time the nori became moist and sticky, clinging to the rice. [ citation needed ]\n\nA packaging improvement allowed the nori to be stored separately from the rice. Before eating, the diner could open the packet of nori and wrap the onigiri. The use of a hole for filling the onigiri made new flavors of onigiri easier to produce as this cooking process did not require changes from ingredient to ingredient. Modern mechanically wrapped onigiri are specially folded so that the plastic wrapping is between the nori and rice to act as a moisture barrier. When the packaging is pulled open at both ends, the nori and rice come into contact and are eaten together. This packaging is commonly found for both triangular onigiri and rolls (細巻き). [ citation needed ]\n\nUsually, onigiri is made with boiled white rice , though it is sometimes made with different varieties of cooked rice, such as:\n\nThe rice may be seasoned with salt, sesame , furikake , dried shiso flakes, and so on. Onigiri are typically triangular, but can come in many shapes, including round, cylindrical, rectangular, etc. [ citation needed ]\n\nUmeboshi , okaka , or tsukudani have long been frequently used as fillings for onigiri. Generally, onigiri made with pre-seasoned rice is not filled with ingredients. Plain (salt only) onigiri is called shio-musubi .\n\nTypical fillings are listed below:\n\nYaki-onigiri (焼きおにぎり \"grilled onigiri\") are first shaped by compacting white rice, then grilling it until brown, then coating with soy sauce or miso , and finally broiling it. Yaki-onigiri is also sold commercially as frozen food.\n\nMiso-onigiri ( 味噌おにぎり ) is mainly in eastern Japan. Miso is used as fillings, sometimes mixed with green onion , or spread over and roasted as a variant of yaki-onigiri.\n\nAge-onigiri (揚げおにぎり \"fried onigiri\") are first shaped by compacting white rice, then frying it in a frying pan or wok using cooking oil until it is golden brown. Because of the oil, the flavor is richer than yaki-onigiri. If eating it as is, it can be seasoned with soy sauce, miso, or salt.\n\nTo eat it in a soup, first place it in a bowl. Add condiments such as chives, miyakogusa , wasabi , grated ginger, nori , umeboshi plum, and pour hot Japanese-style soup stock. Eat while breaking up the onigiri that have absorbed the soup stock.\n\nThere are several variations of the age-onigiri. For example, there is a version where the rice being fried has Japanese flavoring, such as takikomi gohan . There is also a Western style variation where melted cheese is used as the filling, the rice is deep-fried with western ingredients such as ketchup and curry, and the onigiri is topped with a western-style soup.\n\nBakudan-onigiri (爆弾おにぎり \"bomb-shaped onigiri\") are large, spherical rice balls wrapped entirely in nori , so that no rice is exposed. Like other onigiri, they are usually filled with dried fish and umeboshi plums. Bakudan-onigiri are known to be simple to make and easy to hold without getting the hands sticky.\n\nPork tamago-onigiri (ポーク玉子おにぎり \"pork egg onigiri\") or onipō (おにポー) for short, is a variation from Okinawa Prefecture which combines rice, seaweed, pork, and eggs. [ 11 ] It is similar to onigirazu (rice and lunch meat in sandwich form).\n\nTokyo's Takagi Shrine is often called the onigiri shrine. It is a Shinto shrine dedicated to \"Takami-Musubi, an androgynous deity of creation and birth ... the shrine is associated with the concept of en-musubi , as well as ... rice balls.\" Before 1868, the shrine was dedicated to Dairoku-Tenma-Ō, the \"Devil King of the Sixth Heaven\", and was called Dairokutensha. [ 15 ]\n\nOnigiri has its own Unicode emoji : 🍙 (U+1F359)",
    "tf_idf_text": "onigiri also know omusubi nigirimeshi japanese rice ball make white rice usually form triangular cylindrical shape wrap nori seaweed onigiri traditionally sour salty filling umeboshi pickle chinese plum salt salmon katsuobushi smoke fermented bonito kombu tarako mentaiko pollock roe takanazuke pickle japanese giant red mustard green easily portable eaten hand onigiri use portable food bento ancient time present day originally use way use store leftover rice later become regular meal many japanese convenience store supermarket stock onigiri various filling flavor become mainstream even serve izakayas sitdown restaurant even specialize shop sell onigiri take due popularity trend japan onigiri become popular staple japanese restaurant worldwide onigiri not form sushi not confused type sushi call nigirizushi simply nigiri onigiri make plain rice sometimes lightly salt sushi make rice vinegar sugar salt onigiri make rice portable easy eat well preserve sushi originate way preserve fish november lump carbonize grain rice think riceballs excavate build belong yayoi period year ago sugitani chanobatake ruin ishikawa prefecture carbonize rice trace reveal formed human hand thus initially document old onigiri subsequent research thought steam grilled rather boil like today rice similar another dish call chimaki since academically call chimakishaped carbonized rice lump nakanoto replica relic display roadside station orihimenosato nakanoto use chopstick become widespread nara period rice often roll small ball could easily pick heian period rice make small rectangular shape know tonjiki could pile onto plate easily eaten time onigiri call tonjiki often consumed outdoor picnic lunch first incarnation word onigiri attest hitachi kuni fudoki hitachi province gazette date word use nigiriihi crumpled rice nigiriihi tsukuba kuni kuniburi kotobani ifu tsukuba dialect know nigiriihi murasaki shikibu thcentury diary murasaki shikibu nikki write people eat tonjiki rice ball writing date back far seventeenth century state many samurai store rice ball wrap bamboo sheath quick lunchtime meal war kamakura period early edo period onigiri use quick meal make sense cook simply think make enough onigiri not concern serve onigiri simply ball rice flavor salt nori not become widely available genroku era midedo period farm nori fashion sheet become widespread citation need machine make triangular onigiri invent rather roll fill inside flavor put hole onigiri hole hidden nori since onigiri make machine come nori already apply rice ball time nori become moist sticky cling rice citation need packaging improvement allow nori store separately rice eat diner could open packet nori wrap onigiri use hole fill onigiri make new flavor onigiri easy produce cook process not require change ingredient ingredient modern mechanically wrap onigiri specially fold plastic wrapping nori rice act moisture barrier packaging pull open end nori rice come contact eat together package commonly find triangular onigiri roll citation need usually onigiri make boiled white rice though sometimes make different variety cook rice rice may season salt sesame furikake dry shiso flake onigiri typically triangular come many shape include round cylindrical rectangular etc citation need umeboshi okaka tsukudani long frequently use filling onigiri generally onigiri make preseasoned rice not fill ingredient plain salt onigiri call shiomusubi typical filling list yakionigiri grill onigiri first shape compact white rice grill brown coat soy sauce miso finally broil yakionigiri also sell commercially frozen food misoonigiri mainly eastern japan miso use filling sometimes mixed green onion spread roast variant yakionigiri ageonigiri fry onigiri first shape compact white rice fry fry pan wok use cook oil golden brown oil flavor rich yakionigiri eat season soy sauce miso salt eat soup first place bowl add condiment chives miyakogusa wasabi grate ginger nori umeboshi plum pour hot japanesestyle soup stock eat break onigiri absorb soup stock several variation ageonigiri example version rice fry japanese flavor takikomi gohan also western style variation melt cheese use fill rice deepfried western ingredient ketchup curry onigiri top westernstyle soup bakudanonigiri bombshaped onigiri large spherical rice ball wrap entirely nori rice expose like onigiri usually fill dried fish umeboshi plum bakudanonigiri know simple make easy hold without get hand sticky pork tamagoonigiri pork egg onigiri onip short variation okinawa prefecture combine rice seaweed pork egg similar onigirazu rice lunch meat sandwich form tokyo takagi shrine often call onigiri shrine shinto shrine dedicate takamimusubi androgynous deity creation birth shrine associate concept enmusubi well rice ball shrine dedicate dairokutenma devil king sixth heaven call dairokutensha onigiri unicode emoji"
}