{
    "title": "460 4 \"A Vast Fleet Appears! Here Come the Whitebeard Pirates!\"Transliteration: \"Kyodai Kantai Arawaru – Shūrai! Shirohige Kaizoku-dan\" (Japanese:巨大艦隊あらわる　襲来! 白ひげ海賊団) Takahiro Imamura Hitoshi Tanaka August 1, 2010(2010-08-01)[8]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "460 4 \"A Vast Fleet Appears! Here Come the Whitebeard Pirates!\"Transliteration: \"Kyodai Kantai Arawaru – Shūrai! Shirohige Kaizoku-dan\" (Japanese:巨大艦隊あらわる　襲来! 白ひげ海賊団) Takahiro Imamura Hitoshi Tanaka August 1, 2010(2010-08-01)[8]\n\nWhile the Marines are waiting for Whitebeard's assault and Ace's execution, Monkey D. Garp has a flashback: months before Gol D. Roger was executed, he reveals to Garp that he is having a child and told Garp to look over the child. The Marines search for any people who are connected to Roger. Portgas D. Rouge, Ace's mother and Roger's lover, keeps the child inside her womb months after his execution. However, after Rouge gives birth to the child, a boy whom she names Gol D. Ace, she dies of exhaustion. Soon after, Ace is raised by Garp and Dadan. Garp also introduces Luffy to Ace and they befriended each other. During Sengoku's execution speech, he receives word that the Gates of Justice has been opened without an order, allowing Luffy's ship to pass through. After Whitebeard's fleet appears for the assault, the Moby Dick appears from underwater in front of the execution platform.",
    "tf_idf_text": "vast fleet appear come whitebeard piratestransliteration kyodai kantai arawaru shrai shirohige kaizokudan japanese takahiro imamura hitoshi tanaka august marine wait whitebeards assault ace execution monkey garp flashback month gol roger execute reveals garp child tell garp look child marine search people connect roger portgas rouge ace mother rogers lover keep child inside womb month execution however rouge give birth child boy name gol ace dy exhaustion soon ace raise garp dadan garp also introduce luffy ace befriend sengokus execution speech receive word gate justice open without order allow luffys ship pas whitebeards fleet appear assault moby dick appear underwater front execution platform"
}