{
    "title": "461 5 \"The Beginning of the War! Ace and Whitebeard's Past!\"Transliteration: \"Kessen no Makuake! Ēsu to Shirohige no Kako\" (Japanese:決戦の幕開け! エースと白ひげの過去) Directed by: Sumio WatanabeStoryboarded by: Naoyuki Itō Hitoshi Tanaka August 8, 2010(2010-08-08)[9]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "461 5 \"The Beginning of the War! Ace and Whitebeard's Past!\"Transliteration: \"Kessen no Makuake! Ēsu to Shirohige no Kako\" (Japanese:決戦の幕開け! エースと白ひげの過去) Directed by: Sumio WatanabeStoryboarded by: Naoyuki Itō Hitoshi Tanaka August 8, 2010(2010-08-08)[9]\n\nWhitebeard reveals his Devil Fruit powers in front of the Marines. Whitebeard and Ace's past are shown: Ace was the captain of the Spade Pirates. Ace confronts Jimbei to meet Whitebeard since Ace turned down an offer to become a Warlord. Soon after Whitebeard offered Ace to join his crew when his battle has ended, Ace attempted to kill Whitebeard to no avail. Whitebeard allowed Ace to become a division commander. However, when Blackbeard turned against the crew and killed Thatch, Ace left Whitebeard on a mission to capture Blackbeard. When Ace tells Whitebeard on the execution platform that he ignored his advice, Whitebeard says that he was the one who sent Ace to confront Blackbeard when he originally told him not to go, to cover Ace's mistake in his rescue attempt.",
    "tf_idf_text": "begin war ace whitebeards pasttransliteration kessen makuake shirohige kako japanese direct sumio watanabestoryboarded naoyuki hitoshi tanaka august whitebeard reveals devil fruit power front marine whitebeard ace past show ace captain spade pirate ace confronts jimbei meet whitebeard since ace turn offer become warlord soon whitebeard offer ace join crew battle end ace attempt kill whitebeard avail whitebeard allow ace become division commander however blackbeard turn crew kill thatch ace leave whitebeard mission capture blackbeard ace tell whitebeard execution platform ignore advice whitebeard say one sent ace confront blackbeard originally tell not cover ace mistake rescue attempt"
}