{
    "title": "463 7 \"An All-Consuming Inferno!! Admiral Akainu's Power!\"Transliteration: \"Subete o Yakitsukusu!! Taishō Akainu no Chikara!\" (Japanese:すべてを焼き尽くす!! 大将赤犬の能力!) Yutaka Nakashima Hirohiko Kamisaka August 22, 2010(2010-08-22)[11]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "463 7 \"An All-Consuming Inferno!! Admiral Akainu's Power!\"Transliteration: \"Subete o Yakitsukusu!! Taishō Akainu no Chikara!\" (Japanese:すべてを焼き尽くす!! 大将赤犬の能力!) Yutaka Nakashima Hirohiko Kamisaka August 22, 2010(2010-08-22)[11]\n\nJozu manages to withstand Mihawk's slash with his Devil Fruit power, which turns his body into diamond. Kizaru attempts to attack Whitebeard, but Marco blocks the attack by turning into a phoenix with his Devil Fruit power, and knocks Kizaru back. Jozu digs out a large chunk of the ice and tosses it toward the Marines, but Akainu melts it with his magma-based Devil Fruit power. Akainu counterattacks with his power, sinking one of Whitebeard's ships, but Whitebeard effortlessly extinguishes the magma. While the Marines and the Whitebeard pirates fight on the ice, Coby and Helmeppo start becoming scared, as many Marines more powerful than they have been taken down easily. Little Oars Jr., a descendant of the original Oars steps forward to force his way through the Marine defenses and save Ace, whom he views as a close friend.",
    "tf_idf_text": "allconsuming inferno admiral akainus powertransliteration subete yakitsukusu taish akainu chikara japanese yutaka nakashima hirohiko kamisaka august jozu manages withstand mihawks slash devil fruit power turn body diamond kizaru attempt attack whitebeard marco block attack turn phoenix devil fruit power knock kizaru back jozu dig large chunk ice toss toward marine akainu melt magmabased devil fruit power akainu counterattack power sink one whitebeards ship whitebeard effortlessly extinguish magma marine whitebeard pirate fight ice coby helmeppo start become scar many marine powerful take easily little oar descendant original oar step forward force way marine defense save ace view close friend"
}