{
    "title": "467 11 \"Even If It Means Death! Luffy vs. the Navy; The Battle Starts!\"Transliteration: \"Shindemo Tasukeru – Rufi VS Kaigun Batoru Sutāto\" (Japanese:死んでも助ける ルフィVS海軍戦闘開始) Naoyuki Itō Hitoshi Tanaka September 19, 2010(2010-09-19)[15]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "467 11 \"Even If It Means Death! Luffy vs. the Navy; The Battle Starts!\"Transliteration: \"Shindemo Tasukeru – Rufi VS Kaigun Batoru Sutāto\" (Japanese:死んでも助ける ルフィVS海軍戦闘開始) Naoyuki Itō Hitoshi Tanaka September 19, 2010(2010-09-19)[15]\n\nLuffy charges forward to save Ace, fighting off the marines in the way. Admiral Kizaru attacks him with a beam of light, but Ivankov saves him, only to be attacked by Kuma, whom he claims to know. Luffy encounters Jango and Fullbody; Jango accidentally hypnotizes himself and Fullbody, and Luffy barely escapes from Hina using Gear Two. Elsewhere, the Whitebeard Pirates are having difficulty getting past the Vice Admirals, and Squard attempts to sneak past, only to encounter someone. Moria attacks with a group of zombies, halting Luffy's progress, while Marine reinforcements enter. Ace yells that Luffy must not try to save him, saying that he cannot bear to be saved by a weakling, while actually not wanting Luffy to die. However, Luffy tells him he does not care, and will save Ace even if he dies. As Jimbei arrives, defeating Moria's zombies with a blast of salt water, and Luffy defeats a giant officer with Gear Three, Sengoku reveals to the Marines and the world that Luffy is Ace's adoptive brother and the Revolutionary Monkey D. Dragon's biological son.",
    "tf_idf_text": "even mean death luffy navy battle startstransliteration shindemo tasukeru rufi kaigun batoru sutto japanese naoyuki hitoshi tanaka september luffy charge forward save ace fight marine way admiral kizaru attack beam light ivankov save attack kuma claim know luffy encounter jango fullbody jango accidentally hypnotize fullbody luffy barely escape hina use gear two elsewhere whitebeard pirate difficulty get past vice admiral squard attempt sneak past encounter someone moria attack group zombies halt luffys progress marine reinforcement enter ace yell luffy must not try save say cannot bear save weakling actually not want luffy die however luffy tell not care save ace even die jimbei arrive defeat morias zombie blast salt water luffy defeat giant officer gear three sengoku reveals marines world luffy ace adoptive brother revolutionary monkey dragon biological son"
}