{
    "title": "468 12 \"Hard Battles, One After Another! Devil Fruit Eaters vs. Devil Fruit Eaters!\"Transliteration: \"Gekisen no Renzoku! Nōryokusha Gundan VS Nōryokusha Gundan\" (Japanese:激戦の連続! 能力者軍団VS能力者軍団) Makoto Sonoda Yoshiyuki Suga September 26, 2010(2010-09-26)[16]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "468 12 \"Hard Battles, One After Another! Devil Fruit Eaters vs. Devil Fruit Eaters!\"Transliteration: \"Gekisen no Renzoku! Nōryokusha Gundan VS Nōryokusha Gundan\" (Japanese:激戦の連続! 能力者軍団VS能力者軍団) Makoto Sonoda Yoshiyuki Suga September 26, 2010(2010-09-26)[16]\n\nAce is still upset that the Whitebeard Pirates and even Luffy are still trying to save him, but decides to accept whether he lives or dies. Whitebeard tricks Buggy into helping him, noting that despite being weak, he has powerful followers who could pose a threat. Whitebeard, sensing that the Marines have a plan when the forces in front of them fall back, orders the ships under his command to attack the Marine ships flanking him. Jimbei fights with Moria and defeats him even when he steals several shadows to increase his power. Smoker attacks Luffy and manages to pin him down, but Boa Hancock, angered by him attacking Luffy, attacks him and manages to kick him, despite his Logia powers, with her Haki. Ivankov encounters Kuma, saying they knew each other. However, Doflamingo reveals to Ivankov that the Kuma he knew is dead.",
    "tf_idf_text": "hard battle one another devil fruit eater devil fruit eaterstransliteration gekisen renzoku nryokusha gundan nryokusha gundan japanese makoto sonoda yoshiyuki suga september ace still upset whitebeard pirate even luffy still try save decides accept whether life dy whitebeard trick buggy help note despite weak powerful follower could pose threat whitebeard sense marine plan force front fall back order ship command attack marine ship flank jimbei fight moria defeat even steal several shadow increase power smoker attack luffy manages pin boa hancock anger attack luffy attack manage kick despite logia power haki ivankov encounter kuma say know however doflamingo reveals ivankov kuma knew dead"
}