{
    "title": "468 12 \"Hard Battles, One After Another! Devil Fruit Eaters vs. Devil Fruit Eaters!\"Transliteration: \"Gekisen no Renzoku! Nōryokusha Gundan VS Nōryokusha Gundan\" (Japanese:激戦の連続! 能力者軍団VS能力者軍団) Makoto Sonoda Yoshiyuki Suga September 26, 2010(2010-09-26)[16]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "468 12 Hard Battles One After Another Devil Fruit Eaters vs Devil Fruit Eaters Transliteration Geki sen no Renzo ku N ryo kush a Gund an VS N ryo kush a Gund an Japanese VS Makoto Sonoda Yoshiyuki Suga September 26 2010 2010 09 26 16 Ace is still upset that the White beard Pirates and even Luffy are still trying to save him but decides to accept whether he lives or dies White beard tricks Buggy into helping him noting that despite being weak he has powerful followers who could pose a threat White beard sensing that the Marines have a plan when the forces in front of them fall back orders the ships under his command to attack the Marine ships flanking him Jim bei fights with Moria and defeats him even when he steals several shadows to increase his power Smoker attacks Luffy and manages to pin him down but Boa Hancock angered by him attacking Luffy attacks him and manages to kick him despite his Logia powers with her Hak i Ivan kov encounters Kuma saying they knew each other However Do flamingo reveals to Ivan kov that the Kuma he knew is dead",
    "tf_idf_text": "hard battle one another devil fruit eater devil fruit eater transliteration geki sen renzo ryo kush gund ryo kush gund japanese makoto sonoda yoshiyuki suga september ace still upset white beard pirate even luffy still try save decides accept whether life dy white beard trick buggy help note despite weak powerful follower could pose threat white beard sense marine plan force front fall back order ship command attack marine ship flank jim bei fight moria defeat even steal several shadow increase power smoker attack luffy manages pin boa hancock anger attack luffy attack manage kick despite logia power hak ivan kov encounter kuma say know however flamingo reveals ivan kov kuma knew dead"
}