{
    "title": "473 17 \"The Encircling Walls Activated! The Whitebeard Pirates Backed into a Corner!!\"Transliteration: \"Hōi Sakusen Sadō! Shirohige Kaizoku-dan Zettaizetsumei!!\" (Japanese:包囲壁作動! 白ひげ海賊団絶体絶命!!) Hiroaki Miyamoto Hitoshi Tanaka October 31, 2010(2010-10-31)[21]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "473 17 \"The Encircling Walls Activated! The Whitebeard Pirates Backed into a Corner!!\"Transliteration: \"Hōi Sakusen Sadō! Shirohige Kaizoku-dan Zettaizetsumei!!\" (Japanese:包囲壁作動! 白ひげ海賊団絶体絶命!!) Hiroaki Miyamoto Hitoshi Tanaka October 31, 2010(2010-10-31)[21]\n\nIn a desperate attempt to stop Whitebeard from advancing to the execution platform, the Marines activate walls to block Whitebeard's path, but is stopped by the ice. Squard realizes his error in Whitebeard's stabbing and bursts into tears, but Marco comforts him. Meanwhile, Luffy and his allies charge to the execution platform and the Marines attack them to no avail. Whitebeard confronts John Giant, and defeats him with a punch to the chest. Luffy uses his arms to reach Ace, but the Marines activate the walls and stops Luffy. However, it could not move Oars Jr.'s body. Akainu uses his Meteor Volcano attack to melt the ice in an attempt to prevent Whitebeard's pirates from reaching Ace, much to Luffy's horror.",
    "tf_idf_text": "encircle wall activate whitebeard pirate backed cornertransliteration sakusen sad shirohige kaizokudan zettaizetsumei japanese hiroaki miyamoto hitoshi tanaka october desperate attempt stop whitebeard advance execution platform marine activate wall block whitebeards path stop ice squard realize error whitebeards stab burst tear marco comfort meanwhile luffy ally charge execution platform marines attack avail whitebeard confronts john giant defeat punch chest luffy us arm reach ace marine activate wall stop luffy however could not move oar jrs body akainu use meteor volcano attack melt ice attempt prevent whitebeards pirate reach ace much luffys horror"
}