{
    "title": "477 21 \"The Power That Will Shorten One's Life! Energy Hormone, Redux!\"Transliteration: \"Inochi o Kezuru Chikara – Tenshon Horumon Futatabi\" (Japanese:命を削る力 テンション・ホルモン再び) Naoyuki Itō Yoshiyuki Suga November 28, 2010(2010-11-28)[25]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "477 21 \"The Power That Will Shorten One's Life! Energy Hormone, Redux!\"Transliteration: \"Inochi o Kezuru Chikara – Tenshon Horumon Futatabi\" (Japanese:命を削る力 テンション・ホルモン再び) Naoyuki Itō Yoshiyuki Suga November 28, 2010(2010-11-28)[25]\n\nAce thinks back to his childhood, when he fought with anyone who spoke ill of Roger, and wondering if he should ever have been born. In the present, he’s touched by everyone fighting for him and tearfully realizes that he wants to live. Buggy comes to after recovering from being frozen, and notices that Mr. 3 is gone. Whitebeard doubles over in pain while fighting Akainu, enabling Akainu to severely injure him and distracting Marco and Jozu long enough for them to be injured by Kizaru and Aokiji. Luffy asks for Ivankov to give him Tension Hormones as final repuest to enable him to fight again and save Ace. Ivankov refuses, saying that it will likely kill him and never face Dragon, but Luffy responds by saying that he would rather die than fail to save Ace, causing Ivankov to agree, restoring Luffy’s energy. Coby, despite being afraid earlier and Helmeppo's advice to stay out now that the Marines are almost certain to win, goes out to fight.",
    "tf_idf_text": "power shorten one life energy hormone reduxtransliteration inochi kezuru chikara tenshon horumon futatabi japanese naoyuki yoshiyuki suga november ace think back childhood fought anyone speak ill roger wonder ever bear present he touch everyone fight tearfully realize want live buggy come recover frozen notice go whitebeard double pain fight akainu enable akainu severely injure distract marco jozu long enough injured kizaru aokiji luffy asks ivankov give tension hormone final repuest enable fight save ace ivankov refuse say likely kill never face dragon luffy respond say would rather die fail save ace cause ivankov agree restore luffys energy coby despite afraid early helmeppos advice stay marine almost certain win go fight"
}