{
    "title": "482 26 \"The Power That Can Burn Even Fire! Akainu's Ruthless Pursuit!\"Transliteration: \"Hi o mo Yakitsukusu Chikara – Akainu Hijō no Tsuigeki\" (Japanese:火をも焼き尽くす能力 赤犬非情の追撃) Yoshihiro Ueda Yoshiyuki Suga January 9, 2011(2011-01-09)[30]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "482 26 \"The Power That Can Burn Even Fire! Akainu's Ruthless Pursuit!\"Transliteration: \"Hi o mo Yakitsukusu Chikara – Akainu Hijō no Tsuigeki\" (Japanese:火をも焼き尽くす能力 赤犬非情の追撃) Yoshihiro Ueda Yoshiyuki Suga January 9, 2011(2011-01-09)[30]\n\nWhitebeard's final order leaves his pirates distraught as they leave Marineford for the New World. Meanwhile, Buggy uses a transponder snail and does a public broadcast on the Sabaody Archipelago, angering witnesses. When Akainu mocks Whitebeard, saying that he will not surpass Gol D. Roger, Ace is provoked. Despite his crew's objections, Ace confronts him, but is incapacitated and his vivre card is exposed as Akainu reveals that his Mag-Mag Fruit powers can extinguish fire. Despite Jimbei's objections, Luffy tries to get Ace's vivre card. Akainu launches a powerful attack at Luffy, but Ace jumps in the way at the last second to shield Luffy from his attack. Luffy watches in horror as Ace's vivre card is finally burned up.",
    "tf_idf_text": "power burn even fire akainus ruthless pursuittransliteration yakitsukusu chikara akainu hij tsuigeki japanese yoshihiro ueda yoshiyuki suga january whitebeards final order leave pirate distraught leave marineford new world meanwhile buggy use transponder snail public broadcast sabaody archipelago anger witness akainu mock whitebeard say not surpass gol roger ace provoke despite crew objection ace confronts incapacitate vivre card expose akainu reveals magmag fruit power extinguish fire despite jimbeis objection luffy try get ace vivre card akainu launch powerful attack luffy ace jump way last second shield luffy attack luffy watch horror ace vivre card finally burn"
}