{
    "title": "485 29 \"Ending the Matter! Whitebeard vs. The Blackbeard Pirates!\"Transliteration: \"Kejime o Tsukeru – Shirohige VS Kurohige Kaizoku-dan\" (Japanese:ケジメをつける 白ひげVS黒ひげ海賊団) Katsumi Tokoro Hirohiko Kamisaka January 30, 2011(2011-01-30)[33]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "485 29 \"Ending the Matter! Whitebeard vs. The Blackbeard Pirates!\"Transliteration: \"Kejime o Tsukeru – Shirohige VS Kurohige Kaizoku-dan\" (Japanese:ケジメをつける 白ひげVS黒ひげ海賊団) Katsumi Tokoro Hirohiko Kamisaka January 30, 2011(2011-01-30)[33]\n\nBlackbeard reveals that the entire reason he wanted to become one of the Seven Warlords of the Sea was to gain access to Impel Down, and that he gained entrance by having Laffitte hypnotize the Marines in control of the Gates of Justice to allow all Marine ships, which also enabled Luffy's ship to gain entry. Whitebeard attacks Blackbeard to avenge Thatch, whom Blackbeard had killed to get the Dark-Dark Fruit. Blackbeard uses his Dark-Dark Fruit powers to cancel out Whitebeard's Tremor-Tremor Fruit powers, but Whitebeard gains the upper hand, only to be attacked and mortally wounded by the rest of Blackbeard's crew. With his final words, Whitebeard tells Blackbeard that he will not be the one to find the One Piece, and reveals that Ace may have died, but others with the Will of D have inherited Roger's will and confirms the real existence of the \"One Piece\" in front of the Marines and the world. As his crew mourns their captain, Whitebeard bids farewell to his sons and dies standing up, with hundreds of wounds on his body, but not a single one on his back.",
    "tf_idf_text": "end matter whitebeard blackbeard piratestransliteration kejime tsukeru shirohige kurohige kaizokudan japanese katsumi tokoro hirohiko kamisaka january blackbeard reveals entire reason want become one seven warlord sea gain access impel gain entrance laffitte hypnotize marine control gate justice allow marine ship also enable luffys ship gain entry whitebeard attack blackbeard avenge thatch blackbeard kill get darkdark fruit blackbeard use darkdark fruit power cancel whitebeards tremortremor fruit power whitebeard gain upper hand attack mortally wound rest blackbeard crew final word whitebeard tell blackbeard not one find one piece reveals ace may die others inherited rogers confirms real existence one piece front marine world crew mourn captain whitebeard bid farewell son die stand hundred wound body not single one back"
}