{
    "title": "487 31 \"The Insatiable Akainu! Lava Fists Pummel Luffy!\"Transliteration: \"Akainu no Shūnen! Rufi o Osou Maguma no Kobushi\" (Japanese:赤犬の執念! ルフィを襲うマグマの拳) Gō Koga Hitoshi Tanaka February 13, 2011(2011-02-13)[35]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "487 31 The Insatiable Aka in u Lava Fists Pummel Luffy Transliteration Aka in u no Sh nen Ru fi o Oso u Ma gum a no Ko bushi Japanese G Koga Hitoshi Tanaka February 13 2011 2011 02 13 35 Blackbeard expresses his desire to sink Marine ford into the ocean after destroying the fortress but Sengoku attacks him saying that the island is a symbol of justice in the world The Marines continue to pursue and kill the retreating White beard Pirates and Coby begins hearing the combatants ' voices in his head Aka in u defeats In azuma and Ivan kov then chases down Jim bei and punches through his chest severely injuring both him and Luffy The two fall to the ice below but Crocodile attacks Aka in u and launches Luffy into the air where Buggy catches him Crocodile and White beard's division commanders fight Aka in u to cover Luffy's escape Just as Buggy desperately tries to escape Trafalgar Law arrives in his submarine Law says that Luffy will become his enemy one day but as that is a worthwhile relationship he will give him medical treatment",
    "tf_idf_text": "insatiable aka lava fist pummel luffy transliteration aka nen oso gum bushi japanese koga hitoshi tanaka february blackbeard express desire sink marine ford ocean destroy fortress sengoku attack say island symbol justice world marine continue pursue kill retreat white beard pirate coby begin hear combatant voice head aka defeat azuma ivan kov chase jim bei punch chest severely injure luffy two fall ice crocodile attack aka launch luffy air buggy catch crocodile white beard division commander fight aka cover luffys escape buggy desperately try escape trafalgar law arrive submarine law say luffy become enemy one day worthwhile relationship give medical treatment"
}