{
    "title": "490 34 \"Mighty Leaders Face Each Other Down! Heralding the \"New Era\"!\"Transliteration: \"Gun'yūkakkyosu! \"Atarashī Jidai\" no Hajimari!\" (Japanese:群雄割拠す! \"新しい時代\"の始まり!) Directed by: Takahiro ImamuraStoryboarded by: Naotoshi Shida Hirohiko Kamisaka March 20, 2011(2011-03-20)[38]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "490 34 Mighty Leaders Face Each Other Down Heralding the New Era Transliteration Gun ' y ka k kyo su At a rash Jidai no Haji mari Japanese Directed by Takahiro Imamura Story boarded by Naoto shi S hida Hiro hi ko Kami saka March 20 2011 2011 03 20 38 The public celebrates the end of the Summit War of Marine ford around the world Meanwhile in Marine ford Sengoku is being told that Blackbeard released the Impel Down inmates to join his crew earlier Sengoku is enraged by Blackbeard and the World Government which doesn't want to see its reputation being damaged any more and therefore orders to withhold the news that more prisoners from Level 6 have escaped from Impel Down In the sea Law's submarine surfaces near a Marine ship with Hancock on board Law tells her that even though Luffy has been stabilized he also suffered severe injuries from the battle Ivan kov and the New kama s reveal that Luffy could not stand up in Impel Down because of his condition at that time Ivan kov also says that Luffy pushed himself to save Ace much to Hancock's sadness Jim bei now partially recovered appears despite being told to rest Jim bei tells everyone that he cannot stop worrying once Luffy wakes up Hancock orders Law's crew to call the Kuj a's ship and return to Amazon Lily",
    "tf_idf_text": "mighty leader face herald new era transliteration gun kyo rash jidai haji mari japanese direct takahiro imamura story board naoto shi hida hiro kami saka march public celebrates end summit war marine ford around world meanwhile marine ford sengoku tell blackbeard release impel inmate join crew earlier sengoku enrage blackbeard world government doesnt want see reputation damage therefore order withhold news prisoner level escape impel sea law submarine surface near marine ship hancock board law tell even though luffy stabilize also suffer severe injury battle ivan kov new kama reveal luffy could not stand impel condition time ivan kov also say luffy push save ace much hancock sadness jim bei partially recover appear despite told rest jim bei tell everyone cannot stop worry luffy wake hancock order law crew call kuj ship return amazon lily"
}