{
    "title": "491 35 \"Landing at the Maiden Island! The Harsh Reality Falls Upon Luffy!\"Transliteration: \"Nyōgashima Jōriku – Rufi o Semeru Kakoku na Genjitsu\" (Japanese:女ヶ島上陸 ルフィを責める過酷な現実) Directed by: Makoto SonodaStoryboarded by: Eisaku Inoue Yoshiyuki Suga March 27, 2011(2011-03-27)[39]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "491 35 \"Landing at the Maiden Island! The Harsh Reality Falls Upon Luffy!\"Transliteration: \"Nyōgashima Jōriku – Rufi o Semeru Kakoku na Genjitsu\" (Japanese:女ヶ島上陸 ルフィを責める過酷な現実) Directed by: Makoto SonodaStoryboarded by: Eisaku Inoue Yoshiyuki Suga March 27, 2011(2011-03-27)[39]\n\nAs a result of Whitebeard's death, pirates over the world attack islands while heading to the Grand Line, while islands formally under Whitebeard's protection fall under siege. Meanwhile, the Kuja's pirate ship arrives and escorts Law and his crew to the Maiden Island. Ivankov says goodbye to everyone, agreeing with Jimbei that meeting each other was an interesting experience that might never have happened if it were not for Luffy. Later, Hancock and the Heart Pirates arrive at Maiden Island, where the Heart Pirates are nearly killed before Hancock explains why they are here. However, Nyon tells Hancock that the tribe cannot accept men on their island, but lets the Heart Pirates stay in a small bay on the island while Luffy recovers. Two weeks later, Luffy finally wakes up from his coma and goes berserk. Upon hearing Luffy has woken up, Hancock orders food to be made for him (mostly so she can go and see him), despite not having eaten anything herself in the past two weeks. As a rampage Luffy destroys the jungle, Jimbei discovers Luffy in a state of depression from realizing he is not dreaming, and that Ace really is dead. Luffy sheds tears and screams Ace's name.",
    "tf_idf_text": "land maiden island harsh reality fall upon luffytransliteration nygashima jriku rufi semeru kakoku genjitsu japanese direct makoto sonodastoryboarded eisaku inoue yoshiyuki suga march result whitebeards death pirate world attack islands head grand line islands formally whitebeards protection fall siege meanwhile kujas pirate ship arrive escort law crew maiden island ivankov say goodbye everyone agree jimbei meeting interesting experience might never happen not luffy later hancock heart pirate arrive maiden island heart pirate nearly kill hancock explain however nyon tell hancock tribe cannot accept men island let heart pirate stay small bay island luffy recovers two week later luffy finally wakes coma go berserk upon hear luffy woken hancock order food make mostly see despite not eat anything past two week rampage luffy destroys jungle jimbei discovers luffy state depression realize not dream ace really dead luffy shed tear screams ace name"
}