{
    "title": "492 36 \"The Strongest Tag-Team! Luffy and Toriko's Hard Struggle!\"Transliteration: \"Saikyō Taggu! Funtō, Rufi to Toriko!\" (Japanese:最強タッグ! 奮闘、ルフィとトリコ!) Naoyuki Itō Isao Murayama April 3, 2011(2011-04-03)[40][n 1]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "492 36 The Strongest Tag Team Luffy and To riko's Hard Struggle Transliteration Sai ky Tag gu Fun t Ru fi to To riko Japanese Nao yuki It Isao Mura yama April 3 2011 2011 04 03 40 n 1 To riko and the Straw Hats follow the assailant's tracks and set out to rescue their comrades Nami and Komatsu Along the way they face a fierce group of lions but are aided by To riko's allies Sunny Coco R in They find their friends being held captive on a mountain by a group of mammals called Cocoa las Luffy and To riko defeat the Cocoa las together rescue their friends and discover that the mountain itself is made of a delicious fruit that was rumored to reside there Later an eruption occurs which reveals the entire island to be one giant dessert After Luffy and To riko gorge on the dessert island the Straw Hat crew gathers the provisions they need and sets off on their journey as To riko continues his search for his Full Course Menu Note This episode concludes a crossover which began in Episode 1 of To riko Due to licensing restrictions Funimation skipped this episode in every official release",
    "tf_idf_text": "strong tag team luffy rikos hard struggle transliteration sai tag fun riko japanese nao yuki isao mura yama april riko straw hat follow assailant track set rescue comrade nami komatsu along way face fierce group lion aid rikos ally sunny coco find friends held captive mountain group mammal call cocoa la luffy riko defeat cocoa las together rescue friend discover mountain make delicious fruit rumor reside late eruption occur reveals entire island one giant dessert luffy riko gorge dessert island straw hat crew gather provision need set journey riko continue search full course menu note episode conclude crossover begin episode riko due licensing restriction funimation skip episode every official release"
}