{
    "title": "492 36 \"The Strongest Tag-Team! Luffy and Toriko's Hard Struggle!\"Transliteration: \"Saikyō Taggu! Funtō, Rufi to Toriko!\" (Japanese:最強タッグ! 奮闘、ルフィとトリコ!) Naoyuki Itō Isao Murayama April 3, 2011(2011-04-03)[40][n 1]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "492 36 \"The Strongest Tag-Team! Luffy and Toriko's Hard Struggle!\"Transliteration: \"Saikyō Taggu! Funtō, Rufi to Toriko!\" (Japanese:最強タッグ! 奮闘、ルフィとトリコ!) Naoyuki Itō Isao Murayama April 3, 2011(2011-04-03)[40][n 1]\n\nToriko and the Straw Hats follow the assailant's tracks and set out to rescue their comrades, Nami andKomatsu. Along the way, they face a fierce group of lions, but are aided by Toriko's allies:Sunny,Coco&Rin. They find their friends being held captive on a mountain by a group of mammals called Cocoalas. Luffy and Toriko defeat the Cocoalas together, rescue their friends and discover that the mountain itself is made of a delicious fruit that was rumored to reside there. Later, an eruption occurs which reveals the entire island to be one giant dessert. After Luffy and Toriko gorge on the dessert island, the Straw Hat crew gathers the provisions they need and sets off on their journey, as Toriko continues his search for his Full Course Menu.Note:This episode concludes a crossover which began inEpisode 1ofToriko. Due to licensing restrictions, Funimation skipped this episode in every official release.",
    "tf_idf_text": "strong tagteam luffy torikos hard struggletransliteration saiky taggu funt rufi toriko japanese naoyuki isao murayama april toriko straw hat follow assailant track set rescue comrade nami andkomatsu along way face fierce group lion aid torikos alliessunnycocorin find friends hold captive mountain group mammal call cocoalas luffy toriko defeat cocoalas together rescue friend discover mountain make delicious fruit rumor reside late eruption occur reveals entire island one giant dessert luffy toriko gorge dessert island straw hat crew gather provision need set journey toriko continue search full course menunotethis episode conclude crossover begin inepisode oftoriko due licensing restriction funimation skip episode every official release"
}