{
    "title": "493 37 \"Luffy and Ace! The Story of How the Brothers Met!\"Transliteration: \"Rufi to Ēsu – Kyōdai no Deai no Monogatari!\" (Japanese:ルフィとエース 兄弟の出会いの物語!) Aya Komaki Hitoshi Tanaka April 10, 2011(2011-04-10)[42]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "493 37 \"Luffy and Ace! The Story of How the Brothers Met!\"Transliteration: \"Rufi to Ēsu – Kyōdai no Deai no Monogatari!\" (Japanese:ルフィとエース 兄弟の出会いの物語!) Aya Komaki Hitoshi Tanaka April 10, 2011(2011-04-10)[42]\n\nA flashback of Luffy's life is shown. Ten years before Luffy's journey, Garp takes his grandson to Mt. Corvo. While there, they meet mountain bandit Curly Dadan, along with her henchmen Magra and Dogra. Dadan also reveals about Ace who was adopted by her. While in the jungle, Luffy encounters more mountain bandits and eats their meat to his dismay. Dadan tells him that the mountain bandits are a member of her gang known as the Dadan family. She tells Luffy to work for her. Luffy hits Dadan and tells her that he must be strong. Ace walks away and Luffy pursues him. One week later, Dadan finds Luffy and has him sleep with Ace. Luffy continues to pursue Ace in the forests, and interacts with the animals. After two months, Luffy eventually reaches the end of the forest and finds a junkyard covered with fog.",
    "tf_idf_text": "luffy ace story brother mettransliteration rufi kydai deai monogatari japanese aya komaki hitoshi tanaka april flashback luffys life show ten year luffys journey garp take grandson corvo meet mountain bandit curly dadan along henchman magra dogra dadan also reveal ace adopt jungle luffy encounter mountain bandit eats meat dismay dadan tell mountain bandit member gang know dadan family tell luffy work luffy hit dadan tell must strong ace walk away luffy pursues one week later dadan find luffy sleep ace luffy continue pursue ace forest interact animal two month luffy eventually reaches end forest find junkyard cover fog"
}