{
    "title": "496 40 \"To The Sea Someday! The Pledge of the Three Brats!\"Transliteration: \"Itsuka Umi e! San'nin no Akudō Chikai no Sakazuki!\" (Japanese:いつか海へ! 三人の悪童ちかいの盃!) Yutaka Nakashima Yoshiyuki Suga May 1, 2011(2011-05-01)[45]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "496 40 To The Sea Someday The Pledge of the Three Brats Transliteration Its uk a Umi e San ' n in no Aku d Chi kai no S a kazuki Japanese Yutaka Na kashima Yoshiyuki Suga May 1 2011 2011 05 01 45 Luffy's attempt at using the Gum Gum Pistol technique backfires Luffy is no match for Ace and S abo and is defeated The three invade Edge Town a town located just past the Gray Terminal and fight off several bandits When they go to High Town the trio disguise themselves but are discovered S abo is seen by a noble who is tricked before escaping with the others Back at the forest S abo explains to Ace and Luffy that he is the nobleman's son S abo explains that the reason he left his parents made him study and take lessons on culture to marry a princess Despite his father's objections S abo left for the Gray Terminal S abo explains that his dream is to live freely on the sea and vows that they will become pirates Ace reveals that he will become a pirate to become in famous and Luffy reveals his dream of becoming the King of the Pirates The three become sworn brothers by sharing a drink of sake",
    "tf_idf_text": "sea someday pledge three brat transliteration umi san aku chi kai kazuki japanese yutaka kashima yoshiyuki suga may luffys attempt use gum gum pistol technique backfire luffy match ace abo defeat three invade edge town town locate past gray terminal fight several bandit high town trio disguise discover abo see noble tricked escape others back forest abo explain ace luffy nobleman son abo explains reason leave parent make study take lesson culture marry princess despite father objection abo left gray terminal abo explain dream live freely sea vow become pirate ace reveals become pirate become famous luffy reveals dream become king pirate three become sworn brother share drink sake"
}