{
    "title": "504 48 \"To Live Up to the Promise! Departures of Their Own!\"Transliteration: \"Yakusoku o Hatasu Tame – Sorezore no Tabidachi!\" (Japanese:約束を果たすため それぞれの旅立ち!) Yutaka Nakashima Hitoshi Tanaka June 26, 2011(2011-06-26)[53]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "504 48 \"To Live Up to the Promise! Departures of Their Own!\"Transliteration: \"Yakusoku o Hatasu Tame – Sorezore no Tabidachi!\" (Japanese:約束を果たすため それぞれの旅立ち!) Yutaka Nakashima Hitoshi Tanaka June 26, 2011(2011-06-26)[53]\n\nAfter Sabo's death, Ace and Luffy continue their training while the others discover the Revolutionaries' ship. Meanwhile, Dragon tells Ivankov that he has attracted too much attention and departs for Baltigo. At the Grey Terminal, the villagers begin to accumulate more junk. At the forest, Ace becomes more fond of Luffy as a sworn brother when Luffy is nearly mauled by a bear. After seven years of intensive training, Ace departs from the Goa Kingdom to the ocean and Dadan is emotionally distraught. Three more years pass and Luffy bids farewell to everyone as he departs on his journey to the Grand Line. Luffy encounters the Sea King that ate Shanks's arm again and uses theGum-Gum Pistoltechnique to defeat him. In the present, Luffy is still upset and sad that Ace has died and proclaims to Jimbei that he never be the King of the Pirates because is too weak.",
    "tf_idf_text": "live promise departures owntransliteration yakusoku hatasu tame sorezore tabidachi japanese yutaka nakashima hitoshi tanaka june sabos death ace luffy continue train others discover revolutionary ship meanwhile dragon tell ivankov attract much attention departs baltigo grey terminal villager begin accumulate junk forest ace become fond luffy swear brother luffy nearly maul bear seven year intensive train ace departs goa kingdom ocean dadan emotionally distraught three year pass luffy bid farewell everyone departs journey grand line luffy encounter sea king ate shankss arm use thegumgum pistoltechnique defeat present luffy still upset sad ace die proclaims jimbei never king pirate weak"
}