{
    "title": "506 50 \"Straw Hats in Shock! The Bad News Has Reached Them!\"Transliteration: \"Mugiwara no Ichimi Gekishin! Motarasareta Kyōhō\" (Japanese:麦わらの一味激震! もたらされた凶報) Gō Koga Hitoshi Tanaka July 10, 2011(2011-07-10)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "506 50 \"Straw Hats in Shock! The Bad News Has Reached Them!\"Transliteration: \"Mugiwara no Ichimi Gekishin! Motarasareta Kyōhō\" (Japanese:麦わらの一味激震! もたらされた凶報) Gō Koga Hitoshi Tanaka July 10, 2011(2011-07-10)\n\nOn Kuraigana Island, Zoro confronts and is nearly defeated several Humandrills, but is stopped by Mihawk. On Birdie Kingdom, Chopper is captured by a human tribe and attempts to escape, but is stopped by the giant birds. Eventually, the tribe befriends the birds and Chopper before he receives the newspaper about Ace's fate. On Weatheria, Nami is working hard labor when she also receives the newspaper. On the Bowin Island, Usopp has become overweight despite Heracles' objections and knocks down a News Coo with a newspaper. On Kamabakka Kingdom, Sanji has become a crossdresser and watches the sunset; he receives the newspaper and becomes horrified about Ace's death. On Tequila Wolf, Robin decides to see Luffy and her friends but not before she recevives the Revolutionary Army's notices. Meanwhile, on Baldimore, Franky remembers that he defeated a mechanical polar bear after finding a stash of cola, before a fax machine prints out a newspaper about Ace's death. At Hungaria, Brook is writing music for the Longarm Tribe when he loses his concentration and discovers Ace's death. Back on Kuraigana Island, Zoro tells Mihawk that Kuma teleported him, and Mihawk informs Zoro of Ace's death.",
    "tf_idf_text": "straw hat shock bad news reach themtransliteration mugiwara ichimi gekishin motarasareta kyh japanese koga hitoshi tanaka july kuraigana island zoro confronts nearly defeat several humandrills stop mihawk birdie kingdom chopper capture human tribe attempt escape stop giant bird eventually tribe befriends bird chopper receive newspaper ace fate weatheria nami work hard labor also receive newspaper bowin island usopp become overweight despite heracles objection knock news coo newspaper kamabakka kingdom sanji become crossdresser watch sunset receives newspaper become horrified ace death tequila wolf robin decides see luffy friend not recevives revolutionary army notice meanwhile baldimore franky remembers defeat mechanical polar bear find stash cola fax machine print newspaper ace death hungaria brook write music longarm tribe lose concentration discovers ace death back kuraigana island zoro tell mihawk kuma teleport mihawk informs zoro ace death"
}