{
    "title": "507 51 \"Reunited with Dark King Rayleigh! Decision Time for Luffy!\"Transliteration: \"Meiō Reirī to no Saikai – Rufi Ketsudan no Toki\" (Japanese:冥王レイリーとの再会 ルフィ決断の時) Takahiro Imamura Tomohiro Nakayama July 17, 2011(2011-07-17)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "507 51 \"Reunited with Dark King Rayleigh! Decision Time for Luffy!\"Transliteration: \"Meiō Reirī to no Saikai – Rufi Ketsudan no Toki\" (Japanese:冥王レイリーとの再会 ルフィ決断の時) Takahiro Imamura Tomohiro Nakayama July 17, 2011(2011-07-17)\n\nOn Maiden Island, Rayleigh kills a Sea King and arrives on the island in front of Law's crew. Meanwhile, at Amazon Lily, Hancock is contemplating about marriage when Jimbei and Luffy meet the Dark King, who tells that Law has left the island with his crew. Rayleigh gives back Luffy's straw hat and befriends Hancock and her sisters. Rayleigh tells Hancock that Kuma was the one who sent Luffy to Amazon Lily just before he teleported the Straw Hat crew away. However, Rayleigh cannot bring Luffy back to the Sabaody Archipelago, as he would suffer the same fate on the island. He gives Luffy an offer to be trained. Meanwhile, at the Bowin Islands, an overweight Usopp desperately tries to escape and fight despite Heracles' objections. Usopp is sucked into the island's mouth but is rescued by Heracles. Usopp makes a vow to Heracles that he will not abandon Luffy.",
    "tf_idf_text": "reunite dark king rayleigh decision time luffytransliteration mei reir saikai rufi ketsudan toki japanese takahiro imamura tomohiro nakayama july maiden island rayleigh kill sea king arrives island front law crew meanwhile amazon lily hancock contemplate marriage jimbei luffy meet dark king tell law leave island crew rayleigh give back luffys straw hat befriend hancock sister rayleigh tell hancock kuma one sent luffy amazon lily teleport straw hat crew away however rayleigh cannot bring luffy back sabaody archipelago would suffer fate island give luffy offer train meanwhile bowin island overweight usopp desperately try escape fight despite heracles objection usopp sucked island mouth rescue heracles usopp make vow heracles not abandon luffy"
}