{
    "title": "509 53 \"Encounter! The Great Swordsman Mihawk! Zoro's Self-Willed Deadly Struggle!\"Transliteration: \"Sesshoku! Daikengō Mihōku – Zoro Iji no Shitō\" (Japanese:接触! 大剣豪ミホーク ゾロ意地の死闘) Yoshihiro Ueda Yoshiyuki Suga August 7, 2011(2011-08-07)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "509 53 \"Encounter! The Great Swordsman Mihawk! Zoro's Self-Willed Deadly Struggle!\"Transliteration: \"Sesshoku! Daikengō Mihōku – Zoro Iji no Shitō\" (Japanese:接触! 大剣豪ミホーク ゾロ意地の死闘) Yoshihiro Ueda Yoshiyuki Suga August 7, 2011(2011-08-07)\n\nOn Kuraigana Island, Zoro tries to use Mihawk's boat to escape but is stopped by the humandrills. He also discovers that the humandrills have used Zoro's techniques. Mihawk tells Zoro that humandrills have used their behavior while watching other humans and tells Zoro to rest, but confronts the humandrills. Meanwhile, on Namakura Island, the shamans mistake Brook's music scores as talismans against the Longarm tribe. The Longarms confront the shamans of the island; however, Brook reveals that the talismans are music. After playing a song, the shamans capture some of the tribe members. When Brook tells the shamans to release the Longarms, the tribe captures Brook. On Amazon Lily, Luffy finally makes up his mind and decides to go back to Marineford.",
    "tf_idf_text": "encounter great swordsman mihawk zoros selfwilled deadly struggletransliteration sesshoku daikeng mihku zoro iji shit japanese yoshihiro ueda yoshiyuki suga august kuraigana island zoro try use mihawks boat escape stop humandrills also discover humandrills use zoros technique mihawk tell zoro humandrills use behavior watch human tell zoro rest confronts humandrills meanwhile namakura island shaman mistake brooks music score talismans longarm tribe longarms confront shaman island however brook reveals talisman music playing song shaman capture tribe member brook tell shaman release longarms tribe capture brook amazon lily luffy finally make mind decides back marineford"
}