{
    "title": "509 53 \"Encounter! The Great Swordsman Mihawk! Zoro's Self-Willed Deadly Struggle!\"Transliteration: \"Sesshoku! Daikengō Mihōku – Zoro Iji no Shitō\" (Japanese:接触! 大剣豪ミホーク ゾロ意地の死闘) Yoshihiro Ueda Yoshiyuki Suga August 7, 2011(2011-08-07)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "509 53 Encounter The Great Swordsman Mi hawk Zoro's Self Willed Deadly Struggle Transliteration Ses shoku Dai keng Mih ku Zoro Iji no Shit Japanese Yoshihiro Ueda Yoshiyuki Suga August 7 2011 2011 08 07 On Kura i gana Island Zoro tries to use Mi hawk's boat to escape but is stopped by the human drills He also discovers that the human drills have used Zoro's techniques Mi hawk tells Zoro that human drills have used their behavior while watching other humans and tells Zoro to rest but confronts the human drills Meanwhile on Nama kura Island the shamans mistake Brook's music scores as talismans against the Long arm tribe The Long arms confront the shamans of the island however Brook reveals that the talismans are music After playing a song the shamans capture some of the tribe members When Brook tells the shamans to release the Long arms the tribe captures Brook On Amazon Lily Luffy finally makes up his mind and decides to go back to Marine ford",
    "tf_idf_text": "encounter great swordsman hawk zoros self will deadly struggle transliteration s shoku dai keng mih zoro iji shit japanese yoshihiro ueda yoshiyuki suga august kura gana island zoro try use hawks boat escape stop human drill also discover human drill use zoros technique hawk tell zoro human drill use behavior watch human tell zoro rest confronts human drill meanwhile nama kura island shaman mistake brooks music score talismans long arm tribe long arm confront shaman island however brook reveals talisman music playing song shaman capture tribe member brook tell shaman release long arm tribe capture brook amazon lily luffy finally make mind decides back marine ford"
}