{
    "title": "511 55 \"Unexpected Relanding! Luffy, to Marineford!\"Transliteration: \"Masaka no Saijōriku! Rufi Marinfōdo e!\" (Japanese:まさかの再上陸! ルフィ海軍本部へ!) Makoto Sonoda Hitoshi Tanaka August 21, 2011(2011-08-21)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "511 55 \"Unexpected Relanding! Luffy, to Marineford!\"Transliteration: \"Masaka no Saijōriku! Rufi Marinfōdo e!\" (Japanese:まさかの再上陸! ルフィ海軍本部へ!) Makoto Sonoda Hitoshi Tanaka August 21, 2011(2011-08-21)\n\nLuffy finally arrives at Marineford along with Rayleigh and Jimbei. Luffy uses theGum-Gum Whiptechnique on the Marines, allowing him to reach the Ox Bell – ringing it 16 times to signify the end of the war. Luffy follows the reporters and throws a bouquet of flowers. The reporters take Luffy's pictures, along with his tattoo. Luffy, Jimbei, and Rayleigh leave Marineford. Meanwhile, the Five Elders discuss their plans to fill the three remaining Warlord positions with powerful warriors. At the New World, Sengoku resigns from his Fleet Admiral position. Back at Marineford, Coby decides to get stronger. Meanwhile, Kidd hears of Luffy's recent involvement in Marineford. In the open sea, Bege's ship is sucked into a vortex, Hawkins challenges Brownbeard while reading the news, and Urouge discovers an island with thunderstorms. Kidd uses his Devil Fruit powers to defeat the pirates, and vows to defeat Luffy.",
    "tf_idf_text": "unexpected relanding luffy marinefordtransliteration masaka saijriku rufi marinfdo japanese makoto sonoda hitoshi tanaka august luffy finally arrive marineford along rayleigh jimbei luffy use thegumgum whiptechnique marine allow reach bell ring time signify end war luffy follow reporter throw bouquet flower reporter take luffys picture along tattoo luffy jimbei rayleigh leave marineford meanwhile five elder discuss plan fill three remain warlord position powerful warrior new world sengoku resign fleet admiral position back marineford coby decides get strong meanwhile kidd hears luffys recent involvement marineford open sea beges ship sucked vortex hawkins challenge brownbeard read news urouge discovers island thunderstorm kidd use devil fruit power defeat pirate vow defeat luffy"
}