{
    "title": "511 55 \"Unexpected Relanding! Luffy, to Marineford!\"Transliteration: \"Masaka no Saijōriku! Rufi Marinfōdo e!\" (Japanese:まさかの再上陸! ルフィ海軍本部へ!) Makoto Sonoda Hitoshi Tanaka August 21, 2011(2011-08-21)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "511 55 Unexpected Re landing Luffy to Marine ford Transliteration Ma saka no S aij riku Ru fi Marin f do e Japanese Makoto Sonoda Hitoshi Tanaka August 21 2011 2011 08 21 Luffy finally arrives at Marine ford along with Rayleigh and Jim bei Luffy uses the Gum Gum Whip technique on the Marines allowing him to reach the Ox Bell ringing it 16 times to signify the end of the war Luffy follows the reporters and throws a bouquet of flowers The reporters take Luffy's pictures along with his tattoo Luffy Jim bei and Rayleigh leave Marine ford Meanwhile the Five Elders discuss their plans to fill the three remaining Warlord positions with powerful warriors At the New World Sengoku resigns from his Fleet Admiral position Back at Marine ford Coby decides to get stronger Meanwhile Kidd hears of Luffy's recent involvement in Marine ford In the open sea Be ge's ship is sucked into a vortex Hawkins challenges Brown beard while reading the news and U rouge discovers an island with thunderstorms Kidd uses his Devil Fruit powers to defeat the pirates and vows to defeat Luffy",
    "tf_idf_text": "unexpected land luffy marine ford transliteration saka aij riku marin japanese makoto sonoda hitoshi tanaka august luffy finally arrive marine ford along rayleigh jim bei luffy use gum gum whip technique marine allow reach bell ring time signify end war luffy follow reporter throw bouquet flower reporter take luffys picture along tattoo luffy jim bei rayleigh leave marine ford meanwhile five elder discuss plan fill three remain warlord position powerful warrior new world sengoku resign fleet admiral position back marine ford coby decide get strong meanwhile kidd hears luffys recent involvement marine ford open sea ge ship sucked vortex hawkins challenge brown beard read news rouge discovers island thunderstorm kidd use devil fruit power defeat pirate vow defeat luffy"
}