{
    "title": "512 56 \"With Hopes It Will Reach My Friends! Big News Spreading Fast!\"Transliteration: \"Nakama ni Todoke – Kakemeguru Dai-nyūsu!\" (Japanese:仲間に届け かけめぐる大ニュース!) Yutaka Nakashima Hirohiko Kamisaka August 28, 2011(2011-08-28)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "512 56 \"With Hopes It Will Reach My Friends! Big News Spreading Fast!\"Transliteration: \"Nakama ni Todoke – Kakemeguru Dai-nyūsu!\" (Japanese:仲間に届け かけめぐる大ニュース!) Yutaka Nakashima Hirohiko Kamisaka August 28, 2011(2011-08-28)\n\nBuggy tearfully reunites with his crew on an unknown island. Alvida discovers a treasure mark from which Luffy found in Impel Down. Mr. 3 delivers a message from the World Government to Buggy. At the Sabaody Archipelago, Duval and the Flying Fish Riders confront the Copper Pirates. Shakky, Camie, Hatchan, and Pappag entrust the protection of the ship to Duval. Eventually, the pirates confront Kuma and the World Government. At Alabasta, Cobra, Chaka, and Koza learn they have problems with other pirates. However, Igaram tells them that Vivi and Karoo were excited that Luffy has survived. On another unknown island, Crocodile and Mr. 1 read the news on Luffy's involvement, and decide to return to the New World. Chopper flies on a bird when he receives Luffy's message. Robin travels to the East Blue and receives Luffy's message. On Kamabakka Kingdom, Sanji and Ivankov receive the news on Luffy's involvement. Usopp tries to escape Bowin Island when he and Heracles receive the news. On Weatheria, Nami and Haredas receives Luffy's message while trying to escape. Franky, having survived the explosion at Karakuri Island, also receives the news. Brook is caged by the Longarms when he receives the news. On Kuraigana Island, Zoro and Perona eventually receives Luffy's message.",
    "tf_idf_text": "hope reach friends big news spread fasttransliteration nakama todoke kakemeguru dainysu japanese yutaka nakashima hirohiko kamisaka august buggy tearfully reunite crew unknown island alvida discovers treasure mark luffy find impel delivers message world government buggy sabaody archipelago duval fly fish rider confront copper pirate shakky camie hatchan pappag entrust protection ship duval eventually pirate confront kuma world government alabasta cobra chaka koza learn problem pirate however igaram tell vivi karoo excite luffy survive another unknown island crocodile read news luffys involvement decide return new world chopper fly bird receives luffys message robin travel east blue receives luffys message kamabakka kingdom sanji ivankov receive news luffys involvement usopp try escape bowin island heracles receive news weatheria nami haredas receives luffys message try escape franky survive explosion karakuri island also receive news brook cage longarms receive news kuraigana island zoro perona eventually receive luffys message"
}