{
    "title": "515 59 \"I Will Get Much, Much Stronger! Zoro's Pledge to his Captain!\"Transliteration: \"Madamada Tsuyoku Naru! Zoro Senchō e no Chikai\" (Japanese:まだまだ強くなる! ゾロ船長への誓い) Yoshihiro Ueda Tomohiro Nakayama September 18, 2011(2011-09-18)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "515 59 \"I Will Get Much, Much Stronger! Zoro's Pledge to his Captain!\"Transliteration: \"Madamada Tsuyoku Naru! Zoro Senchō e no Chikai\" (Japanese:まだまだ強くなる! ゾロ船長への誓い) Yoshihiro Ueda Tomohiro Nakayama September 18, 2011(2011-09-18)\n\nAt the Tehna Gehna Kingdom, Brook is displayed to the townsfolk while reading the newspaper. Brook tries to train himself so he can reach 40 degrees, but this fails. Brook decides to perform his new song, \"Bone to be Wild\", on a guitar. Meanwhile, under the East Blue's large bridge, the Revolutionaries learn of Robin's past with Crocodile as they depart to Baltigo. Despite Robin's initial reluctance, Robin finally decides to improve herself by joining them. At the Bowin Islands, Usopp tells Heracules about his past with Luffy and decides to train under him to become stronger. Heracules tells Usopp about the Pop Greens, which can be used as a weapon, before he begins to exercise again. On Kuraigana Island, Mihawk declines Zoro's request to train him, but after realizing that Zoro defeated the Humandrills, Mihawk finally decides to train him. Zoro then proceeds to begin his training by fighting the Humandrills again. The other Straw Hat Pirates are informed that in two years from now, they will reunite with Luffy at the Sabaody Archipelago.",
    "tf_idf_text": "get much much strong zoros pledge captaintransliteration madamada tsuyoku naru zoro sench chikai japanese yoshihiro ueda tomohiro nakayama september tehna gehna kingdom brook display townsfolk read newspaper brook try train reach degree fail brook decides perform new song bone wild guitar meanwhile east blue large bridge revolutionary learn robin past crocodile depart baltigo despite robin initial reluctance robin finally decide improve join bowin island usopp tell heracules past luffy decides train become strong heracules tell usopp pop green use weapon begin exercise kuraigana island mihawk decline zoros request train realize zoro defeat humandrills mihawk finally decide train zoro proceeds begin train fight humandrills straw hat pirate inform two year reunite luffy sabaody archipelago"
}