{
    "title": "516 60 \"Luffy's Training Begins! To the Place We Promised in 2 Years!\"Transliteration: \"Rufi Shugyō Kaishi – Ninengo ni Yakusoku no Basho de\" (Japanese:ルフィ修行開始 2年後に約束の場所で) Katsumi Tokoro Hirohiko Kamisaka September 25, 2011(2011-09-25)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_14",
    "transformers_text": "516 60 \"Luffy's Training Begins! To the Place We Promised in 2 Years!\"Transliteration: \"Rufi Shugyō Kaishi – Ninengo ni Yakusoku no Basho de\" (Japanese:ルフィ修行開始 2年後に約束の場所で) Katsumi Tokoro Hirohiko Kamisaka September 25, 2011(2011-09-25)\n\nJimbei thanks Luffy for what he has done to him. Vowing to meet again at Fishman Island, Jimbei and Luffy go their separate ways. At Rayleigh's request, Hancock's ship lands on a Ruskaina, an abandoned island northwest of Maiden Island. As Hancock and Luffy go their separate ways, Rayleigh tells Luffy about the island. Luffy tries to attack a large elephant withGear Two, but it fails. Rayleigh teaches Luffy twoHakitechniques, using the first technique,Observation Haki(a power feeling a person's presence) to avoid the elephant's attack. Rayleigh then knocks out the elephant with the second techniqueArmament Haki(another technique used as an invisible shield and can render a Logia-type Devil Fruit user unconscious). Rayleigh also reveals that theArmament Hakican be transferred into a weapon. When the elephant tries to attack again, Rayleigh finally defeats it using the third and final techniqueConqueror's Haki, a rare type ofHakithat can only be awakened by a user. Luffy promises to Rayleigh that he will stay to train hard for the next two years to control hisHakitechniques and prepare to reunite with his crew. The next day, Luffy begins his hard training with Rayleigh.",
    "tf_idf_text": "luffys training begin place promised yearstransliteration rufi shugy kaishi ninengo yakusoku basho japanese katsumi tokoro hirohiko kamisaka september jimbei thanks luffy do vow meet fishman island jimbei luffy separate way rayleighs request hancock ship land ruskaina abandon island northwest maiden island hancock luffy separate way rayleigh tell luffy island luffy try attack large elephant withgear two fails rayleigh teach luffy twohakitechniques use first techniqueobservation hakia power feeling person presence avoid elephants attack rayleigh knock elephant second techniquearmament hakianother technique use invisible shield render logiatype devil fruit user unconscious rayleigh also reveal thearmament hakican transfer weapon elephant try attack rayleigh finally defeat use third final techniqueconquerors haki rare type ofhakithat awaken user luffy promise rayleigh stay train hard next two year control hishakitechniques prepare reunite crew next day luffy begin hard training rayleigh"
}