{
    "title": "en.wikipedia.org_wiki_ICv2",
    "url": "https://en.wikipedia.org/wiki/ICv2",
    "transformers_text": "ICv2 is an online trade magazine that covers geek culture for retailers. [ 1 ] ICv2' s main areas of focus are comic books , anime , gaming , and show business products. The site offers news, reviews, analysis, [ 2 ] and sales information for retailers and librarians. ICv2 holds an annual trade conference in conjunction with the New York Comic Con ; the company also periodically publishes ICv2 Retailer Guides in hard copy format.\n\nThe site is produced by GCO, LLC, based in Madison, Wisconsin .\n\nICv2 stands for Internal Correspondence version 2 , named after a trade magazine published in the 1980s-1990s by Capital City Distribution .\n\nCapital City Distribution co-founder Milton Griepp published Internal Correspondence , first as a newsletter and then as a magazine, until Capital City was acquired by Diamond Comic Distributors in 1996, retaining rights to the name. He launched ICv2 in January 2001. The ICv2 Retailer Guides magazines were launched in 2002.\n\nIn 2011, [ 3 ] ICv2 began holding an industry conference on the eve of the New York Comic Con , at the Jacob K. Javits Convention Center . Held annually, the ICv2 event is now known as the \"White Paper Happy Hour.\" [ 4 ]\n\nGriepp (on behalf of ICv2 ) supervised the 2015 American Anime Awards balloting.\n\nICv2: The Business of Pop Culture, edited by Griepp, was nominated for the \"Best Comics-Related Periodical/Journalism\" Eisner Award in 2025. [ 5 ] In July 2025, ICv2 announced they had \"transitioned to a fully remote company after occupying offices in Madison, Wisconsin for its first 24 years\". [ 6 ]",
    "tf_idf_text": "icv online trade magazine cover geek culture retailer icv main area focus comic book anime game show business product site offer news review analysis sale information retailer librarians icv hold annual trade conference conjunction new york comic con company also periodically publish icv retailer guide hard copy format site produce gco llc base madison wisconsin icv stand internal correspondence version name trade magazine publish capital city distribution capital city distribution cofounder milton griepp publish internal correspondence first newsletter magazine capital city acquire diamond comic distributor retain right name launch icv january icv retailer guide magazine launch icv begin hold industry conference eve new york comic con jacob javits convention center hold annually icv event know white paper happy hour griepp behalf icv supervise american anime award ballot icv business pop culture edit griepp nominate best comicsrelated periodicaljournalism eisner award july icv announce transition fully remote company occupy office madison wisconsin first year"
}