{
    "title": "en.wikipedia.org_wiki_Butsu_Zone",
    "url": "https://en.wikipedia.org/wiki/Butsu_Zone",
    "transformers_text": "Butsu Zone ( 仏ゾーン , Butsu Zōn ; \"Buddha Zone\") is a Japanese manga series written and illustrated by Hiroyuki Takei . It was serialized in Shueisha 's Weekly Shōnen Jump from March to August 1997, with its chapters collected in three tankōbon volumes. \"Buddha Zone\" is the concept by which a Buddha can appear on Earth using a Buddha statue.\n\nThe series highlights the adventures of Senju (the Thousand-Hand Avalokiteśvara Bodhisattva ) who has to find and protect Sachi, an incarnation of the Buddha Miroku (Maitreya Bodhisattva). Miroku is said to appear on Earth at a time when the Dharma is no longer taught and is completely forgotten, achieve complete enlightenment and then re-teach the pure dharma, becoming a successor of Śākyamuni Buddha, the founder of Buddhism. It is thus Senju's job to aid Miroku (Sachi) in achieving enlightenment, enabling her to achieve Buddha.\n\nIn 1975, a young orphan girl named Sachi protests against the planned destruction of the temple Saigan (her home) by the Minoura clan, who plans to build a hotel in its place. When one of the gangsters notices the statue of the Thousand-Hand Kannon within the temple, Sachi tells them that she will not allow anything to happen to the statue. In response, the gangsters laugh and threaten her, telling her that there is nothing the statue can do to save her. However, the Thousand-Hand Kannon comes to life, breaking the temple doors and attacking one of the gangsters. The statue shatters into pieces and inside it is a boy who tells them to lay their hands off Sachi, sending fear amongst the gangsters who then flee, vowing revenge. The boy introduces himself as Senju, the Thousand-Hand Kannon.\n\nSenju, as an emissary of the buddha Kannon, has appeared in the human world to find and protect the reincarnation of the future Buddha, Miroku . Recognizing Sachi as Miroku, Senju reveals that it is his mission to accompany her to India where she will awaken and achieve enlightenment to save the world from destruction. However, they are inhibited by the Mara , forces that seek to pollute with earthly desires, and Buddha who believe that Senju is not strong enough to protect Sachi from harm.\n\nButsu Zone is written and illustrated by Hiroyuki Takei . The manga was serialized in Weekly Shōnen Jump from March 3 to August 14, 1997. [ 1 ] Shueisha collected the nineteen individual chapters known as \"Butsu\" into three tankōbon . The first was published on July 4, 1997; the final was released on December 4, 1997. Shueisha re-released the series in two volumes on July 18, 2007. [ 2 ] [ 3 ]",
    "tf_idf_text": "butsu zone butsu buddha zone japanese manga series write illustrated hiroyuki takei serialize shueisha weekly shnen jump march august chapter collect three tankbon volume buddha zone concept buddha appear earth use buddha statue series highlight adventure senju thousandhand avalokitevara bodhisattva find protect sachi incarnation buddha miroku maitreya bodhisattva miroku say appear earth time dharma longer teach completely forget achieve complete enlightenment reteach pure dharma become successor kyamuni buddha founder buddhism thus senjus job aid miroku sachi achieve enlightenment enable achieve buddha young orphan girl name sachi protest plan destruction temple saigan home minoura clan plan build hotel place one gangster notice statue thousandhand kannon within temple sachi tell not allow anything happen statue response gangster laugh threaten tell nothing statue save however thousandhand kannon come life break temple door attack one gangster statue shatters piece inside boy tell lay hand sachi send fear amongst gangster flee vow revenge boy introduces senju thousandhand kannon senju emissary buddha kannon appear human world find protect reincarnation future buddha miroku recognize sachi miroku senju reveals mission accompany india awaken achieve enlightenment save world destruction however inhibit mara force seek pollute earthly desire buddha believe senju not strong enough protect sachi harm butsu zone write illustrated hiroyuki takei manga serialize weekly shnen jump march august shueisha collect nineteen individual chapter know butsu three tankbon first publish july final release december shueisha rereleased series two volume july"
}