{
    "title": "en.wikipedia.org_wiki_Diamond_Comic_Distributors",
    "url": "https://en.wikipedia.org/wiki/Diamond_Comic_Distributors",
    "transformers_text": "Diamond Comic Distributors, Inc. (often called Diamond Comics , DCD , or casually Diamond ) is an American comic book distributor serving retailers in North America and worldwide. It transported comic books and graphic novels, as well as other popular culture products such as toys, games, and apparel, from comic book publishers or suppliers to retailers , before bankruptcy in 2025.\n\nIt is owned by Geppi Family Enterprises , which is also the parent company of Gemstone Publishing , E. Gerber Products, Diamond International Galleries, Hake's Americana & Collectibles, Morphy's Auctions, the Geppi's Entertainment Museum , and Baltimore magazine.\n\nOn May 16th 2025, the publishing arm and other subsidiaries of Diamond were sold to Sparkle Pop, a subsidiary of Ad Populum, while Alliance Game Distributors was sold to Universal Distribution. The acquisition included several companies under the Geppi Family Enterprises umbrella. Diamond's publishing arm was also the publisher of Previews , a monthly catalog/magazine showcasing upcoming comic books, graphic novels, toys, and other pop-culture merchandise. Diamond UK was sold to its management team .\n\nDiamond Comic Distributors, Inc. itself remains a separate entity involved in bankruptcy proceedings.\n\nIn 1982, Baltimore-based comics retailer Steve Geppi founded Diamond Comic Distributors. Diamond became the successor to direct-sales pioneer Phil Seuling 's distribution dream when it took over New Media/Irjax 's warehouses in 1982. Diamond further bought out early distributor Bud Plant Inc. in 1988, and main rival Capital City Distribution in 1996, to assume a near-monopoly on comics distribution, including exclusivity deals with the major comic book publishers .\n\nBy 1981/1982 Geppi had four comics retail locations and was already \"doing a little informal distributing... for smaller retailers.\" [ 1 ] Geppi found himself \"one of the biggest accounts\" for New Media/Irjax, [ 1 ] and when the distributor \"relocated to Florida, he asked Geppi to service more accounts for a bigger discount.\" [ 1 ] One of the \"last loyal customers\" when New Media began having fiscal difficulties, Geppi made a deal: \"[t]he owner was going into retail,\" so Geppi agreed to provide New Media/Irjax with \"free books for a period of time in return for his account list,\" buying parts of the company, and founding Diamond Comic Distribution. [ 1 ]\n\nGeppi had been a sub-distributor for Hal Shuster's Irjax in the late 1970s. [ 2 ] In what Mile High Comics ' Chuck Rozanski describes as an \"incredibly risky and gutsy move,\" Geppi took over New Media/Irjax's \"office and warehouse space\" and, recalled Rozanski, had to \"sort out the good customers from the bad overnight\" negotiating with creditors to continue Shuster's distribution business as Diamond Comic Distribution. [ 3 ] Almost overnight, noted Rozanski, \"[h]e went from being a retailer in Baltimore to having warehouses all over the place.\" [ 3 ]\n\nGeppi named his new company 'Diamond' \"after the imprint Marvel Comics used on non-returnable comics,\" and although the \"publisher discontinued the symbol\" months later, the name remained. [ 1 ] \"Diamond grew an average of 40 percent a year,\" as comics retail took off. [ 1 ]\n\nIn 1983, Diamond hired an accounting firm. In 1985, Diamond hired \"no-nonsense CPA\" Chuck Parker \"as Diamond's first controller\". [ 1 ] In 1994, Diamond employee Mark Herr noted that this move was Geppi's \"best decision\", as Parker \"cares nothing about the comics. To him, it's dollars and cents.\" [ 1 ] Parker describes his role as \"smooth[ing] the emotion out of some decisions. Steve [Geppi] is a visionary and a risk-taker... and I tend to be more conservative.\" [ 1 ]\n\nAfter starting his business through buying New Media/Irjax's warehouses and offices in 1982, Geppi's distribution company has bought out many other distribution companies since. Many fans \"with little experience\" started rival distribution companies only to \"find they were in over their heads,\" allowing Geppi to \"[buy] out the smart ones or pick... up the pieces after the stupid ones went out of business,\" according to Herr. [ 1 ] Diamond was aided in his efforts by the publishers themselves. In the early 1980s, Marvel Comics and DC Comics provided trade terms favorable for larger distributors and those with efficient freight systems, effectively \"play[ing] into the hands of the major distributors such as Capital and Diamond,\" and hastening the demise of smaller distributors. [ 2 ]\n\nIn 1988, Previews , Diamond's monthly magazine showcasing upcoming comic books was first published. [ 4 ]\n\nMost notably, in 1988, Geppi bought up early mail-order distributor Bud Plant Inc., [ 5 ] who had himself bought out Charles Abar Distribution in 1982. [ 6 ] Plant had, since 1970, been selling underground comics (a field which Geppi and fellow distributor Buddy Saunders had tended to steer clear of). [ 6 ] After making $19m in sales in 1987, Diamond bought West Coast distributor Plant's business [ 7 ] in 1988 \"and went national\" [ 1 ] thereby assuming control of \"40 percent of the direct-sales market .\" [ 6 ] (Diamond and Capital City Distribution had control of at least 70% between them.)\n\nIn 1990, Diamond acquired Oregon-based Second Genesis Distribution [ 4 ] (whose operations folded in 1991). [ 8 ] Second Genesis had previously absorbed distributors Sunrise Distributors and Comex. One week after announcing the acquisition of Second Genesis, Diamond announced the acquisition of the Seattle-based sub-distributor Destiny Distribution . [ 4 ] [ 9 ] Destiny had been started by Phil Pankow in the early 1980s, and was initially supplied by Bud Plant .\n\nIn 1991, Diamond moved into the UK market, acquiring Neptune Comic Distributors Ltd. (to whom they had formerly supplied US comics for the UK market), in the process creating Diamond UK. In 1993, Diamond acquired the single remaining dominant British distributor Titan Distributors , [ 10 ] thus cornering the direct market in the United Kingdom. [ 11 ]\n\nIn 1994, Diamond acquired Staten Island-based distributor Comics Unlimited . [ 4 ] By this point, Diamond had \"27 warehouses in the U.S., Canada, and the U.K., employ[ing] between 750 and 900 people;\" operated its own trucking line; and controlled 45% of the market, making $222 million in sales. [ 1 ]\n\nIn 1996, Diamond launched the toll-free Comic Shop Locator service. [ 4 ]\n\nIn 1995, Marvel Comics challenged Diamond and main rival Capital City by buying the third largest distributor — Heroes World Distribution — and distributing its titles in-house after taking over from Curtis Circulation . [ 12 ] On April 26, 1995, Diamond reacted by outbidding Capital City for exclusive deals with Marvel's main rivals DC Comics, [ 13 ] Dark Horse and Image on July 24, and Valiant Comics in August. [ 14 ] Capital City's response saw it sign exclusive deals with Kitchen Sink Press and Viz Comics , but a year later faced the choice between bankruptcy and selling out. Diamond bought Capital City on July 26, 1996, assuming near-control of the comics distribution system. [ 12 ] [ 15 ] [ 16 ] The purchase price was not disclosed, but the acquisition brought an estimated $50 million in sales revenue to Diamond. [ 15 ]\n\nIn early 1997, when Marvel's Heroes World endeavor failed, Diamond also forged an exclusive deal with Marvel after the publisher's filing for Chapter 11 bankruptcy protection in December 1996. [ 17 ] — giving the company its own section of comics catalog Previews (not least because the DC/Dark Horse/Image deal gave contractual prominence to those companies) — making \"Geppi... the sole king of comics industry distribution in the summer of 1996.\" [ 3 ]\n\nIn 1997, Diamond's position in the comics industry, as \"the sole source of most new comics products to comics specialty shops,\" ultimately saw the company become the subject of \"an investigation by the U.S. Justice department for possible antitrust violations.\" [ 2 ] The Justice Department launched an antitrust investigation into the comics industry and the alleged monopoly of Diamond Comics. The investigation was closed in November 2000, with no further action deemed necessary [ 18 ] [ 19 ] on the basis that, although Diamond enjoyed a monopoly in the North American comic book direct market distribution, they did not enjoy a monopoly on book distribution (books including non-comic books).\n\nIn addition to having cornered the American comics distribution market, Diamond includes a number of subsidiary and affiliated companies. UK and European comics distribution is served by Diamond UK, based in Runcorn, England. [ 20 ]\n\nOn August 31, 2000, Diamond Comic Distributors acquired Alliance Game Distributors , North America's largest distributor of tabletop games. [ 21 ]\n\nIn 2002, Diamond consolidated its book trade into Diamond Book Distributors, marketing graphic novels and trade paperbacks to bookstores including Barnes & Noble , Ingram , Baker & Taylor , Amazon.com and Borders . [ 20 ]\n\nOn March 23, 2020, Geppi announced that Diamond would stop sending comics to retail shops until further notice and had instructed printers not to send any new shipments to the company, due to the COVID-19 pandemic . Issues of comics with United States release dates of April 1 or later, and with United Kingdom release dates of March 25 or later, would not be shipped until normal operations resumed. [ 22 ] The shutdown took effect on April 1, 2020, and ended on May 20. [ 23 ]\n\nOn June 5, 2020, DC Comics announced that they would discontinue their distribution agreement with Diamond and that their books would now be distributed by Penguin Random House for their graphic novels and by UCS Comic Distributors (subsidiary of Midtown Comics ) and Lunar Distribution (subsidiary of Discount Comic Book Service in Fort Wayne , Indiana ). While acknowledging how huge the decision was, DC reiterated that the move was intended to fortify and increase the viability of the comic book direct market while also widening its fan base. [ 24 ]\n\nOn March 25, 2021, Marvel Comics announced they plan to shift their direct market distribution, for both monthly comics and graphic novels, to Penguin Random House. The change was implemented on October 1, 2021, in a multi-year partnership. Unlike DC Comics' complete split, Marvel will still be giving stores the option to order comics from Diamond, but Diamond will be acting as a wholesaler rather than distributor. [ 25 ]\n\nOn September 17, 2021, IDW Publishing announced a new deal with Penguin Random House to distribute newly published and backlist comic book periodicals, trade collections, and graphic novels to the Direct Market comic shops beginning June 1, 2022. The deal is non-exclusive, allowing retailers to choose ordering from Penguin Random House directly or from Diamond as a wholesaler rather than a distributor in the US and the UK. [ 26 ]\n\nOn January 14, 2025, Diamond filed for Chapter 11 bankruptcy protection to facilitate the restructuring of its operations. The company received a $39 million stalking horse bid to sell off Alliance Game Distributors to Canadian-based hobby distributor Universal Distribution . [ 27 ] Alliance Entertainment ultimately won the bid to acquire Diamond's assets in March, but later backed out after filing multiple lawsuits against the company. [ 28 ]\n\nA joint bid between Universal Distribution and Ad Populum was then approved and finalized in May 2025. Universal acquired the assets of Alliance Game Distributors, while Ad Populum acquired Diamond Comic Distributors, Diamond Book Distributors, Diamond Select Toys & Collectibles, Collectible Grading Authority, and other assets. Diamond UK was not included in this sale. [ 28 ] [ 29 ] [ 30 ]\n\nMajor layoffs at Diamond were reported soon after, including the shutdown of Diamond Select Toys. [ 31 ] [ 32 ] Penguin Random House ended its sub-distributor agreement with Diamond, ending its distribution of comics from Marvel Comics, Dark Horse Comics, IDW Publishing, BOOM! Studios, and others. [ 28 ] [ 33 ] [ 34 ] By the end of May, Udon Entertainment had ceased shipments to Diamond. [ 35 ] Dynamite Entertainment ceased shipments to Diamond and shifted to Lunar Distribution in mid-June. [ 36 ] By July, Diamond's ComicSuite POS and PullBox pre-ordering system were shut down. [ 37 ]\n\nDiamond's existing inventory was not included in the sale, so the old company began selling it without paying publishers. There are nearly 130 companies affected, including Fanatagraphics and Dynamite, which is owned over $1 million and in danger of not meeting payroll. [ 38 ] [ 39 ] [ 40 ] [ 41 ] The Collectible Grading Authority, one of Diamond's smaller assets and a rival to Certified Guaranty Company , was later purchased by a consortium of investors in July 2025. [ 41 ] Diamond UK was sold in September 2025 for about $2 million as part of a management buyout . [ 42 ]\n\nThe main company Diamond Comic Distributors, Inc. itself still remains a separate independent entity involved in the Chapter 11 bankruptcy case. [ 43 ]\n\nIn 1983, Diamond was criticized for taking exception to certain \"adult\"-themed titles and scenes, effectively causing the cancellation of a series called Void Indigo for its excessive violence. [ citation needed ]\n\nIn 1987, Geppi responded to \"a graphic childbirth scene in Miracleman #9 [written by Alan Moore ].\" Geppi wrote to retailers that:\n\n\"Diamond values its retailers too much to take chances on such a dangerous situation... We are not censors . We no more want someone deciding for us than you do. We cannot, however, stand by and watch the marketplace become a dumping ground for every sort of graphic fantasy that someone wants to live out. We have an industry to protect; we have leases to abide by; we have a community image to maintain.\" [ 3 ]\n\nThis call for retailers to refuse to stock Miracleman [ 44 ] led to accusations of censorship, [ 45 ] charges the company was forced to address when it criticized or refused to carry other titles, including books by Kitchen Sink Press, [ 46 ] Dave Sim in 1988, [ 46 ] [ 47 ] [ 48 ] [ 49 ] Jon Lewis in 1994, [ 50 ] and Mike Diana in 1996. [ 51 ]\n\nDiamond lost customers with this approach, however, \"and eventually backed down.\" [ 1 ] Geppi recalls compromising, and accepting \"that as a distributor, I owed the retailers the product they wanted.\" [ 1 ] In fact, in an attempt to prove Diamond did not practice censorship, the company joined DC Comics in 1993 to raise money for the industry's First Amendment advocacy group Comic Book Legal Defense Fund . [ 52 ]\n\nBecause of its industry dominance, Diamond also faced charges it bullied publishers [ 53 ] and discriminated against small publishers. These charges first surfaced in 1988 when Diamond rejected Matt Feazell 's comic Ant Boy , [ 54 ] [ 55 ] and in 1989 when it similarly decided not to carry Allen Freeman 's Slam Bang anthology. [ 56 ]\n\nAfter the industry consolidation of 1996, Diamond faced similar charges in 1996, [ 51 ] 1999, [ 57 ] and 2000 (when smaller publishers like Fantagraphics and Drawn & Quarterly lodged complaints). [ 58 ] [ 59 ] [ 60 ] [ 61 ]\n\nDiamond's monthly comics retail catalog, Previews , had been produced by Diamond for over 25 years for store owners and comic shop customers to order their products. It was additionally available for sale to customers to facilitate pre-orders from \"pull and hold\" or subscription customers who frequent comic shops on a regular basis. Comics publishers vied for space within the publication's pages, with Dark Horse, DC Comics, Image Comics, and IDW Publishing taking precedence as \"Premier\" publishers. Marvel Comics has its own mini-catalog of Marvel Previews available separately, for contractual reasons. The print Previews catalog was discontinued in 2025 June, with the final digital catalog being 2025 October catalog ( Previews #445) for items in shops in December or later). [ 62 ]\n\nGeppi is also owner of Gemstone Publishing Inc. , through which he publishes The Overstreet Comic Book Price Guide . [ 63 ] Gemstone has also published Russ Cochran 's EC Comics reprints, Disney comics and Blue Book price guide in the past as well.\n\nIn 1994, Geppi purchased Baltimore magazine, [ 64 ] \"a 50,000-circulation monthly and one of the nation's oldest regional publications.\" [ 63 ]\n\nGeppi's publishing ventures in the comics field saw him create Gemstone Publishing Inc. , which was formed in large part from other purchases. In 1992, Diamond bought Ernst Gerber Publishing (publisher-author of the Photo-Journal Guide to Comics ). [ 3 ] E. Gerber Products, LLC is a Diamond-affiliated company started by Gerber in 1977 which sells Mylar bags as well as \"acid-free boxes and acid-free backing boards\" for comics collectors to store their collection in. [ 20 ] In 1993, Geppi bought Russ Cochran Publishing. [ 3 ] Long-term EC Comics fan Cochran auctioned Bill Gaines ' personal file copies of EC publications, as well as most pages of original EC artwork (which, almost uniquely, Gaines had maintained ownership and possession of), before being granted the reprint rights to the EC back catalog itself. Geppi included Cochran's publications — and Cochran himself — under his new imprint, Gemstone Publishing. [ 63 ]\n\nIn 1994, Geppi bought Overstreet Publishing, taking up the publishing reins of official-Blue Book price guide The Overstreet Comic Book Price Guide , and other related publications, bringing them under the Gemstone imprint. [ 3 ] Geppi's publishing activities with Gemstone Publishing consist primarily of reprints of classic titles and artworks, as well as publications (including professional fanzines \"pro-zines\") focusing heavily on the history of the comics medium. Many Gemstone publications revolve around Comic Book Marketplace -editor and EC-shepherd Russ Cochran.\n\nCochran, like Geppi, was a particular fan of Carl Barks ' Disney comics, and had previously published EC reprints in association with Disney-reprinter Gladstone Publishing . In the early 1990s, Geppi's Gemstone embarked on a full series of reprints of classic EC titles, starting with new reprints of the Cochran/Gladstone-reprints of The Haunt of Fear , The Vault of Horror and Weird Science (all 1992). Gemstone also republished (in single issue and 'annual' — four issues per 'annual' — format) EC's New Trend and New Direction titles (with the exception of Mad ) between 1992 and 2000.\n\nIn 2005, Gemstone added to Cochran's earlier-published oversize, hardback, black & white slip-cased \"The Complete EC Library\" collections with the complete Picto-Fiction collection, comprising the EC comics: Confessions Illustrated , Crime Illustrated , Shock Illustrated and Terror Illustrated , along with \"18 previously unseen stories, never published before\". [ 65 ]\n\nIn 2006, Gemstone began producing a more durable and luxurious series of hardback reprint collections; the EC Archives — similar to the DC Archives and Marvel Masterworks volumes — which reprint in full-color hardback ('archival') format sequential compilations of the EC Comics titles. Designed by art director/designer Michael Kronenberg , a number of volumes have been released, with the entirety of the New Trend and New Direction planned for eventual release. [ 66 ] These EC Archives volumes have drawn praise for their quality, and feature introductions by such notable EC fans as George Lucas , Steven Spielberg , Joe Dante and Paul Levitz .\n\nIn December 2002, it was announced that \"Gemstone Publishing had signed the license to publishing Disney comics in North America,\" with ex-Gladstone Publishing editor-in-chief John Clark joining Gemstone in the same position over its Disney line. [ 67 ] Launched with a title for Free Comic Book Day 2003, the line started soon after with Walt Disney's Comics and Stories and Walt Disney's Uncle Scrooge , both described by Clark as \"monthly 64-page prestige-format books at $6.95, which is the same price they were when last produced, in 1998.\" [ 67 ] Other titles followed, and Gemstone held their license until early 2009. [ 68 ]\n\nThe (Official) Overstreet Comic Book Price Guide was first published by Robert M. Overstreet in 1970 as one of the earliest authorities on American comic book industry grading and collection values. Overstreet sold his company to Gemstone in 1994, [ 69 ] but continued to \"serve as author and/or publisher of Geppi's Entertainment Publishing & Auctions' line of books.\" [ 70 ] Publication of the Price Guide was taken over by Gemstone in 1998, and the twenty-eighth edition to the present have been (co-)published by Geppi's Gemstone publications. [ 71 ] The Guide' s 55th edition is scheduled to be published by Gemstone Publishing in 2025.\n\nOverstreet also produced a variety of smaller publications, updating his yearly guides on a monthly schedule. The most recent of these – Overstreet's Comic Price Review – began publication from Gemstone in July 2003, and was a monthly publication designed to update the yearly price guide more regularly, as well as provide articles, analysis and various lists of comics prices.\n\nGemstone published more than a hundred issues of the magazine Comic Book Marketplace , a monthly magazine for comics fans focusing heavily on the Golden and Silver ages, while more popular magazines (such as Wizard ) skew more recent in focus.\n\nIn early 2009, the future of Gemstone Publishing was unclear, after reports of unpaid printing bills, particularly from the EC Archives. [ 72 ] In April, Geppi responded to the uncertainty, noting that while there had been \"a reduction in staff at Gemstone,\" such moves did \"not signal the end of Gemstone Publishing.\" [ 73 ]\n\nIn 2008, Diamond introduced ComicSuite, an add-on application for Microsoft Dynamics’ Retail Management System (RMS) software. Together, ComicSuite & RMS give specialty storeowners a point-of-sale (POS) system specifically geared towards their unique business model, offering a host of exclusive features that grant you direct communication with Diamond databases, making it easier than ever before to place orders, track inventory and maintain “pull-and-hold” subscriptions for your customers.\"\n\nIn 1995, Geppi founded Diamond International Galleries, which acquired Hake's Americana & Collectibles auction house (2004), and in 2005, Pennsylvania-based Morphy Auctions. [ 74 ] In 1999, Geppi founded Diamond Select Toys , and in 2006 he founded Geppi's Entertainment Museum in Baltimore.\n\nGeppi reorganized its holdings into Geppi Family Enterprises in 2015.\n\nAlliance Game Distributors is North America's largest distributor of tabletop games – role-playing games , collectible card games , miniature wargames , board games , and related merchandise – and the publisher of Game Trade Magazine . [ 21 ] Alliance was acquired by Diamond in August 2000, [ 21 ] two years after being formed by the merger of game distributors Chessex and The Armory . [ 75 ]\n\nEnvisioned to create collectibles for children and adults, DST was founded in 1999 and has since licensed a variety of pop culture properties, including Marvel Comics, Transformers , G.I. Joe: A Real American Hero , Star Wars , Star Trek , Stargate , Ghostbusters , Halo , Buffy the Vampire Slayer , Indiana Jones , Battlestar Galactica , 24 and Back to the Future . While they also make action figures in a variety of sizes, as well as banks, busts, statues and prop replicas, many of their licensed properties are released in the form of Minimates , which has helped make Minimates one of the most prolific and diverse block figure toy lines in the world. In 2007, after years of partnership, Diamond Select Toys made a move to acquire select assets of New York-based design house Art Asylum, [ 76 ] the creators of Minimates and DST has since developed Minimates based on its own concepts, under the brands Minimates M.A.X. and Calico Jack's Pirate Raiders.\n\nIn 1995, Geppi \"opened Diamond International Galleries,\" a showplace for comics and collectibles, part of Geppi's attempts to \"see... collectibles attain serious respect.\" [ 74 ] Nine years later, Diamond International Galleries purchased \"one of the country’s first, and most respected, collectibles auction houses: Hake's Americana & Collectibles.\" [ 74 ] In 2005, Geppi added the \" Denver , Pennsylvania-based Morphy Auctions\" to his growing stable of parts of the collectibles market, which already included publishing the main comics price guide: The Overstreet Comic Book Price Guide . [ 74 ]\n\nGeppi describes his International Galleries as being \"at the heart of many significant opportunities to preserve, promote and present historical comic character collectibles,\" an endeavor that led to his establishing Geppi's Entertainment Museum. [ 20 ] Geppi's galleries showcase much of his private collection, including comics, movie posters , toys, original artwork by individuals including \"Carl Barks, Gustav Tengren (sic) , Alex Ross , Murphy Anderson , Joe Shuster , Joe Simon and Charles Schulz .\" [ 20 ]\n\nDiamond International Galleries has assisted \"in such projects as DC's Archive series ,\" as well as hosting industry events. [ 20 ]\n\nGeppi's Entertainment Museum was a museum in Baltimore , Maryland , tracing the history of pop culture in American over the last four hundred years. Its collections included comic books, magazines , movies , newspapers , television , radio and video game memorabilia , including comic books, movie posters, toys, buttons, badges, cereal boxes, trading cards , dolls and figurines. The majority of the exhibits came from Geppi's private collection, while Geppi's daughter Melissa \"Missy\" Geppi-Bowersox became the executive vice-president of the museum in 2007, after Wendy Kelman left the museum on August 31, 2007, to start her own tourism consulting firm. [ 77 ] The museum's curator was Dr. Arnold T. Blumberg, former editor at Geppi's Gemstone Publishing. The museum closed in June 2018. Geppi donated much of his collection to the Library of Congress . [ 78 ]\n\n{ https://www.diamondcomics.com/Article/281463-Universal-Distribution-LLC-and-Ad-Populum-Complete-Acquisition-of-Diamond-and-Related-Assets}",
    "tf_idf_text": "diamond comic distributor inc often call diamond comic dcd casually diamond american comic book distributor serve retailer north america worldwide transport comic book graphic novel well popular culture product toy game apparel comic book publisher supplier retailer bankruptcy own geppi family enterprise also parent company gemstone publish gerber product diamond international gallery hakes americana collectible morphys auction geppis entertainment museum baltimore magazine may publish arm subsidiary diamond sell sparkle pop subsidiary populum alliance game distributor sell universal distribution acquisition include several company geppi family enterprise umbrella diamond publish arm also publisher preview monthly catalogmagazine showcasing upcoming comic book graphic novel toy popculture merchandise diamond sell management team diamond comic distributor inc remain separate entity involve bankruptcy proceeding baltimorebased comic retailer steve geppi found diamond comic distributor diamond become successor directsales pioneer phil seuling distribution dream take new mediairjax warehouse diamond buy early distributor bud plant inc main rival capital city distribution assume nearmonopoly comic distribution include exclusivity deal major comic book publisher geppi four comic retail location already little informal distribute small retailer geppi find one big account new mediairjax distributor relocate florida ask geppi service account big discount one last loyal customer new medium begin fiscal difficulty geppi make deal owner go retail geppi agree provide new mediairjax free book period time return account list buying part company found diamond comic distribution geppi subdistributor hal shusters irjax late mile high comic chuck rozanski describes incredibly risky gutsy move geppi take new mediairjaxs office warehouse space recall rozanski sort good customer bad overnight negotiating creditor continue shusters distribution business diamond comic distribution almost overnight noted rozanski go retailer baltimore warehouse place geppi name new company diamond imprint marvel comic use nonreturnable comic although publisher discontinue symbol month later name remain diamond grow average percent year comic retail take diamond hire accounting firm diamond hire nononsense cpa chuck parker diamonds first controller diamond employee mark herr note move geppis best decision parker care nothing comic dollar cent parker describe role smooth emotion decision steve geppi visionary risktaker tend conservative starting business buy new mediairjaxs warehouse office geppis distribution company buy many distribution company since many fan little experience start rival distribution company find head allow geppi buy smart one pick piece stupid one go business accord herr diamond aid effort publisher early marvel comic comic provide trade term favorable large distributor efficient freight system effectively play hand major distributor capital diamond hastening demise small distributor preview diamond monthly magazine showcasing upcoming comic book first publish notably geppi buy early mailorder distributor bud plant inc buy charles abar distribution plant since sell underground comic field geppi fellow distributor buddy saunders tend steer clear make sale diamond buy west coast distributor plant business go national thereby assume control percent directsales market diamond capital city distribution control least diamond acquire oregonbased second genesis distribution whose operation fold second genesis previously absorb distributor sunrise distributor comex one week announce acquisition second genesis diamond announce acquisition seattlebased subdistributor destiny distribution destiny start phil pankow early initially supply bud plant diamond move market acquire neptune comic distributor ltd formerly supply comic market process create diamond diamond acquire single remain dominant british distributor titan distributor thus corner direct market united kingdom diamond acquire staten islandbased distributor comic unlimited point diamond warehouse canada employ people operate truck line control market make million sale diamond launch tollfree comic shop locator service marvel comic challenge diamond main rival capital city buying third large distributor hero world distribution distribute title inhouse take curtis circulation april diamond react outbidding capital city exclusive deal marvel main rival comic dark horse image july valiant comic august capital city response saw sign exclusive deal kitchen sink press viz comic year later face choice bankruptcy sell diamond buy capital city july assume nearcontrol comic distribution system purchase price not disclose acquisition bring estimate million sale revenue diamond early marvel hero world endeavor fail diamond also forge exclusive deal marvel publisher file chapter bankruptcy protection december give company section comic catalog preview not least dcdark horseimage deal give contractual prominence company make geppi sole king comic industry distribution summer diamonds position comic industry sole source new comic product comic specialty shop ultimately saw company become subject investigation justice department possible antitrust violation justice department launch antitrust investigation comic industry allege monopoly diamond comic investigation close november action deem necessary basis although diamond enjoy monopoly north american comic book direct market distribution not enjoy monopoly book distribution book include noncomic book addition corner american comic distribution market diamond include number subsidiary affiliate company european comic distribution serve diamond base runcorn england august diamond comic distributor acquire alliance game distributor north americas large distributor tabletop game diamond consolidate book trade diamond book distributor market graphic novel trade paperback bookstores include barnes noble ingram baker taylor amazoncom border march geppi announce diamond would stop send comic retail shop notice instruct printer not send new shipment company due covid pandemic issue comic united state release date april later united kingdom release date march later would not ship normal operation resume shutdown take effect april end may june comic announce would discontinue distribution agreement diamond book would distribute penguin random house graphic novel ucs comic distributor subsidiary midtown comic lunar distribution subsidiary discount comic book service fort wayne indiana acknowledge huge decision reiterate move intend fortify increase viability comic book direct market also widen fan base march marvel comic announce plan shift direct market distribution monthly comic graphic novel penguin random house change implement october multiyear partnership unlike comic complete split marvel still give store option order comic diamond diamond act wholesaler rather distributor september idw publishing announce new deal penguin random house distribute newly publish backlist comic book periodical trade collection graphic novel direct market comic shop begin june deal nonexclusive allow retailer choose order penguin random house directly diamond wholesaler rather distributor january diamond file chapter bankruptcy protection facilitate restructuring operation company receive million stalk horse bid sell alliance game distributor canadianbased hobby distributor universal distribution alliance entertainment ultimately bid acquire diamond asset march later back filing multiple lawsuit company joint bid universal distribution populum approve finalize may universal acquire asset alliance game distributor populum acquire diamond comic distributor diamond book distributor diamond select toy collectible collectible grade authority asset diamond not include sale major layoff diamond report soon include shutdown diamond select toy penguin random house end subdistributor agreement diamond end distribution comic marvel comic dark horse comic idw publish boom studio others end may udon entertainment ceased shipment diamond dynamite entertainment cease shipment diamond shift lunar distribution midjune july diamonds comicsuite po pullbox preordering system shut diamond exist inventory not include sale old company begin sell without pay publisher nearly company affect include fanatagraphics dynamite own million danger not meet payroll collectible grade authority one diamonds small asset rival certified guaranty company later purchase consortium investor july diamond sold september million part management buyout main company diamond comic distributor inc still remain separate independent entity involve chapter bankruptcy case diamond criticize take exception certain adultthemed title scene effectively cause cancellation series call void indigo excessive violence citation need geppi respond graphic childbirth scene miracleman write alan moore geppi write retailer diamond value retailer much take chance dangerous situation not censor want someone decide cannot however stand watch marketplace become dumping ground every sort graphic fantasy someone want live industry protect lease abide community image maintain call retailer refuse stock miracleman lead accusation censorship charge company force address criticize refused carry title include book kitchen sink press dave sim jon lewis mike diana diamond lost customer approach however eventually back geppi recall compromise accept distributor owe retailer product want fact attempt prove diamond not practice censorship company join comic raise money industry first amendment advocacy group comic book legal defense fund industry dominance diamond also face charge bully publisher discriminate small publisher charge first surface diamond reject matt feazell comic ant boy similarly decide not carry allen freeman slam bang anthology industry consolidation diamond face similar charge small publisher like fantagraphics draw quarterly lodge complaint diamonds monthly comic retail catalog preview produce diamond year store owner comic shop customer order product additionally available sale customer facilitate preorders pull hold subscription customer frequent comic shop regular basis comic publisher vie space within publication page dark horse comic image comic idw publish take precedence premier publisher marvel comic minicatalog marvel preview available separately contractual reason print preview catalog discontinue june final digital catalog october catalog preview item shop december later geppi also owner gemstone publishing inc publishes overstreet comic book price guide gemstone also publish russ cochran comic reprint disney comic blue book price guide past well geppi purchase baltimore magazine circulation monthly one nation oldest regional publication geppis publish venture comic field saw create gemstone publishing inc form large part purchase diamond buy ernst gerber publishing publisherauthor photojournal guide comic gerber product llc diamondaffiliated company start gerber sell mylar bag well acidfree box acidfree back board comic collector store collection geppi buy rus cochran publish longterm comic fan cochran auction bill gaines personal file copy publication well page original artwork almost uniquely gaines maintain ownership possession grant reprint right back catalog geppi include cochran publication cochran new imprint gemstone publishing geppi buy overstreet publish take publishing rein officialblue book price guide overstreet comic book price guide related publication bring gemstone imprint geppis publishing activity gemstone publish consist primarily reprint classic title artworks well publication include professional fanzines prozines focus heavily history comic medium many gemstone publication revolve around comic book marketplace editor ecshepherd rus cochran cochran like geppi particular fan carl bark disney comic previously publish reprint association disneyreprinter gladstone publish early geppis gemstone embark full series reprint classic title start new reprint cochrangladstonereprints haunt fear vault horror weird science gemstone also republish single issue annual four issue per annual format ecs new trend new direction title exception mad gemstone add cochran earlierpublished oversize hardback black white slipcased complete library collection complete pictofiction collection comprise comic confession illustrate crime illustrate shock illustrate terror illustrate along previously unseen story never publish gemstone begin produce durable luxurious series hardback reprint collection archive similar archive marvel masterworks volume reprint fullcolor hardback archival format sequential compilation comic title design art directordesigner michael kronenberg number volume release entirety new trend new direction plan eventual release archive volume draw praise quality feature introduction notable fan george lucas steven spielberg joe dante paul levitz december announce gemstone publishing sign license publishing disney comic north america exgladstone publishing editorinchief john clark join gemstone position disney line launch title free comic book day line start soon walt disney comic story walt disney uncle scrooge describe clark monthly page prestigeformat book price last produce title follow gemstone hold license early official overstreet comic book price guide first publish robert overstreet one early authority american comic book industry grade collection value overstreet sell company gemstone continue serve author andor publisher geppis entertainment publish auction line book publication price guide take gemstone twentyeighth edition present copublished geppis gemstone publication guide edition schedule publish gemstone publishing overstreet also produce variety small publication update yearly guide monthly schedule recent overstreets comic price review begin publication gemstone july monthly publication design update yearly price guide regularly well provide article analysis various list comic price gemstone publish hundred issue magazine comic book marketplace monthly magazine comic fan focus heavily golden silver age popular magazine wizard skew recent focus early future gemstone publish unclear report unpaid print bill particularly archive april geppi respond uncertainty note reduction staff gemstone move not signal end gemstone publishing diamond introduce comicsuite addon application microsoft dynamic retail management system rms software together comicsuite rms give specialty storeowners pointofsale po system specifically gear towards unique business model offer host exclusive feature grant direct communication diamond database make easy ever place order track inventory maintain pullandhold subscription customer geppi found diamond international gallery acquire hake americana collectible auction house pennsylvaniabased morphy auction geppi found diamond select toy found geppis entertainment museum baltimore geppi reorganize holding geppi family enterprise alliance game distributor north americas large distributor tabletop game roleplay game collectible card game miniature wargames board game relate merchandise publisher game trade magazine alliance acquire diamond august two year form merger game distributor chessex armory envisioned create collectible child adult dst found since license variety pop culture property include marvel comic transformer joe real american hero star war star trek stargate ghostbusters halo buffy vampire slayer indiana jones battlestar galactica back future also make action figure variety size well bank bust statue prop replicas many licensed property release form minimates help make minimates one prolific diverse block figure toy line world year partnership diamond select toy make move acquire select asset new yorkbased design house art asylum creator minimates dst since develop minimates base concept brand minimates max calico jack pirate raider geppi open diamond international gallery showplace comic collectible part geppis attempt see collectible attain serious respect nine year later diamond international gallery purchase one country first respect collectible auction house hakes americana collectible geppi add denver pennsylvaniabased morphy auction grow stable part collectibles market already include publish main comic price guide overstreet comic book price guide geppi describe international gallery heart many significant opportunity preserve promote present historical comic character collectible endeavor lead establish geppis entertainment museum geppis gallery showcase much private collection include comic movie poster toy original artwork individual include carl bark gustav tengren sic alex ross murphy anderson joe shuster joe simon charles schulz diamond international gallery assist project dcs archive series well host industry event geppis entertainment museum museum baltimore maryland trace history pop culture american last four hundred year collection include comic book magazine movie newspaper television radio video game memorabilia include comic book movie poster toy button badge cereal box trading card dolls figurine majority exhibit come geppis private collection geppis daughter melissa missy geppibowersox become executive vicepresident museum wendy kelman leave museum august start tourism consult firm museum curator arnold blumberg former editor geppis gemstone publishing museum close june geppi donate much collection library congress"
}