{
    "title": "en.wikipedia.org_wiki_Koisuru_One_Piece",
    "url": "https://en.wikipedia.org/wiki/Koisuru_One_Piece",
    "transformers_text": "Koisuru One Piece ( Japanese : 恋するワンピース , Hepburn : Koisuru Wan Pīsu ; lit. ' One Piece in Love ' ) is a Japanese manga series written and illustrated by Daiki Ihara [ ja ] . It began serialization on Shueisha 's Shōnen Jump+ manga service in June 2018. It is a spin-off of Eiichiro Oda 's One Piece manga series. An original net animation adaptation was released in April 2025.\n\nA group of high school students with the same names as the Straw Hat Pirates end up forming a One Piece fan club. Throughout the series, parodying moments from the One Piece manga.\n\nWritten and illustrated by Daiki Ihara, Koisuru One Piece began serialization on Shueisha 's Shōnen Jump+ manga service on June 18, 2018. [ 1 ] The series went on hiatus on November 7, 2021, due to Ihara launching Protect Me, Shugomaru! in Weekly Shōnen Jump later in the year. [ 4 ] It resumed serialization on April 10, 2025. [ 5 ] Its chapters have been compiled into eleven tankōbon volumes as of November 2025. [ 6 ]\n\nAn original net animation adaptation was announced during an AnimeJapan event on March 22, 2025. The series consisted of five anime shorts that aired on YouTube , Instagram and TikTok from April 1 to 5, 2025. [ 2 ]",
    "tf_idf_text": "koisuru one piece japanese hepburn koisuru wan psu light one piece love japanese manga series write illustrated daiki ihara begin serialization shueisha shnen jump manga service june spinoff eiichiro oda one piece manga series original net animation adaptation release april group high school student name straw hat pirate end form one piece fan club throughout series parody moment one piece manga write illustrated daiki ihara koisuru one piece begin serialization shueisha shnen jump manga service june series go hiatus november due ihara launch protect shugomaru weekly shnen jump later year resume serialization april chapter compile eleven tankbon volume november original net animation adaptation announce animejapan event march series consist five anime short air youtube instagram tiktok april"
}