{
    "title": "425 4 \"The Strongest Man in the Prison! Poison Man Magellan Appears!\"Transliteration: \"Kangoku Saikyō no Otoko! Doku Ningen Mazeran Tōjō\" (Japanese:監獄最強の男! 毒人間マゼラン登場) Sumio Watanabe Yoshiyuki Suga November 8, 2009(2009-11-08)[10]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_13",
    "transformers_text": "425 4 \"The Strongest Man in the Prison! Poison Man Magellan Appears!\"Transliteration: \"Kangoku Saikyō no Otoko! Doku Ningen Mazeran Tōjō\" (Japanese:監獄最強の男! 毒人間マゼラン登場) Sumio Watanabe Yoshiyuki Suga November 8, 2009(2009-11-08)[10]\n\nLuffy and Buggy find themselves in the Floor of Wild Beasts from Hell and fight the monsters there. Luffy defeats the powerful Basilisk with a single punch in Third Gear, destroying a guard station in the process and alerting the prison to his identity. Hancock meets with Magellan, the warden of the prison who ate the Venom Venom Fruit, and whose breath is poisonous. Buggy manages to free some prisoners, hoping to start a riot and escape in the confusion, but the prisoners return to their cells, terrified of the \"boss\" of the level. Luffy and Buggy encounter Mr. 3, who offers to help them get down to the third level. At Marine Headquarters, Sengoku is surprised that Kuma failed to finish off Luffy and that Luffy infiltrated Impel Down, but is confident that he will be captured. He then recalls the one man who escaped from Impel Down, Golden Lion Shiki.",
    "tf_idf_text": "strong man prison poison man magellan appearstransliteration kangoku saiky otoko doku ningen mazeran japanese sumio watanabe yoshiyuki suga november luffy buggy find floor wild beast hell fight monster luffy defeat powerful basilisk single punch third gear destroy guard station process alert prison identity hancock meet magellan warden prison ate venom venom fruit whose breath poisonous buggy manages free prisoner hop start riot escape confusion prisoner return cell terrify bos level luffy buggy encounter offer help get third level marine headquarters sengoku surprise kuma fail finish luffy luffy infiltrate impel confident capture recall one man escape impel golden lion shiki"
}