{
    "title": "428 7 \"A Special Presentation Related to the Movie! The Fierce Onslaught of the Amigo Pirates!\"Transliteration: \"Eiga Rendō Supesharu – Amīgo Kaizoku-dan no Mōkō\" (Japanese:映画連動特別編 アミーゴ海賊団の猛攻) Directed by: Katsumi TokoroStoryboarded by: Kenji Yokoyama Hirohiko Kamisaka November 29, 2009(2009-11-29)[13]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_13",
    "transformers_text": "428 7 \"A Special Presentation Related to the Movie! The Fierce Onslaught of the Amigo Pirates!\"Transliteration: \"Eiga Rendō Supesharu – Amīgo Kaizoku-dan no Mōkō\" (Japanese:映画連動特別編 アミーゴ海賊団の猛攻) Directed by: Katsumi TokoroStoryboarded by: Kenji Yokoyama Hirohiko Kamisaka November 29, 2009(2009-11-29)[13]\n\nThe rest of the Straw Hats hear the fighting on the island and decide to head over. Zoro and Sanji attempt to attack Largo, who uses his Net Net Fruit powers to create nets out of materials that he eats and captures the two of them. Largo and Colt threaten to exterminate the town if they do not get the beetle, and Boss comes out to fight them, but is quickly defeated. Boss decides to sacrifice himself to save the village, despite Yoko's objections, but Luffy tears open the net and punches Boss, saying that he wants to fight with him again. Boss sheds his skin and is able to fly long enough to burn Luffy, Zoro and Sanji's nets. The Straw Hats and the villagers prepare to fight the Amigo Pirates.",
    "tf_idf_text": "special presentation relate movie fierce onslaught amigo piratestransliteration eiga rend supesharu amgo kaizokudan japanese direct katsumi tokorostoryboarded kenji yokoyama hirohiko kamisaka november rest straw hat hear fight island decide head zoro sanji attempt attack largo use net net fruit power create net material eats capture two largo colt threaten exterminate town not get beetle bos come fight quickly defeat bos decides sacrifice save village despite yokos objection luffy tear open net punch bos say want fight bos shed skin able fly long enough burn luffy zoro sanjis net straw hat villager prepare fight amigo pirate"
}