{
    "title": "429 8 \"A Special Presentation Related to the Movie! The Battle is on! - Luffy vs. Largo\"Transliteration: \"Eiga Rendō Supesharu – Kessen! Rufi VS Rarugo\" (Japanese:映画連動特別編 決戦! ルフィVSラルゴ) Naoyuki Itō Hirohiko Kamisaka December 6, 2009(2009-12-06)[14]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_13",
    "transformers_text": "429 8 \"A Special Presentation Related to the Movie! The Battle is on! - Luffy vs. Largo\"Transliteration: \"Eiga Rendō Supesharu – Kessen! Rufi VS Rarugo\" (Japanese:映画連動特別編 決戦! ルフィVSラルゴ) Naoyuki Itō Hirohiko Kamisaka December 6, 2009(2009-12-06)[14]\n\nAfter escaping from the net, Luffy knocks Largo far away and goes off to fight him. Nami pretends to evacuate the villagers, but takes them through other tunnels to surprise the Amigo pirates while they are fighting Zoro and Sanji. Luffy fights Largo, but becomes trapped when he turns his entire body into a net. Luffy uses Third Gear  to inflate and burst the net before defeating Largo with Gigant Pistol, destroying his ship in the process. Boss saves Luffy from falling into the sea and then starts fighting him in a rematch that lasts for hours. Yoko and Nami discuss their respective pasts, before Nami brings the Straw Hats together and sets sail from the island. It is revealed that Boss was a specially created insect that had escaped from Shiki, and that he plans on using an army of similar creatures to wage war on the world.",
    "tf_idf_text": "special presentation relate movie battle luffy largotransliteration eiga rend supesharu kessen rufi rarugo japanese naoyuki hirohiko kamisaka december escape net luffy knock largo far away go fight nami pretend evacuate villager take tunnel surprise amigo pirate fight zoro sanji luffy fight largo becomes trap turn entire body net luffy use third gear inflate burst net defeat largo gigant pistol destroy ship process bos save luffy fall sea start fight rematch last hour yoko nami discus respective past nami brings straw hat together set sail island reveal bos specially create insect escape shiki plan use army similar creature wage war world"
}