{
    "title": "431 10 \"Chief Jailer Saldeath's Trap! Level 3 – Starvation Hell!\"Transliteration: \"Rōbanchō Sarudesu no Wana – Reberu Surī Kiga Jigoku\" (Japanese:牢番長サルデスの罠　LV.3飢餓地獄) Directed by: Sumio WatanabeStoryboarded by: Takahiro Imamura Hitoshi Tanaka December 20, 2009(2009-12-20)[16]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_13",
    "transformers_text": "431 10 \"Chief Jailer Saldeath's Trap! Level 3 – Starvation Hell!\"Transliteration: \"Rōbanchō Sarudesu no Wana – Reberu Surī Kiga Jigoku\" (Japanese:牢番長サルデスの罠　LV.3飢餓地獄) Directed by: Sumio WatanabeStoryboarded by: Takahiro Imamura Hitoshi Tanaka December 20, 2009(2009-12-20)[16]\n\nWith the Sphinx having fallen to the next level, a riot breaks out on Level 2 as the prisoners leave their cells. Sengoku is outraged at Luffy's break-in, noting that no one has escaped Impel Down since Gold Lion Shiki did 20 years ago. Luffy, Buggy and Mr. 3 wander around the third level, a hot desert in which prisoners do not receive food or water, until they are caught in a seastone net triggered by Saldeath, commander of the guards. The sphinx struggles and breaks the net, and while Buggy and Mr. 3 plan on abandoning Luffy while he fights the guards, they are unable to leave the level. Meanwhile, Hancock gets closer to where Ace is being held, and Mr. 2 is shown to be imprisoned in Level 3.",
    "tf_idf_text": "chief jailer saldeaths trap level starvation helltransliteration rbanch sarudesu wana reberu sur kiga jigoku japanese direct sumio watanabestoryboarded takahiro imamura hitoshi tanaka december sphinx fall next level riot break level prisoner leave cell sengoku outrage luffys breakin note one escape impel since gold lion shiki year ago luffy buggy wander around third level hot desert prisoner not receive food water catch seastone net trigger saldeath commander guard sphinx struggle break net buggy plan abandon luffy fight guard unable leave level meanwhile hancock get close ace hold show imprisoned level"
}