{
    "title": "440 19 \"Believe in Miracles! Bon Clay's Cries From the Heart!\"Transliteration: \"Kiseki o Shinjite! Bon Kurē Tamashii no Seien\" (Japanese:奇跡を信じて! ボン・クレー魂の声援) Yutaka Nakashima Yoshiyuki Suga February 28, 2010(2010-02-28)[25]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_13",
    "transformers_text": "440 19 \"Believe in Miracles! Bon Clay's Cries From the Heart!\"Transliteration: \"Kiseki o Shinjite! Bon Kurē Tamashii no Seien\" (Japanese:奇跡を信じて! ボン・クレー魂の声援) Yutaka Nakashima Yoshiyuki Suga February 28, 2010(2010-02-28)[25]\n\nIvankov tells Bon Clay that he has eaten the Horm-Horm Fruit, which enables him to manipulate people's hormones for various purposes, and that New Kama Land lies between Level 5 and Level 6. He says that Level 6 truly exists and is a place where prisoners who are incredibly dangerous or harmful to the World Government's reputation, such as former head warden Shiryu, are kept. Despite the long time for treatment, and low risk of survival, Bon Clay keeps on cheering for Luffy until his voice gives out, with the other New Kamas joining in. Meanwhile, Ace worries about Luffy always taking risks for his sake while the guards discover Luffy's disappearance and prepare to transport Ace to his execution. Eventually, Luffy's screams stop and he, having completed his treatment after less than a day, eats a large amount of food and declares that he has recovered.",
    "tf_idf_text": "believe miracle bon clays cry hearttransliteration kiseki shinjite bon kur tamashii seien japanese yutaka nakashima yoshiyuki suga february ivankov tell bon clay eaten hormhorm fruit enable manipulate people hormones various purpose new kama land lie level level say level truly exist place prisoner incredibly dangerous harmful world government reputation former head warden shiryu keep despite long time treatment low risk survival bon clay keep cheer luffy voice give new kama join meanwhile ace worry luffy always take risk sake guard discover luffys disappearance prepare transport ace execution eventually luffys scream stop complete treatment less day eat large amount food declares recover"
}