{
    "title": "453 32 \"The Friends' Whereabouts! The Weatheria Report and the Cyborg Animals!\"Transliteration: \"Nakama-tachi no Yukue – Wezaria Ripōto to Saibōgu Animaru\" (Japanese:仲間達の行方 空島リポートと改造動物) Directed by: Aya KomakiStoryboarded by: Tetsuya Endō Hitoshi Tanaka May 30, 2010(2010-05-30)[38]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_13",
    "transformers_text": "453 32 \"The Friends' Whereabouts! The Weatheria Report and the Cyborg Animals!\"Transliteration: \"Nakama-tachi no Yukue – Wezaria Ripōto to Saibōgu Animaru\" (Japanese:仲間達の行方 空島リポートと改造動物) Directed by: Aya KomakiStoryboarded by: Tetsuya Endō Hitoshi Tanaka May 30, 2010(2010-05-30)[38]\n\nAs Luffy's ship heads to Marine Headquarters, the scene shifts to a point some time in the past. Nami is still on Weather Island, which slowly heads toward the Sabaody archipelago at a pace determined by the winds. She sees the old man demonstrate his ability to summon large rains and store thunderstorms in soap bubbles. Meanwhile, Franky is still acting like a gentleman under the effects of the tea, and the boy with him wonders when cola will arrive to return him to normal. Franky is attacked by several cyborgs in the forest, causing the tea in him to bubble over and restoring his usual personality, which enables him to defeat the cyborgs with ease. Franky learns that Dr. Vegapunk, who modified Kuma, made the cyborgs, and reaches a house with Vegapunk's name on it, triggering an alarm as he goes in.",
    "tf_idf_text": "friend whereabouts weatheria report cyborg animalstransliteration nakamatachi yukue wezaria ripto saibgu animaru japanese direct aya komakistoryboarded tetsuya end hitoshi tanaka may luffys ship head marine headquarters scene shift point time past nami still weather island slowly head toward sabaody archipelago pace determine wind see old man demonstrate ability summon large rain store thunderstorm soap bubble meanwhile franky still act like gentleman effect tea boy wonder cola arrive return normal franky attack several cyborg forest cause tea bubble restore usual personality enable defeat cyborgs ease franky learn vegapunk modify kuma make cyborgs reach house vegapunks name trigger alarm go"
}