{
    "title": "456 35 \"The Friends' Whereabouts! A Huge Tomb and the Panty Debt!\"Transliteration: \"Nakama-tachi no Yukue – Kyodai no Hakajirushi to Pantsu no On\" (Japanese:仲間達の行方 巨大の墓標とパンツの恩) Katsumi Tokoro Hirohiko Kamisaka June 20, 2010(2010-06-20)[41]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_13",
    "transformers_text": "456 35 \"The Friends' Whereabouts! A Huge Tomb and the Panty Debt!\"Transliteration: \"Nakama-tachi no Yukue – Kyodai no Hakajirushi to Pantsu no On\" (Japanese:仲間達の行方 巨大の墓標とパンツの恩) Katsumi Tokoro Hirohiko Kamisaka June 20, 2010(2010-06-20)[41]\n\nZoro tries to recover his swords, but fails to understand Perona's simple directions, thwarting her plan to get his hopes up and use Negative Hollow on him. He tries to leave the island, but gets lost, and Perona finds him after he accidentally makes his way back to the castle and leads him toward the sea, hoping to manipulate him so that she can find Thriller Bark again. Perona then notices something interesting, and after Zoro gets lost and finds his way to her, notices a large tomb, and shadowy beast-like figures with weapons attack Zoro. Meanwhile, Brook learns that the residents are giving what little food they have as tribute to him in order to gain protection from the Longarm Tribe. When the Longarm Tribe kidnaps a female worshiper, the cult asks him for help, and he agrees to help her before rejoining the rest of the crew. The story returns to the present as Luffy's ship is behind schedule en route to Marineford as Ace's execution nears.",
    "tf_idf_text": "friend whereabouts huge tomb panty debttransliteration nakamatachi yukue kyodai hakajirushi pantsu japanese katsumi tokoro hirohiko kamisaka june zoro try recover sword fails understand peronas simple direction thwart plan get hope use negative hollow try leave island get lose perona find accidentally make way back castle lead toward sea hop manipulate find thriller bark perona notice something interesting zoro get lose find way notice large tomb shadowy beastlike figure weapon attack zoro meanwhile brook learn resident give little food tribute order gain protection longarm tribe longarm tribe kidnaps female worshiper cult asks help agree help rejoin rest crew story return present luffys ship behind schedule route marineford ace execution nears"
}