{
    "title": "en.wikipedia.org_wiki_Baramicin",
    "url": "https://en.wikipedia.org/wiki/Baramicin",
    "transformers_text": "Baramicin ( Bara ) is an antimicrobial peptide gene of the fruit fly Drosophila melanogaster . Baramicin is a prominent element of the fly immune response: of the most abundant immune peptides detected in the fly hemolymph , the BaraA gene is responsible for 9 of the 24 peptides first described for their high concentrations after systemic infection. [ 1 ] [ 2 ] [ 3 ]\n\nThe name of the Baramicin gene was inspired by One Piece character \" Buggy \" and derives from the Japanese expression \"Bara Bara\", an onomatopoeia for things breaking apart, in reference to the Baramicin precursor breaking into multiple sub-peptides. [ 3 ]\n\nThe Baramicin A precursor protein can be broken into three distinct domains: the IM10-like , IM22 , and IM24 domains. Five sub-peptides are produced by the BaraA precursor including one IM24 peptide, three IM10-like peptides, and one IM22 peptide. [ 3 ]\n\nThe Baramicin gene is part of the Toll pathway antifungal immune response. [ 1 ] [ 2 ] Flies lacking BaraA genetically are susceptible to infection by entomopathogenic fungi such as Beauveria bassiana and Metarhizium species , but also show some susceptibility to Enterococcus faecalis bacterial infection. [ 3 ] [ 4 ] The IM10-like peptides of BaraA are specifically proposed as antifungal peptides produced by the BaraA gene. [ 3 ] The potential activity of the IM22 and IM24 peptides is unknown. Some element of the Baramicin protein may also regulate a behavioural response after infection, as flies lacking Baramicin display an erect wing phenotype after immune activation. [ 3 ]\n\nAntimicrobial peptides and neuropeptides share many common features. [ 5 ] The distinction between which of these two roles, if either, is the primary function of any given peptide is often unclear. [ 6 ] [ 7 ] The Baramicin gene family of D. melanogaster includes the immune-induced BaraA and also two non-immune Baramicin genes BaraB and BaraC . The BaraB and BaraC genes are expressed in the nervous system, in neurons or glia respectively. Evolutionary study suggests the IM24 domain is the key element of the Baramicin precursor that is involved in Baramicin function in the nervous system. This finding suggests antimicrobial peptides and neuropeptides might accomplish immune or neural roles not only by dual action of a single peptide, but rather by different mechanisms of action of sub-peptides. [ 8 ]\n\nBaraA mutants also display a reduced recovery rate after the injection of neurotoxins, which is rescued somewhat by expressing BaraA in glial cells of the fly's nervous system. [ 4 ] Together with the description of antifungal activity of IM10-like peptides, [ 3 ] the BaraA gene therefore encodes both immune antimicrobials and some factor that promotes host resilience in the face of microbial toxins. [ 4 ]",
    "tf_idf_text": "baramicin bara antimicrobial peptide gene fruit fly drosophila melanogaster baramicin prominent element fly immune response abundant immune peptide detect fly hemolymph baraa gene responsible peptide first describe high concentration systemic infection name baramicin gene inspire one piece character buggy derive japanese expression bara bara onomatopoeia thing break apart reference baramicin precursor break multiple subpeptides baramicin precursor protein break three distinct domain imlike domain five subpeptides produce baraa precursor include one peptide three imlike peptides one peptide baramicin gene part toll pathway antifungal immune response fly lack baraa genetically susceptible infection entomopathogenic fungi beauveria bassiana metarhizium specie also show susceptibility enterococcus faecalis bacterial infection imlike peptide baraa specifically propose antifungal peptide produce baraa gene potential activity peptide unknown element baramicin protein may also regulate behavioural response infection fly lack baramicin display erect wing phenotype immune activation antimicrobial peptide neuropeptides share many common feature distinction two role either primary function give peptide often unclear baramicin gene family melanogaster include immuneinduced baraa also two nonimmune baramicin gene barab barac barab barac gene express nervous system neuron glia respectively evolutionary study suggest domain key element baramicin precursor involve baramicin function nervous system find suggest antimicrobial peptide neuropeptides might accomplish immune neural role not dual action single peptide rather different mechanism action subpeptides baraa mutant also display reduced recovery rate injection neurotoxins rescue somewhat express baraa glial cell fly nervous system together description antifungal activity imlike peptide baraa gene therefore encode immune antimicrobial factor promote host resilience face microbial toxin"
}