{
    "title": "1123 35 \"The World Shakes! The Straw Hats' Hostage Situation\"Transliteration: \"Sekai Shinkan! Mugiwara no Ichimi Tatekomori Jiken\" (Japanese:世界震撼！麦わらの一味立てこもり事件) Satoshi Itō Shōji Yonemura Kenji Yokoyama April 5, 2025(2025-04-05) 3.9%[39]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_21",
    "transformers_text": "1123 35 \"The World Shakes! The Straw Hats' Hostage Situation\"Transliteration: \"Sekai Shinkan! Mugiwara no Ichimi Tatekomori Jiken\" (Japanese:世界震撼！麦わらの一味立てこもり事件) Satoshi Itō Shōji Yonemura Kenji Yokoyama April 5, 2025(2025-04-05) 3.9%[39]\n\nThe residents of Dawn Island discuss Luffy and Garp's recent actions, noting Garp’s disappearance and presumed survival. Meanwhile, a global earthquake shakes various locations, with its epicenter traced back to the destruction of the Lulusia Kingdom, causing sea levels to rise and flooding several islands. A Marine fleet led by Admiral Kizaru heads towards Egghead to confront Dr. Vegapunk and the Straw Hats. Kizaru and Sentomaru discuss the failed CP0 mission, while the World Government plans to sink any ships attempting to escape Egghead. York negotiates with the Five Elders, who ask her to recreate the Mother Flame in exchange for protection and the status of a World Noble. Amid rising tensions, York is revealed to be held hostage by the Straw Hats.",
    "tf_idf_text": "world shake straw hat hostage situationtransliteration sekai shinkan mugiwara ichimi tatekomori jiken japanese satoshi shji yonemura kenji yokoyama april resident dawn island discus luffy garps recent action note garps disappearance presume survival meanwhile global earthquake shake various location epicenter trace back destruction lulusia kingdom cause sea level rise flood several island marine fleet lead admiral kizaru head towards egghead confront vegapunk straw hat kizaru sentomaru discus fail mission world government plan sink ship attempt escape egghead york negotiates five elder ask recreate mother flame exchange protection status world noble amid rise tension york reveal held hostage straw hat"
}