{
    "title": "1124 36 \"Completely Surrounded! The Operation to Escape Egghead\"Transliteration: \"Zenmen Hōi! Egguheddo Dasshutsu Sakusen\" (Japanese:全面包囲！エッグヘッド脱出作戦) Aimi Yamauchi Jin Tanaka Eisaku Inoue April 6, 2025(2025-04-06) 3.7%[39]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_21",
    "transformers_text": "1124 36 \"Completely Surrounded! The Operation to Escape Egghead\"Transliteration: \"Zenmen Hōi! Egguheddo Dasshutsu Sakusen\" (Japanese:全面包囲！エッグヘッド脱出作戦) Aimi Yamauchi Jin Tanaka Eisaku Inoue April 6, 2025(2025-04-06) 3.7%[39]\n\nLuffy communicates with the Five Elders, confirming his alliance with Dr. Vegapunk and demanding the fleet’s withdrawal for York's safety. Meanwhile, Saturn prioritizes York, Punk Records, and the power plant, deeming everything else expendable. York threatens to destroy Egghead if harmed. Usopp contacts the freed Cipher Pol agents, who seek refuge from the Seraphim. S-Snake reverses the petrification of the Straw Hats due to her affection for Luffy. The crew plans to escape using Vegaforce-01 and the Thousand Sunny's Coup de Burst to bypass the Marines and head to Elbaph, but they are trapped by the Frontier Dome, controlled by York's password. As Luffy’s group reaches the Thousand Sunny, Kizaru arrives on Egghead and is intercepted by Sentomaru, while Luffy senses Kizaru's presence.",
    "tf_idf_text": "completely surrounded operation escape eggheadtransliteration zenmen egguheddo dasshutsu sakusen japanese aimi yamauchi jin tanaka eisaku inoue april luffy communicate five elder confirm alliance vegapunk demand fleet withdrawal york safety meanwhile saturn prioritizes york punk record power plant deem everything else expendable york threatens destroy egghead harm usopp contact free cipher pol agent seek refuge seraph ssnake reverse petrification straw hat due affection luffy crew plan escape use vegaforce thousand sunnys coup burst bypass marine head elbaph trap frontier dome control york password luffys group reach thousand sunny kizaru arrive egghead intercept sentomaru luffy sense kizarus presence"
}