{
    "title": "1125 37 \"A Clash of Two Men's Determination! Kizaru and Sentomaru\"Transliteration: \"Butsukaru Otoko no Kakugo! Kizaru to Sentomaru\" (Japanese:ぶつかる男の覚悟！黄猿と戦桃丸) Yasushi Tomoda Tomohiro Nakayama Masayuki Takagi &Katsumi Ishizuka April 13, 2025(2025-04-13) 3.1%[40]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_21",
    "transformers_text": "1125 37 \"A Clash of Two Men's Determination! Kizaru and Sentomaru\"Transliteration: \"Butsukaru Otoko no Kakugo! Kizaru to Sentomaru\" (Japanese:ぶつかる男の覚悟！黄猿と戦桃丸) Yasushi Tomoda Tomohiro Nakayama Masayuki Takagi &Katsumi Ishizuka April 13, 2025(2025-04-13) 3.1%[40]\n\nThe battle escalates as the Marines attack the Pacifistas, but the Sea Beast weapons retaliate, prompting Vice Admiral intervention. Dr. Vegapunk is puzzled by the assault, especially with Sentomaru present, and suspects that Kizaru was sent to eliminate him. Sentomaru and Kizaru clash, with Sentomaru bravely opposing the Admiral despite being outmatched, honoring his vow to protect Vegapunk. A flashback reveals their first meeting and how Sentomaru became Dr. Vegapunk's bodyguard. Kizaru defeats Sentomaru and takes control of the Pacifistas. Meanwhile, Vegapunk and his allies try to disable the Frontier Dome as Kizaru enters the Labophase. Lucci attempts to assassinate Vegapunk, but Stussy protects him. Zoro engages Lucci in combat, while Luffy confronts Kizaru, declaring that the Straw Hats are now far stronger than before.",
    "tf_idf_text": "clash two men determination kizaru sentomarutransliteration butsukaru otoko kakugo kizaru sentomaru japanese yasushi tomoda tomohiro nakayama masayuki takagi katsumi ishizuka april battle escalate marine attack pacifistas sea beast weapon retaliate prompt vice admiral intervention vegapunk puzzle assault especially sentomaru present suspect kizaru sent eliminate sentomaru kizaru clash sentomaru bravely oppose admiral despite outmatched honor vow protect vegapunk flashback reveals first meet sentomaru become vegapunks bodyguard kizaru defeat sentomaru take control pacifistas meanwhile vegapunk ally try disable frontier dome kizaru enters labophase lucci attempt assassinate vegapunk stussy protect zoro engage lucci combat luffy confronts kizaru declare straw hat far strong"
}