{
    "title": "1127 39 \"Luffy vs. Kizaru! A Fierce Kaleidoscopic Battle\"Transliteration: \"Rufi bāsasu Kizaru! Hengen Jizai no Dai Gekisen\" (Japanese:ルフィVS黄猿！変幻自在の大激戦) Wataru Matsumi Akiko Inoue Yong-Ce Tu & Ziwei He April 27, 2025(2025-04-27) 2.9%[42]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_21",
    "transformers_text": "1127 39 \"Luffy vs. Kizaru! A Fierce Kaleidoscopic Battle\"Transliteration: \"Rufi bāsasu Kizaru! Hengen Jizai no Dai Gekisen\" (Japanese:ルフィVS黄猿！変幻自在の大激戦) Wataru Matsumi Akiko Inoue Yong-Ce Tu & Ziwei He April 27, 2025(2025-04-27) 2.9%[42]\n\nLuffy hurls Kizaru from the Control Tower, giving the crew a chance to escape. Atlas heads to the Fabiriophase to regain control of the Pacifista Mark III, while Vegapunk informs Franky that Bonney is alive and also there. Bonney uses her Age-Age Fruit powers to fight off and evade the Marines. Meanwhile, Zoro duels Lucci, and Luffy battles Kizaru, who creates light clones to distract him. Luffy counters with his Human-Human Fruit, Model: Nika powers, but Kizaru tricks him and returns to the Control Tower, capturing Usopp. Vegapunk, Atlas, and Sanji leave in the Vegatank-08 to rescue Bonney, with Kizaru in pursuit. Franky joins them, and the Marines are alerted that Vegapunk has left the Labophase. Atlas then commands the Pacifistas to attack the Marines.",
    "tf_idf_text": "luffy kizaru fierce kaleidoscopic battletransliteration rufi bsasu kizaru hengen jizai dai gekisen japanesevs wataru matsumi akiko inoue yongce ziwei april luffy hurl kizaru control tower give crew chance escape atlas head fabiriophase regain control pacifista mark vegapunk informs franky bonney alive also bonney us ageage fruit power fight evade marine meanwhile zoro duel lucci luffy battle kizaru creates light clone distract luffy counter humanhuman fruit model nika power kizaru trick return control tower capture usopp vegapunk atlas sanji leave vegatank rescue bonney kizaru pursuit franky join marine alert vegapunk leave labophase atlas command pacifistas attack marine"
}