{
    "title": "1128 40 \"The Nightmare Strikes - Godhead of Science & Defense, St. Saturn\"Transliteration: \"Akumu Shūrai - Kagaku Bōei Bushin Satān-sei\" (Japanese:悪夢襲来 科学防衛武神サターン聖) Nozomu Shishido Shinzō Fujita Shin Kashiwaguma May 4, 2025(2025-05-04) 3.2%[43]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_21",
    "transformers_text": "1128 40 \"The Nightmare Strikes - Godhead of Science & Defense, St. Saturn\"Transliteration: \"Akumu Shūrai - Kagaku Bōei Bushin Satān-sei\" (Japanese:悪夢襲来 科学防衛武神サターン聖) Nozomu Shishido Shinzō Fujita Shin Kashiwaguma May 4, 2025(2025-05-04) 3.2%[43]\n\nThe Pacifistas attack the Marines as Dr. Vegapunk's group moves toward the Fabiriophase. Sanji finds Bonney, who's under assault by Vice Admiral Pomsky. Bonney uses herNDEtechnique to knock out the Marines but is cornered by Vice Admiral Bluegrass. Sanji rescues Bonney, and they return to the Vegatank-08. Meanwhile, Luffy’s battle with Kizaru intensifies. St. Saturn arrives on Egghead, halting the Pacifistas and warning the Marines. He transforms into a demonic spider hybrid and kills a Marine who looks at him. As Sanji’s group tries to retreat, Kizaru destroys their escape route, causing them to fall. Luffy hits Kizaru with aGum-Gum Star Gunbefore returning to normal due to Fifth Gear's exhaustion. The Vegatank-08 crashes, but the crew survives. Saturn confronts Vegapunk, and Bonney, overcome with rage and grief, stabs Saturn.",
    "tf_idf_text": "nightmare strike godhead science defense saturntransliteration akumu shrai kagaku bei bushin satnsei japanese nozomu shishido shinz fujita shin kashiwaguma may pacifistas attack marine vegapunks group move toward fabiriophase sanji find bonney who assault vice admiral pomsky bonney use herndetechnique knock marine corner vice admiral bluegrass sanji rescue bonney return vegatank meanwhile luffys battle kizaru intensifies saturn arrives egghead halt pacifistas warn marine transforms demonic spider hybrid kill marine look sanjis group try retreat kizaru destroys escape route cause fall luffy hit kizaru agumgum star gunbefore return normal due fifth gear exhaustion vegatank crash crew survives saturn confronts vegapunk bonney overcome rage grief stab saturn"
}