{
    "title": "1129 41 \"Kuma's Past - Better Off Dead in This World\"Transliteration: \"Kuma no Kako - Shinda Hō ga ī Sekai\" (Japanese:くまの過去 死んだ方がいい世界) Tasuku Shimaya Shōji Yonemura Keita Saitō, Kimitaka Itō, Rina Fujii, Ririka Fukatani, Katsumi Ishizuka & Neru Takuyama May 18, 2025(2025-05-18) 2.9%[44]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_21",
    "transformers_text": "1129 41 \"Kuma's Past - Better Off Dead in This World\"Transliteration: \"Kuma no Kako - Shinda Hō ga ī Sekai\" (Japanese:くまの過去 死んだ方がいい世界) Tasuku Shimaya Shōji Yonemura Keita Saitō, Kimitaka Itō, Rina Fujii, Ririka Fukatani, Katsumi Ishizuka & Neru Takuyama May 18, 2025(2025-05-18) 2.9%[44]\n\nAfter Bonney attacks St. Saturn, the World Noble quickly heals and restrains her. He criticizes Kizaru for failing. Saturn then tries to eliminate Luffy, but Franky intervenes. Despite Vegapunk’s betrayal, Saturn thanks him for his scientific contributions. Bonney confronts Saturn about Kuma’s fate. Saturn reveals Kuma was born a slave and a member of the nearly extinct Buccaneer race, who committed a crime. Bonney recalls Kuma saying he wanted to be a hero like the Warrior of Liberation, the Sun God Nika. 47 years earlier in the Sorbet Kingdom, Kuma was born to a Buccaneer father, Clapp, and a human mother. After their heritage was exposed, they were enslaved by the World Nobles. Kuma endured brutal conditions; his mother died, and Clapp was killed while encouraging Kuma to believe in Nika. Years later, the World Nobles hosted a genocidal tournament on God Valley. When Kuma attempted to escape, a young Ivankov and Ginny arrived and urged him to survive.",
    "tf_idf_text": "kumas past good dead worldtransliteration kuma kako shinda sekai japanese tasuku shimaya shji yonemura keita sait kimitaka rina fujii ririka fukatani katsumi ishizuka neru takuyama may bonney attack saturn world noble quickly heals restrain criticizes kizaru fail saturn try eliminate luffy franky intervenes despite vegapunks betrayal saturn thanks scientific contribution bonney confronts saturn kumas fate saturn reveals kuma bear slave member nearly extinct buccaneer race commit crime bonney recall kuma say want hero like warrior liberation sun god nika year earlier sorbet kingdom kuma bear buccaneer father clapp human mother heritage expose enslaved world noble kuma endured brutal condition mother die clapp kill encouraging kuma believe nika year later world noble host genocidal tournament god valley kuma attempt escape young ivankov ginny arrive urged survive"
}