{
    "title": "1131 43 \"A Fleeting Moment of Happiness - Kumachi and Ginny\"Transliteration: \"Hitotoki no Shiawase - Kumachī to Jinī\" (Japanese:ひとときの幸せ くまちーとジニー) Katsumi Tokoro Tomohiro Nakayama Masahiro Kitazaki June 1, 2025(2025-06-01) 2.9%[46]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_21",
    "transformers_text": "1131 43 \"A Fleeting Moment of Happiness - Kumachi and Ginny\"Transliteration: \"Hitotoki no Shiawase - Kumachī to Jinī\" (Japanese:ひとときの幸せ くまちーとジニー) Katsumi Tokoro Tomohiro Nakayama Masahiro Kitazaki June 1, 2025(2025-06-01) 2.9%[46]\n\nEight years after the God Valley Incident, Kuma lives peacefully in the Sorbet Kingdom, using his Devil Fruit powers to help others. Ginny strictly manages his efforts so that his kindness won't be exploited. The kingdom suffers under the tyrant King Bekori, who prioritizes the Heavenly Tribute over the people's welfare, enslaving the financially struggling residents. Kuma secretly absorbs others' pain, harming himself. Despite Ginny's love and proposal, he refuses her, fearing for her safety due to his Buccaneer heritage. Inspired by Dragon and the Freedom Fighters, Kuma dreams of helping others on a larger scale. After opposing Bekori's regime, Kuma and Ginny are imprisoned. The Freedom Fighters overthrow the king and liberate the kingdom. Kuma joins Dragon and Ivankov and form the Revolutionary Army. Years later, Ginny, now a captain, is captured by an unknown enemy.",
    "tf_idf_text": "fleet moment happiness kumachi ginnytransliteration hitotoki shiawase kumach jin japanese katsumi tokoro tomohiro nakayama masahiro kitazaki june eight year god valley incident kuma live peacefully sorbet kingdom use devil fruit power help others ginny strictly manage effort kindness wont exploit kingdom suffers tyrant king bekori prioritize heavenly tribute people welfare enslave financially struggle resident kuma secretly absorbs others pain harm despite ginnys love proposal refuse fear safety due buccaneer heritage inspire dragon freedom fighter kuma dream help others large scale oppose bekoris regime kuma ginny imprison freedom fighter overthrow king liberate kingdom kuma join dragon ivankov form revolutionary army year later ginny captain capture unknown enemy"
}