{
    "title": "1133 45 \"To Save His Daughter - Kuma the Timid Pacifist\"Transliteration: \"Bonī o Sukue - Kiyowana \"Pashifisuta\" Kuma\" (Japanese:娘を救え 気弱な〝平和主義者〟くま) Toshinori Fukuzawa Atsuhiro Tomioka Eisaku Inoue June 15, 2025(2025-06-15) 2.7%[47]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_21",
    "transformers_text": "1133 45 \"To Save His Daughter - Kuma the Timid Pacifist\"Transliteration: \"Bonī o Sukue - Kiyowana \"Pashifisuta\" Kuma\" (Japanese:娘を救え 気弱な〝平和主義者〟くま) Toshinori Fukuzawa Atsuhiro Tomioka Eisaku Inoue June 15, 2025(2025-06-15) 2.7%[47]\n\nWhen Bekori causes chaos in the Sorbet Kingdom, Kuma violently confronts the tyrant king, leading to the event being dubbed theSolo Revolution. Though Kuma is crowned king, Bulldog, a former king, assumes leadership. Kuma discovers that Bonney has consumed the Age-Age Fruit, allowing her to alter her appearance. Bekori spreads false propaganda to regain power with the World Government's support. Kuma defeats Bekori again and earns a bounty, forcing him to leave Sorbet. Kuma travels the world searching for a cure for Bonney, crossing paths with the Revolutionary Army and reconnecting with Dragon. Kuma meets Dr. Vegapunk, who offers an experimental stem cell treatment for Bonney in exchange for using Kuma as a model for powerful clone soldiers. Kuma agrees, prioritizing Bonney's life, with the soldiers being named thePacifista.",
    "tf_idf_text": "save daughter kuma timid pacifisttransliteration bon sukue kiyowana pashifisuta kuma japanese toshinori fukuzawa atsuhiro tomioka eisaku inoue june bekori cause chaos sorbet kingdom kuma violently confronts tyrant king leading event dub thesolo revolution though kuma crown king bulldog former king assume leadership kuma discovers bonney consume ageage fruit allow alter appearance bekori spread false propaganda regain power world government support kuma defeat bekori earn bounty force leave sorbet kuma travel world search cure bonney cross path revolutionary army reconnecting dragon kuma meet vegapunk offer experimental stem cell treatment bonney exchange use kuma model powerful clone soldier kuma agree prioritize bonney life soldier name thepacifista"
}