{
    "title": "1134 46 \"Cruel Fate - Kuma's Decision as a Father\"Transliteration: \"Hijō-naru Unmei - Chichi Kuma no Ketsudan\" (Japanese:非情なる運命 父くまの決断) Hazuki Omoya Akiko Inoue Masayuki Takagi& Toshio Deguchi June 29, 2025(2025-06-29) 2.8%[48]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_21",
    "transformers_text": "1134 46 \"Cruel Fate - Kuma's Decision as a Father\"Transliteration: \"Hijō-naru Unmei - Chichi Kuma no Ketsudan\" (Japanese:非情なる運命 父くまの決断) Hazuki Omoya Akiko Inoue Masayuki Takagi& Toshio Deguchi June 29, 2025(2025-06-29) 2.8%[48]\n\nAt Dr. Vegapunk's lab, Saturn contacts Vegapunk and rejects Kuma as the face of the clone army. He imposes harsh conditions: Kuma must become a Warlord, a cyborg weapon, and surrender his free will. Vegapunk objects, but Kuma agrees, sacrificing himself to ensure Bonney receives life-saving treatment. Saturn demands Bonney be placed under government surveillance, cutting her off from Kuma. Kuma requests she be treated in the Sorbet Kingdom and kept unaware of the truth. Over six months, her treatment succeeds, and she's expected to be fully cured in a year. She and Kuma return to the Sorbet Kingdom, but he leaves after Alpha, a CP8 agent, is assigned to monitor her. News of Kuma's obedience as a Warlord confuses the Revolutionary Army. Kuma begins writing letters to Bonney as he heads to Foosha Village, awaiting his next orders.",
    "tf_idf_text": "cruel fate kumas decision fathertransliteration hijnaru unmei chichi kuma ketsudan japanese hazuki omoya akiko inoue masayuki takagi toshio deguchi june vegapunks lab saturn contact vegapunk reject kuma face clone army impose harsh condition kuma must become warlord cyborg weapon surrender free vegapunk object kuma agree sacrifice ensure bonney receives lifesaving treatment saturn demand bonney placed government surveillance cut kuma kuma request treat sorbet kingdom keep unaware truth six month treatment succeed shes expect fully cure year kuma return sorbet kingdom leave alpha agent assign monitor news kumas obedience warlord confuse revolutionary army kuma begin write letter bonney head foosha village await next order"
}