{
    "title": "1136 48 \"Kuma's Life\"Transliteration: \"Kuma no Jinsei\" (Japanese:くまの人生) Yasunori Koyama Shōji Yonemura Hiroto Saitō, Kimitaka Itō& Masayuki Satō July 13, 2025(2025-07-13) 2.7%[50]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_21",
    "transformers_text": "1136 48 \"Kuma's Life\"Transliteration: \"Kuma no Jinsei\" (Japanese:くまの人生) Yasunori Koyama Shōji Yonemura Hiroto Saitō, Kimitaka Itō& Masayuki Satō July 13, 2025(2025-07-13) 2.7%[50]\n\nTwo years before the present, the Bonney Pirates arrive on an island in search of Kuma, who is secretly on the same island but avoids contact to protect Bonney. She declares her intent to find both Kuma and Nika, hoping to gain her father's attention. Meanwhile, Luffy's rising fame prompts reactions from Dragon, Ace, Jinbe, and Kuma, who notes that both his and Dragon's children became pirates. On Egghead, Vegapunk is ordered by Saturn to install a self-destruct mechanism in Kuma and erase his free will, despite Vegapunk's protests. Kuma agrees to have his memories extracted and asks to protect the Thousand Sunny until the Straw Hats return to Sabaody. He reflects on his life, receives kind words from Vegapunk, and expresses gratitude for Bonney's safety. In the present, Bonney sees Kuma's memories and breaks down after witnessing his sacrifices.",
    "tf_idf_text": "kumas lifetransliteration kuma jinsei japanese yasunori koyama shji yonemura hiroto sait kimitaka masayuki sit july two year present bonney pirate arrive island search kuma secretly island avoids contact protect bonney declare intent find kuma nika hop gain father attention meanwhile luffys rise fame prompts reaction dragon ace jinbe kuma note dragon child become pirate egghead vegapunk order saturn install selfdestruct mechanism kuma erase free despite vegapunks protest kuma agree memory extract asks protect thousand sunny straw hat return sabaody reflect life receives kind word vegapunk express gratitude bonney safety present bonney see kumas memory break witness sacrifice"
}