{
    "title": "1137 49 \"I'm Sorry, Dad - Bonney's Tears and Kuma's Fist\"Transliteration: \"Gomen ne, Otōsan - Bonī no Namida to Kuma no Koboshi\" (Japanese:ごめんね、お父さん ボニーの涙とくまの拳) Wataru Matsumi Jin Tanaka Yong-Ce Tu & Ziwei He July 27, 2025(2025-07-27) 2.7%[51]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_21",
    "transformers_text": "1137 49 \"I'm Sorry, Dad - Bonney's Tears and Kuma's Fist\"Transliteration: \"Gomen ne, Otōsan - Bonī no Namida to Kuma no Koboshi\" (Japanese:ごめんね、お父さん ボニーの涙とくまの拳) Wataru Matsumi Jin Tanaka Yong-Ce Tu & Ziwei He July 27, 2025(2025-07-27) 2.7%[51]\n\nAfter viewing Kuma's memories, Bonney reconciles with Vegapunk, who gives her a sapphire necklace meant for her 10th birthday from Kuma. Bonney blames Saturn, not Vegapunk, for Kuma's fate. In the present, Saturn coldly claims Kuma is dead, while Bonney tries to attack him with Distortion Future but fails. Saturn reveals he gave Bonney her Age-Age Fruit powers through an experiment as a baby, which weakens when her perception of the future falters. He dismisses Nika as a myth and admits to infecting Ginny with the Sapphire Scales, which Bonney inherited. As Bonney despairs, Kuma arrives on Egghead and protects her from Saturn's attacks. Shocked by Kuma's survival, Saturn reveals he had activated Kuma's self-destruct mechanism. Kuma employs Armament Haki and delivers a powerful punch to Saturn.",
    "tf_idf_text": "sorry dad bonney tear kumas fisttransliteration gomen otsan bon namida kuma koboshi japanese wataru matsumi jin tanaka yongce ziwei july view kumas memory bonney reconciles vegapunk give sapphire necklace mean birthday kuma bonney blame saturn not vegapunk kumas fate present saturn coldly claim kuma dead bonney try attack distortion future fail saturn reveals give bonney ageage fruit power experiment baby weaken perception future falter dismisses nika myth admits infect ginny sapphire scale bonney inherit bonney despair kuma arrives egghead protects saturns attack shock kumas survival saturn reveals activate kumas selfdestruct mechanism kuma employ armament haki delivers powerful punch saturn"
}