{
    "title": "1138 50 \"Thank You, Dad - Bonney and Kuma's Warm Embrace\"Transliteration: \"Arigatō, Otōsan - Bonī to Kuma no Atsuki Hōyō\" (Japanese:ありがとう、お父さん ボニーとくまの熱き抱擁) Directed by: Tomohiro HigashiStoryboarded by: Katsumi Tokoro Tomohiro Nakayama Masahiro Kitazaki August 3, 2025(2025-08-03) 2.6%[52]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_21",
    "transformers_text": "1138 50 \"Thank You, Dad - Bonney and Kuma's Warm Embrace\"Transliteration: \"Arigatō, Otōsan - Bonī to Kuma no Atsuki Hōyō\" (Japanese:ありがとう、お父さん ボニーとくまの熱き抱擁) Directed by: Tomohiro HigashiStoryboarded by: Katsumi Tokoro Tomohiro Nakayama Masahiro Kitazaki August 3, 2025(2025-08-03) 2.6%[52]\n\nKuma punches Saturn, sending him crashing through buildings. This allows Sanji and Franky to move freely and tend to Bonney. Vegapunk reveals that Kuma's self-destruct mechanism was intended to shut him down, not kill him, and speculates that Kuma's actions—driven by love and a unique Buccaneer power—enabled him to defy his programming and save Bonney. Bonney tearfully thanks Kuma for his sacrifices and love, calling him her kind father regardless of his reputation. Saturn, enraged and regenerating his injuries, attempts to attack again but is countered by Sanji and Franky. Kizaru intervenes and strikes Franky. With Kuma in a vegetative state, Atlas carries him, while Vegapunk criticizes Kizaru for his lack of empathy. Saturn orders a Buster Call to destroy Egghead.",
    "tf_idf_text": "thank dad bonney kumas warm embracetransliteration arigat otsan bon kuma atsuki japanese direct tomohiro higashistoryboarded katsumi tokoro tomohiro nakayama masahiro kitazaki august kuma punch saturn send crash building allow sanji franky move freely tend bonney vegapunk reveals kumas selfdestruct mechanism intend shut not kill speculates kumas actionsdriven love unique buccaneer powerenabled defy programming save bonney bonney tearfully thanks kuma sacrifice love call kind father regardless reputation saturn enrage regenerate injury attempt attack counter sanji franky kizaru intervenes strike franky kuma vegetative state atlas carry vegapunk criticizes kizaru lack empathy saturn order buster call destroy egghead"
}