{
    "title": "1139 51 \"Destroy Egghead - The Buster Call Is Invoked\"Transliteration: \"Egguheddo o Hakai Seyo - Basutā Kōru Hatsudō\" (Japanese:未来島を破壊せよ バスターコール発動) Yusuke Suzuki Ryo Yamazaki Kazuya Hisada August 10, 2025(2025-08-10) 2.6%[53]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_21",
    "transformers_text": "1139 51 \"Destroy Egghead - The Buster Call Is Invoked\"Transliteration: \"Egguheddo o Hakai Seyo - Basutā Kōru Hatsudō\" (Japanese:未来島を破壊せよ バスターコール発動) Yusuke Suzuki Ryo Yamazaki Kazuya Hisada August 10, 2025(2025-08-10) 2.6%[53]\n\nThe Marines evacuate Egghead ahead of the Buster Call, but Saturn and Kizaru remain to ensure the island's destruction. Vegapunk pleads with them to stop, warning that the loss would set humanity back a century, but Saturn refuses, citing the need to erase all knowledge of the Void Century and revealing that he ordered the researchers' ship destroyed. Meanwhile, Nami informs Sanji of the situation, especially now that the Vegaforce-01 has been destroyed. The Buster Call begins, devastating the island, and Kizaru sabotages the Vacuum Rocket, scattering Franky's group. Saturn orders the Pacifistas to execute Kuma and Bonney. Unbeknownst to Saturn, the Marine ship tasked with eliminating the researchers is destroyed, and a surviving Marine reports an unknown group heading towards Egghead.",
    "tf_idf_text": "destroy egghead buster call invokedtransliteration egguheddo hakai seyo basut kru hatsud japanese yusuke suzuki ryo yamazaki kazuya hisada august marine evacuate egghead ahead buster call saturn kizaru remain ensure island destruction vegapunk pleads stop warning loss would set humanity back century saturn refuse cite need erase knowledge void century reveal order researcher ship destroy meanwhile nami informs sanji situation especially vegaforce destroyed buster call begin devastate island kizaru sabotage vacuum rocket scatter frankys group saturn order pacifistas execute kuma bonney unbeknownst saturn marine ship task eliminate researcher destroy survive marine report unknown group head towards egghead"
}