{
    "title": "1140 52 \"An Admired Hero - The Warrior of Liberation Who Saves Bonney\"Transliteration: \"Akogare no Hīrō - Bonī o Sukuu Kaihō no Senshi\" (Japanese:憧れのヒーロー ボニーを救う解放の戦士) Yasuhiro Tanabe Atsuhiro Tomioka Nobuyuki Iwai & Keita Saitō August 17, 2025(2025-08-17) 2.3%[54]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_21",
    "transformers_text": "1140 52 \"An Admired Hero - The Warrior of Liberation Who Saves Bonney\"Transliteration: \"Akogare no Hīrō - Bonī o Sukuu Kaihō no Senshi\" (Japanese:憧れのヒーロー ボニーを救う解放の戦士) Yasuhiro Tanabe Atsuhiro Tomioka Nobuyuki Iwai & Keita Saitō August 17, 2025(2025-08-17) 2.3%[54]\n\nAfter his meal, Luffy transforms into Fifth Gear to evade the Marines. Vegapunk contacts Atlas to relay a message to Bonney, who commands the Pacifistas to protect the Straw Hats and aid their escape, defying both the Marines and Saturn. Vegapunk's programming grants Bonney authority over the Pacifistas, surpassing even the Five Elders. Enraged, Saturn impales Vegapunk and orders Kizaru to kill everyone. Kizaru attacks, but Luffy intervenes and punches him away. Elsewhere, the Iron Giant awakens. At Vegapunk's side, Bonney notices Luffy's heartbeat matches a tune Kuma taught her, and Vegapunk believes Luffy is the Sun God Nika, much to Bonney's big shock. As the Marines falter, Dorry and Brogy arrive on a massive ship from Elbaf to assist the Straw Hats, hailing Luffy as the Sun God.",
    "tf_idf_text": "admire hero warrior liberation save bonneytransliteration akogare bon sukuu kaih senshi japanese yasuhiro tanabe atsuhiro tomioka nobuyuki iwai keita sait august meal luffy transforms fifth gear evade marine vegapunk contact atlas relay message bonney command pacifistas protect straw hat aid escape defy marine saturn vegapunks program grant bonney authority pacifistas surpass even five elder enrage saturn impales vegapunk order kizaru kill everyone kizaru attack luffy intervenes punch away elsewhere iron giant awakens vegapunks side bonney notice luffys heartbeat match tune kuma taught vegapunk believe luffy sun god nika much bonney big shock marine falter dorry brogy arrive massive ship elbaf assist straw hat hail luffy sun god"
}