{
    "title": "1141 53 \"Reliable Reinforcements! Dorry and Brogy Arrive!\"Transliteration: \"Tanomoshiki Engun! Dorī to Burogī Tōchaku!\" (Japanese:頼もしき援軍！ドリーとブロギー到着！) Eri Hyun Akiko Inoue Shigefumi Shingaki,Shūichi Itō & Zhi Guang Liu August 24, 2025(2025-08-24) 2.7%[55]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_21",
    "transformers_text": "1141 53 Reliable Reinforcements Dor ry and Bro gy Arrive Transliteration Tanom o shiki En gun Dor to Bu rog T c haku Japanese Eri Hyun Akiko Inoue S hig ef umi Shin gaki Sh ichi It Zhi Guang Liu August 24 2025 2025 08 24 2 7 55 Dor ry and Bro gy arrive on Egghead ordering O imo and Kashi i to flank the Marines Zoro battles Lucci refusing to be manipulated into surrendering The Marines falter as their ships are destroyed forcing Vice Admiral Red King to change tactics Bonne y tearfully tells Luffy she has been searching those years for him calls him Nik a and asks him to teach her to fight leaving him confused Luffy strikes Saturn with a Gum Gum Dawn Gatling while Sanji deflects Ki zar u's laser Luffy and Sanji stay behind as the crew advances Saturn then encounters Van Augur and Catarina Devon of the Blackbeard Pirates who reveal their allegiance and hint at Blackbeard's ambitions Saturn questions their motives before attacking but they escape with Augur's warping ability Soon after they meet Caribou who begs to join Blackbeard's crew",
    "tf_idf_text": "reliable reinforcement dor bro arrive transliteration tanom shiki gun dor rog haku japanese eri hyun akiko inoue hig umi shin gaki ichi zhi guang liu august dor bro arrive egghead order imo kashi flank marine zoro battle lucci refuse manipulate surrender marine falter ship destroy force vice admiral red king change tactic bonne tearfully tell luffy search year call nik asks teach fight leave confused luffy strike saturn gum gum dawn gatling sanji deflects zar laser luffy sanji stay behind crew advance saturn encounter van augur catarina devon blackbeard pirate reveal allegiance hint blackbeard ambition saturn question motif attack escape augur warp ability soon meet caribou begs join blackbeard crew"
}