{
    "title": "1142 54 \"Come In, World - Vegapunk's Message\"Transliteration: \"Ōtō Seyo, Sekai - Begapanku no Messēji\" (Japanese:応答せよ、世界 ベガパンクのメッセージ) Directed by: Atsuo YamaiStoryboarded by: Miho Hirayama Shinzō Fujita Eisaku Inoue September 7, 2025(2025-09-07) 2.8%[56]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_21",
    "transformers_text": "1142 54 \"Come In, World - Vegapunk's Message\"Transliteration: \"Ōtō Seyo, Sekai - Begapanku no Messēji\" (Japanese:応答せよ、世界 ベガパンクのメッセージ) Directed by: Atsuo YamaiStoryboarded by: Miho Hirayama Shinzō Fujita Eisaku Inoue September 7, 2025(2025-09-07) 2.8%[56]\n\nAugur holds Caribou at gunpoint as Caribou begs for his life, offering Blackbeard information about Poseidon and Pluton to prove his worth. The Marines struggle to break through the Pacifistas' shields, debating whether to halt the Buster Call but deciding instead to kill Bonney to regain control of the Pacifistas. Vice Admiral Tosa attempts to kill her but is defeated by Brogy, who arrives with Dorry and the other Elbaph giants to aid the Straw Hats. Vegapunk refuses to leave the island, entrusting Bonney's safety to the crew. Sanji carries him, but Kizaru mortally wounds Vegapunk before Luffy intervenes, enlarging his body to restrain both Kizaru and Saturn. Back in the lab, a video of Vegapunk begins broadcasting a message to reveal the truth to the world.",
    "tf_idf_text": "come world vegapunks messagetransliteration seyo sekai begapanku messji japanese direct atsuo yamaistoryboarded miho hirayama shinz fujita eisaku inoue september augur hold caribou gunpoint caribou begs life offer blackbeard information poseidon pluton prove worth marine struggle break pacifistas shield debate whether halt buster call decide instead kill bonney regain control pacifistas vice admiral tosa attempt kill defeat brogy arrive dorry elbaph giant aid straw hat vegapunk refuse leave island entrust bonney safety crew sanji carry kizaru mortally wound vegapunk luffy intervenes enlarge body restrain kizaru saturn back lab video vegapunk begin broadcast message reveal truth world"
}