{
    "title": "1143 55 \"Vegapunk's Secret Plan - A Tense Worldwide Broadcast\"Transliteration: \"Begapanku no Hisaku - Kinpaku no Zen Sekai Haishin\" (Japanese:ベガパンクの秘策 緊迫の全世界配信) Hazuki Omoya Shōji Yonemura Toshio Deguchi& Yuki Yoshida September 14, 2025(2025-09-14) 2.3%[57]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_21",
    "transformers_text": "1143 55 \"Vegapunk's Secret Plan - A Tense Worldwide Broadcast\"Transliteration: \"Begapanku no Hisaku - Kinpaku no Zen Sekai Haishin\" (Japanese:ベガパンクの秘策 緊迫の全世界配信) Hazuki Omoya Shōji Yonemura Toshio Deguchi& Yuki Yoshida September 14, 2025(2025-09-14) 2.3%[57]\n\nIn the broadcast video, Shaka questions Dr. Vegapunk about relaying his message worldwide, worrying about censorship and timing. Vegapunk initially considers giving people an hour but shortens it to ten minutes after Shaka warns enemies could cut the feed. To ensure success, Vegapunk hijacks the Marines' comms for an unstoppable global broadcast, which the Marines fail to shut down. Around the world, allies, civilians, and even the Revolutionary Army tune in. Meanwhile, the Elders suspect the broadcast is a dead man's switch and try locating its source in the Labophase. On Egghead, Luffy battles Kizaru and Saturn, flattening them with his newGum-Gum Dawn Cymbalattack, though Saturn recovers. Realizing Vegapunk must be silenced, Saturn finally summons the other four Elders.",
    "tf_idf_text": "vegapunks secret plan tense worldwide broadcasttransliteration begapanku hisaku kinpaku zen sekai haishin japanese hazuki omoya shji yonemura toshio deguchi yuki yoshida september broadcast video shaka question vegapunk relay message worldwide worry censorship time vegapunk initially consider give people hour shortens ten minute shaka warns enemy could cut feed ensure success vegapunk hijack marine comms unstoppable global broadcast marine fail shut around world ally civilian even revolutionary army tune meanwhile elder suspect broadcast dead man switch try locate source labophase egghead luffy battle kizaru saturn flatten newgumgum dawn cymbalattack though saturn recovers realize vegapunk must silence saturn finally summons four elder"
}