{
    "title": "1144 56 \"The Worst Nightmare - The Five Elders Come Together\"Transliteration: \"Saikyō no Akumu - \"Gorōsei\" Shūketsu\" (Japanese:最凶の悪夢 ｢五老星｣集結) Toshinori Fukuzawa Jin Tanaka Shin Kashiwaguma,Katsumi Ishizuka& Yong-Ce Tu September 21, 2025(2025-09-21) 2.6%[58]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_21",
    "transformers_text": "1144 56 \"The Worst Nightmare - The Five Elders Come Together\"Transliteration: \"Saikyō no Akumu - \"Gorōsei\" Shūketsu\" (Japanese:最凶の悪夢 ｢五老星｣集結) Toshinori Fukuzawa Jin Tanaka Shin Kashiwaguma,Katsumi Ishizuka& Yong-Ce Tu September 21, 2025(2025-09-21) 2.6%[58]\n\nThe Five Elders arrive on Egghead, alarming everyone as Vegapunk prepares his broadcast. He reveals that it cannot be stopped, even if disrupted. The Elders' Mythical Zoan Devil Fruits forms are unveiled: Saturn as a gyūki, Marcus Mars as an itsumade, Topman Warcury as a fengxi, Ethanbaron V. Nusjuro as a bakotsu, and Shepherd Ju Peter as a sandworm. Nusjuro immobilizes half the Pacifista, while Mars attacks the Frontier Dome. Sanji urges the crew to escape, but Zoro remains locked in battle with Lucci. Zoro unleashes a Three Sword Style technique to defeat him. Meanwhile, Luffy clashes with Saturn, Warcury, and Ju Peter, who swallows him whole. Just then, Dorry and Brogy appear, slay Ju Peter, and free Luffy, declaring they came to fetch him after growing tired of waiting on Elbaph.",
    "tf_idf_text": "bad nightmare five elder come togethertransliteration saiky akumu gorsei shketsu japanese toshinori fukuzawa jin tanaka shin kashiwagumakatsumi ishizuka yongce september five elder arrive egghead alarm everyone vegapunk prepares broadcast reveals cannot stop even disrupt elder mythical zoan devil fruit form unveil saturn gyki marcus mar itsumade topman warcury fengxi ethanbaron nusjuro bakotsu shepherd peter sandworm nusjuro immobilize half pacifista mar attack frontier dome sanji urge crew escape zoro remain locked battle lucci zoro unleashes three sword style technique defeat meanwhile luffy clash saturn warcury peter swallow whole dorry brogy appear slay peter free luffy declare come fetch grow tired wait elbaph"
}