{
    "title": "1145 57 \"Friends Fight Together! Luffy and the Warriors of Elbaph\"Transliteration: \"Dachi to no Kyōtō! Rufi to Erubafu no Senshi\" (Japanese:友達との共闘！ルフィとエルバフの戦士) Kenichi Takeshita Tomohiro Nakayama Masayuki Takagi September 28, 2025(2025-09-28) 2.6%[59]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_21",
    "transformers_text": "1145 57 \"Friends Fight Together! Luffy and the Warriors of Elbaph\"Transliteration: \"Dachi to no Kyōtō! Rufi to Erubafu no Senshi\" (Japanese:友達との共闘！ルフィとエルバフの戦士) Kenichi Takeshita Tomohiro Nakayama Masayuki Takagi September 28, 2025(2025-09-28) 2.6%[59]\n\nMars, in his Mythical Zoan Devil Fruit form, shatters the Frontier Dome, terrifying Jinbe with his Haki. Jinbe urges Zoro to retreat, but Zoro refuses. Jinbe drags him away, using a dust cloud to escape. Lucci reverts to his human form and reveals York's location, the Straw Hats' escape plan, and the captive agents, warning Mars of Vegapunk's imminent broadcast. Mars thanks him but dismisses the idea of sparing Kaku. Meanwhile, Luffy reunites with the Giant Warrior Pirates, who aid him against Warcury's devastating Haki. With Brogy and Dorry's help, they repel the Elders' attacks and escape, though the Elders regenerate. Elsewhere, Bonney's group faces the Vice Admirals while Mars confronts York. The Marines witness the Iron Giant emerging from the flames, muttering an apology to Joy Boy.",
    "tf_idf_text": "friend fight together luffy warrior elbaphtransliteration dachi kyt rufi erubafu senshi japanese kenichi takeshita tomohiro nakayama masayuki takagi september mar mythical zoan devil fruit form shatters frontier dome terrify jinbe haki jinbe urge zoro retreat zoro refuse jinbe drag away use dust cloud escape lucci revert human form reveals yorks location straw hat escape plan captive agent warn mar vegapunks imminent broadcast mar thank dismisses idea spar kaku meanwhile luffy reunites giant warrior pirate aid warcurys devastate haki brogy dorrys help repel elder attack escape though elder regenerate elsewhere bonneys group face vice admiral mar confronts york marine witness iron giant emerge flame mutter apology joy boy"
}