{
    "title": "1146 58 \"An Imminent Threat - Stussy and Edison's Resolve\"Transliteration: \"Osoi-kuru Kyōi - Sutyūshī to \"Ejison\" no Ketsui\" (Japanese:襲い来る脅威 ステューシーと｢想｣の決意) Shō Inuzuka Ryo Yamazaki Kenji Yokoyama October 19, 2025(2025-10-19) 2.8%[60]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_21",
    "transformers_text": "1146 58 \"An Imminent Threat - Stussy and Edison's Resolve\"Transliteration: \"Osoi-kuru Kyōi - Sutyūshī to \"Ejison\" no Ketsui\" (Japanese:襲い来る脅威 ステューシーと｢想｣の決意) Shō Inuzuka Ryo Yamazaki Kenji Yokoyama October 19, 2025(2025-10-19) 2.8%[60]\n\nThe Marines regain control after disabling the Pacifistas and move to stop Luffy and Bonney's escape. Nusjuro rages over Vegapunk's defiance, while the giants attempt to retreat before the Marines can target their ship. Franky defeats Red King as Bonney transforms Pomsky into a child and kicks him away. On the Labophase, Mars destroys the broadcast room but fails to stop Vegapunk's telecast. York assists him in locating the hidden Transponder Snail, which he senses inside Punk Records. Meanwhile, Stussy stays behind to deactivate the Frontier Dome and Edison decides to fly through the dome barrier to allow the Straw Hats to escape. Luffy fends off Ju Peter but reverts to his normal form. After eating hákarl, he regains his strength and attacks Warcury, only to recoil in pain. Saturn confronts Nami's group as Mars discovers the Transponder Snail moments before the broadcast begins.",
    "tf_idf_text": "imminent threat stussy edison resolvetransliteration osoikuru kyi sutysh ejison ketsui japanese inuzuka ryo yamazaki kenji yokoyama october marine regain control disable pacifistas move stop luffy bonney escape nusjuro rage vegapunks defiance giant attempt retreat marine target ship franky defeat red king bonney transforms pomsky child kick away labophase mar destroy broadcast room fail stop vegapunks telecast york assist locate hidden transponder snail sens inside punk record meanwhile stussy stay behind deactivate frontier dome edison decides fly dome barrier allow straw hat escape luffy fends peter reverts normal form eat hkarl regains strength attack warcury recoil pain saturn confronts namis group mar discovers transponder snail moment broadcast begin"
}