{
    "title": "1148 60 \"The Lost History - Joy Boy, the First Pirate\"Transliteration: \"Maboroshi no Rekishi - Hajimari no Kaizoku Joi Bōi\" (Japanese:幻の歴史 はじまりの海賊ジョイボーイ) Yusuke Suzuki Akiko Inoue Kazuya Hisada November 2, 2025(2025-11-02) 2.8%[62]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_21",
    "transformers_text": "1148 60 \"The Lost History - Joy Boy, the First Pirate\"Transliteration: \"Maboroshi no Rekishi - Hajimari no Kaizoku Joi Bōi\" (Japanese:幻の歴史 はじまりの海賊ジョイボーイ) Yusuke Suzuki Akiko Inoue Kazuya Hisada November 2, 2025(2025-11-02) 2.8%[62]\n\nVegapunk's warning that the world will sink sparks disbelief around the globe. Some fear his words will trigger widespread chaos, while the Five Elders, growing desperate, decide to wipe out everything on Egghead. Vegapunk predicts a massive earthquake followed by a one-meter sea-level rise that will submerge several islands, insisting the phenomenon is not natural. As Saturn rushes toward the Mother Flame, Vegapunk admits his first \"sin\" was creating the Mother Flame, an unlimited energy source. His second was researching the Poneglyphs using Ohara's documents to study the Void Century. Meanwhile, chaos engulfs Egghead as Luffy battles Warcury and the Straw Hats attempt to escape. Vegapunk also reveals that Joy Boy, a rubber-bodied man similar to Nika, was the world's first-ever pirate.",
    "tf_idf_text": "lose history joy boy first piratetransliteration maboroshi rekishi hajimari kaizoku joi japanese yusuke suzuki akiko inoue kazuya hisada november vegapunks warn world sink spark disbelief around globe fear word trigger widespread chaos five elder grow desperate decide wipe everything egghead vegapunk predicts massive earthquake follow onemeter sealevel rise submerge several island insist phenomenon not natural saturn rush toward mother flame vegapunk admits first sin create mother flame unlimited energy source second researching poneglyphs use oharas document study void century meanwhile chaos engulfs egghead luffy battle warcury straw hat attempt escape vegapunk also reveal joy boy rubberbodied man similar nika world firstever pirate"
}