{
    "title": "1149 61 \"The Void Century - A Revelation About a Sinking World\"Transliteration: \"Kūhaku no Hyaku-nen - Sekai Chinbotsu no Shinjitsu\" (Japanese:空白の100年 世界沈没の真実) Shō Matsui Shinzō Fujita Hiroto Saitō & Yuki Yoshida November 9, 2025(2025-11-09) 3.4%[63]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_21",
    "transformers_text": "1149 61 \"The Void Century - A Revelation About a Sinking World\"Transliteration: \"Kūhaku no Hyaku-nen - Sekai Chinbotsu no Shinjitsu\" (Japanese:空白の100年 世界沈没の真実) Shō Matsui Shinzō Fujita Hiroto Saitō & Yuki Yoshida November 9, 2025(2025-11-09) 3.4%[63]\n\nVegapunk explains that the Poneglyphs describe an ancient war between Joy Boy and the twenty kingdoms that became the World Government. Mars tries to halt the broadcast with his Haki, but it continues. Vegapunk says the conflict was ideological, tied to the advanced kingdom Joy Boy came from, whose weapons surpass modern science. As chaos erupts on Egghead, Nusjuro unleashes devastating attacks while the Straw Hats race to escape. Vegapunk reveals that 1,000 years ago, a man-made cataclysm sank the ancient world, raising sea levels by 200 meters, caused by the Ancient Weapons. He admits a stolen fragment of the Mother Flame powered Lulusia's destruction, proving the danger. Vegapunk warns the ancient war never truly ended and hints the Roger Pirates know the truth. York finally realizes the Iron Giant is guarding the true Transponder Snail.",
    "tf_idf_text": "void century revelation sink worldtransliteration khaku hyakunen sekai chinbotsu shinjitsu japanese matsui shinz fujita hiroto sait yuki yoshida november vegapunk explain poneglyphs describe ancient war joy boy twenty kingdom become world government mar try halt broadcast haki continue vegapunk say conflict ideological tie advanced kingdom joy boy come whose weapon surpass modern science chaos erupts egghead nusjuro unleashes devastate attack straw hat race escape vegapunk reveals year ago manmade cataclysm sink ancient world raise sea level meter cause ancient weapon admit steal fragment mother flame power lulusias destruction prove danger vegapunk warn ancient war never truly ended hint roger pirate know truth york finally realize iron giant guard true transponder snail"
}