{
    "title": "1150 62 \"Get the Ship Moving! The Iron Giant Activates\"Transliteration: \"Fune o Dase! \"Tetsu no Kyojin\" Shidō\" (Japanese:船を出せ！〝鉄の巨人〟始動) Directed by: Tomohiro HigashiStoryboarded by: Miho Hirayama Shōji Yonemura Eisaku Inoue, Keita Saitō& Kimitaka Itō November 16, 2025(2025-11-16) 2.8%[64]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_21",
    "transformers_text": "1150 62 \"Get the Ship Moving! The Iron Giant Activates\"Transliteration: \"Fune o Dase! \"Tetsu no Kyojin\" Shidō\" (Japanese:船を出せ！〝鉄の巨人〟始動) Directed by: Tomohiro HigashiStoryboarded by: Miho Hirayama Shōji Yonemura Eisaku Inoue, Keita Saitō& Kimitaka Itō November 16, 2025(2025-11-16) 2.8%[64]\n\nAs the Five Elders shift their focus to the Iron Giant, Vegapunk warns that anything further would be speculation, yet he continues anyway, heightening curiosity about what Roger truly left behind. On Egghead, the Straw Hats prepare for launch while Jinbe intercepts Nusjuro, giving Zoro the chance to clash with him. Meanwhile, Marines surround the giants' ship and unleash heavy attacks. Warcury abandons his pursuit to join the other Elders in confronting the Iron Giant. Vegapunk announces he has one final message and begins addressing those who bear \"D\". in their names. Before he can reveal its true meaning, Warcury tackles the Iron Giant into the ocean, abruptly ending Vegapunk's broadcast. As the Iron Giant sinks, it wonders where Joy Boy really is.",
    "tf_idf_text": "get ship move iron giant activatestransliteration fune dase tetsu kyojin shid japanese direct tomohiro higashistoryboarded miho hirayama shji yonemura eisaku inoue keita sait kimitaka november five elder shift focus iron giant vegapunk warn anything would speculation yet continue anyway heighten curiosity roger truly leave behind egghead straw hat prepare launch jinbe intercept nusjuro give zoro chance clash meanwhile marine surround giant ship unleash heavy attack warcury abandon pursuit join elder confront iron giant vegapunk announce one final message begin address bear name reveal true meaning warcury tackle iron giant ocean abruptly end vegapunks broadcast iron giant sink wonder joy boy really"
}