{
    "title": "1151 63 \"Her and Her Father's Dream! Bonney's Free Future\"Transliteration: \"Chichi to Egaita Yume! Bonī no Jiyūna Mirai\" (Japanese:父と描いた夢！ボニーの自由な未来) Directed by: Eri HyunStoryboarded by: Aya Komaki& Eri Hyun Jin Tanaka Masahiro Shimanuki& Zhi Guang Liu November 30, 2025(2025-11-30) TBD",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_21",
    "transformers_text": "1151 63 \"Her and Her Father's Dream! Bonney's Free Future\"Transliteration: \"Chichi to Egaita Yume! Bonī no Jiyūna Mirai\" (Japanese:父と描いた夢！ボニーの自由な未来) Directed by: Eri HyunStoryboarded by: Aya Komaki& Eri Hyun Jin Tanaka Masahiro Shimanuki& Zhi Guang Liu November 30, 2025(2025-11-30) TBD\n\nVegapunk’s interrupted broadcast sparks global confusion over his death, with some blaming the World Government and others accusing Luffy due to false allegations that he was holding Vegapunk hostage. On Egghead, the Five Elders discover that only Lilith and Atlas remain connected to Punk Records and move to eliminate them. The giants set sail alongside Luffy, Dorry, and Brogy, while Bonney transforms several Marines into children. Mars attacks the ship, but Luffy enters Fifth Gear and inspires Bonney to awaken her own Nika-like form. Luffy then sends Mars flying with aGum-Gum Dawn Balloon. Meanwhile, Vegapunk’s broadcast resumes, prompting York to insist that the broadcast Transponder Snail must be destroyed. As Ju Peter attacks and Warcury charges forward, Emet, the Iron Giant, rises from the sea and stops him.",
    "tf_idf_text": "father dream bonney free futuretransliteration chichi egaita yume bon jiyna mirai japanese direct eri hyunstoryboarded aya komaki eri hyun jin tanaka masahiro shimanuki zhi guang liu november tbd vegapunks interrupt broadcast spark global confusion death blame world government others accuse luffy due false allegation hold vegapunk hostage egghead five elder discover lilith atlas remain connected punk record move eliminate giant set sail alongside luffy dorry brogy bonney transform several marine child mar attack ship luffy enters fifth gear inspires bonney awaken nikalike form luffy send mar fly agumgum dawn balloon meanwhile vegapunks broadcast resume prompt york insist broadcast transponder snail must destroy peter attack warcury charge forward emet iron giant rise sea stop"
}