{
    "title": "en.wikipedia.org_wiki_One_Piece__Pirate_Warriors_2",
    "url": "https://en.wikipedia.org/wiki/One_Piece:_Pirate_Warriors_2",
    "transformers_text": "One Piece: Pirate Warriors 2 [ b ] is an action video game developed by Omega Force and published by Bandai Namco Games for PlayStation 3 and PlayStation Vita . It is the sequel to One Piece: Pirate Warriors . [ 1 ] Due to the success of the first game, the sequel was released the year following. It was released in Japan on March 20, 2013, [ 2 ] Europe on August 30, 2013, and in the U.S. on September 3, 2013. [ 3 ] [ 4 ]\n\nA sequel, One Piece: Pirate Warriors 3 , was released in March 2015. And a fourth game, One Piece: Pirate Warriors 4 , was released in March 2020.\n\nThe game no longer uses a canon story like the original. Instead it uses an original story that take place two years after the Straw Hats Pirates entered the New World. Battles have been changed to focus more on the warrior gameplay, and the player will have to fight through higher numbers of enemies than the previous game. The quick time events from the first game has been removed completely. The game also features a coin system, in which players can spend the money they earn from stages to level up new characters quickly, instead of training them from level 1.\n\nOne noticeable change from the previous game is how support is handled. Players can build up a support gauge throughout gameplay, and use it to go into \"Style mode\". When in this mode they have the option of temporarily switching characters, and playing as the new character until the support gauge runs out. Style mode also gives a different benefit depending on the characters used: \"Armament\" characters do more damage when attacking, while \"Observation\" characters effectively slow down time, while retaining their normal speed. [ 5 ]\n\nThe game features a total of 27 playable characters, including all 13 characters from the previous game. As with the previous game, other characters appear as non-playable enemies . [ 6 ] [ 7 ]\n\nNewcomers to the series are marked in bold .\n\nThere are 15 tracks along with the previous song from One Piece: Pirate Warriors , which also re-used again in this game.\n\nThe game sold more than 410,000 copies on PlayStation Vita and PlayStation 3 combined in its first week in Japan, and managed to be the seventh most downloaded game in its first week on PlayStation Network in the United States. It has a score of 71/100 on Metacritic . [ 8 ] IGN awarded it a score of 6.5 out of 10, saying \"One Piece: Pirate Warriors 2 starts slow, but its over-the-top combat and personality redeem it in the end.\" [ 9 ]",
    "tf_idf_text": "one piece pirate warrior action video game develop omega force publish bandai namco game playstation playstation vita sequel one piece pirate warrior due success first game sequel release year follow release japan march europe august september sequel one piece pirate warrior release march fourth game one piece pirate warrior release march game longer use canon story like original instead use original story take place two year straw hat pirate enter new world battle change focus warrior gameplay player fight high number enemies previous game quick time event first game remove completely game also feature coin system player spend money earn stage level new character quickly instead train level one noticeable change previous game support handle player build support gauge throughout gameplay use style mode mode option temporarily switch character play new character support gauge run style mode also give different benefit depend character use armament character damage attack observation character effectively slow time retain normal speed game feature total playable character include character previous game previous game character appear nonplayable enemy newcomer series mark bold track along previous song one piece pirate warrior also reuse game game sell copy playstation vita playstation combine first week japan manage seventh downloaded game first week playstation network united state score metacritic ign award score say one piece pirate warrior start slow overthetop combat personality redeem end"
}