{
    "title": "en.wikipedia.org_wiki_Media_Factory",
    "url": "https://en.wikipedia.org/wiki/Media_Factory",
    "transformers_text": "Media Factory ( メディアファクトリー , Mediafakutorī ) , formerly known as Media Factory, Inc. ( 株式会社メディアファクトリー , Kabushiki gaisha Mediafakutorī ) , was a Japanese publisher and brand company of Kadokawa Future Publishing .\n\nThe company was founded on December 1, 1986, and was a subsidiary of Recruit Co., Ltd. , based in Shibuya , Tokyo . Media Factory was possibly the first anime distributor to ask for sites to not link to fansubs of any anime produced by the company. [ 2 ] On October 12, 2011, Media Factory was purchased by Kadokawa Corporation for ¥8,000,000,000. [ 3 ] Media Factory also has a monthly manga magazine, Monthly Comic Alive , and its own light novel imprint, MF Bunko J . Media Factory also holds the license for the distribution of The 39 Clues in Japan. Media Factory ceased being a kabushiki gaisha , as well as retired the Pokémon anime series on October 1, 2013, when it was merged with eight other companies to become a brand company of Kadokawa Corporation. [ 4 ] It had a record label, Pikachu Records, that produced Pokémon CDs and Pokémon soundtracks in Japan from 1997 to 2012. Most Pokémon albums in Japan came from Pikachu Records during this period. It was retired when Media Factory was purchased by Kadokawa Corporation. On August 17, 2021, the website for Media Factory was officially closed with a notice directing readers to Kadokawa's website for future products and services. [ 5 ]\n\nThe following anime and manga titles are associated with Kadokawa Corporation / Media Factory",
    "tf_idf_text": "medium factory mediafakutor formerly know medium factory inc kabushiki gaisha mediafakutor japanese publisher brand company kadokawa future publish company found december subsidiary recruit ltd base shibuya tokyo medium factory possibly first anime distributor ask sit not link fansubs anime produce company october medium factory purchase kadokawa corporation medium factory also monthly manga magazine monthly comic alive light novel imprint bunko medium factory also hold license distribution clue japan medium factory cease kabushiki gaisha well retired pokmon anime series october merge eight company become brand company kadokawa corporation record label pikachu record produce pokmon cd pokmon soundtracks japan pokmon album japan come pikachu record period retire medium factory purchase kadokawa corporation august website medium factory officially close notice direct reader kadokawas website future product service follow anime manga title associate kadokawa corporation medium factory"
}