{
    "title": "133 — 3 \"A Recipe Handed Down! Sanji, the Iron Man of Curry!\"Transliteration: \"Uketsugareru Yume! Karē no Tetsujin Sanji\" (Japanese:受け継がれる夢! カレーの鉄人サンジ) Hidehiko Kadota Junki Takegami November 17, 2002(2002-11-17)[17] —",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_5",
    "transformers_text": "133 — 3 \"A Recipe Handed Down! Sanji, the Iron Man of Curry!\"Transliteration: \"Uketsugareru Yume! Karē no Tetsujin Sanji\" (Japanese:受け継がれる夢! カレーの鉄人サンジ) Hidehiko Kadota Junki Takegami November 17, 2002(2002-11-17)[17] —\n\nIn a thick bank of fog, the Straw Hats run into a fleet of navy ships. Surprised by the sight of the skull and crossbones on the pirate ship's sails, the young trainee cook Tajiyo falls off of his navy vessel. Robin catches him before he hits the water and the boy regains consciousness in the Straw Hats' cabin. Scared at first, he loosens up when presented by Sanji with a soup of surprising quality. The small cook reveals his problem: he spilled the day's production ofcurryand has been charged with replacing it. To compound the issue, the fleet's captains plan to dine aboard his ship. Luffy and Sanji take Tajiyo back to his ship, where Sanji provides him with subtle cooking advice. Tajiyo's new curry turns out perfectly and the Straw Hats escape before the fog lifts in the mid-day sun.",
    "tf_idf_text": "recipe hand sanji iron man currytransliteration uketsugareru yume kar tetsujin sanji japanese hidehiko kadota junki takegami november thick bank fog straw hat run fleet navy ship surprise sight skull crossbones pirate ship sail young trainee cook tajiyo fall navy vessel robin catch hit water boy regain consciousness straw hat cabin scar first loosens present sanji soup surprising quality small cook reveals problem spill day production ofcurryand charge replace compound issue fleet captain plan dine aboard ship luffy sanji take tajiyo back ship sanji provide subtle cook advice tajiyos new curry turn perfectly straw hat escape fog lift midday sun"
}