{
    "title": "134 — 4 \"I Will Make it Bloom! Usopp, the Man, and the Eight-Foot Shell!\"Transliteration: \"Sakasete Misemasu! Otoko Usoppu Hachi Shaku Tama\" (Japanese:咲かせてみせます! 男ウソップ八尺玉) Munehisa Sakai Junki Takegami November 24, 2002(2002-11-24)[18] —",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_5",
    "transformers_text": "134 — 4 \"I Will Make it Bloom! Usopp, the Man, and the Eight-Foot Shell!\"Transliteration: \"Sakasete Misemasu! Otoko Usoppu Hachi Shaku Tama\" (Japanese:咲かせてみせます! 男ウソップ八尺玉) Munehisa Sakai Junki Takegami November 24, 2002(2002-11-24)[18] —\n\nBecause it is raining, Luffy reads out of boredom. Fortunately for him, the Straw Hats' ship reaches the next island. Walking through its port town, they learn that the island known for its yearly fireworks show, which was to occur that day. The fireworks factory, run by an old man named Odama and his granddaughter Kodama, is on a hill outside the town. Usopp goes there, hoping for an opportunity to buy gunpowder. At the factory, he helps Odama and Kodama prepare for the show. Usopp learns that Kodama plans to secretly fire the second of two eight-shaku-tall firework balls to fulfill her parents' dream. Her parents died the previous year after the first misfired, and Usopp convinces Kodama that it is too dangerous for her to fire it. Usopp uses a tall, ancient building to safely launch the large firework ball.",
    "tf_idf_text": "make bloom usopp man eightfoot shelltransliteration sakasete misemasu otoko usoppu hachi shaku tama japanese munehisa sakai junki takegami november rain luffy read boredom fortunately straw hat ship reach next island walk port town learn island know yearly firework show occur day fireworks factory run old man name odama granddaughter kodama hill outside town usopp go hop opportunity buy gunpowder factory help odama kodama prepare show usopp learn kodama plan secretly fire second two eightshakutall firework ball fulfill parent dream parent die previous year first misfire usopp convinces kodama dangerous fire usopp use tall ancient building safely launch large firework ball"
}