{
    "title": "134 — 4 \"I Will Make it Bloom! Usopp, the Man, and the Eight-Foot Shell!\"Transliteration: \"Sakasete Misemasu! Otoko Usoppu Hachi Shaku Tama\" (Japanese:咲かせてみせます! 男ウソップ八尺玉) Munehisa Sakai Junki Takegami November 24, 2002(2002-11-24)[18] —",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_5",
    "transformers_text": "134 4 I Will Make it Bloom Us opp the Man and the Eight Foot Shell Transliteration Saka set e Mise masu O toko Us opp u Hachi Shaku Tama Japanese M une his a Sakai Junk i Take gam i November 24 2002 2002 11 24 18 Because it is raining Luffy reads out of boredom Fortunately for him the Straw Hats ' ship reaches the next island Walking through its port town they learn that the island known for its yearly fireworks show which was to occur that day The fireworks factory run by an old man named O dama and his granddaughter Kodama is on a hill outside the town Us opp goes there hoping for an opportunity to buy gunpowder At the factory he helps O dama and Kodama prepare for the show Us opp learns that Kodama plans to secretly fire the second of two eight shaku tall firework balls to fulfill her parents ' dream Her parents died the previous year after the first misfired and Us opp convinces Kodama that it is too dangerous for her to fire it Us opp uses a tall ancient building to safely launch the large firework ball",
    "tf_idf_text": "make bloom opp man eight foot shell transliteration saka set mise masu toko opp hachi shaku tama japanese une sakai junk take gam november rain luffy read boredom fortunately straw hat ship reach next island walk port town learn island know yearly firework show occur day fireworks factory run old man name dama granddaughter kodama hill outside town opp go hop opportunity buy gunpowder factory help dama kodama prepare show opp learn kodama plan secretly fire second two eight shaku tall firework ball fulfill parent dream parent die previous year first misfire opp convinces kodama dangerous fire opp use tall ancient building safely launch large firework ball"
}