{
    "title": "135 99 5 \"Legend of the Pirate Hunter!\"\"The Fabled Pirate Hunter! Zoro, the Wandering Swordsman!\"Transliteration: \"Uwasa no Kaizoku Gari! Sasurai no Kenshi Zoro\" (Japanese:噂の海賊狩り! さすらいの剣士ゾロ) Junji Shimizu Junki Takegami December 1, 2002(2002-12-01)[19] August 4, 2007[20][21]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_5",
    "transformers_text": "135 99 5 Legend of the Pirate Hunter The Fabled Pirate Hunter Zoro the Wandering Swordsman Transliteration U was a no Kai z oku Gari S asura i no Ken shi Zoro Japanese Junji Shimizu Junk i Take gam i December 1 2002 2002 12 01 19 August 4 2007 20 21 Before he meets Luffy Zoro traveled the world in search of Hawk Eye Mi hawk In a flashback Zoro captures the target of the bounty hunters Johnny and Yo s aku in a bar According to bounty hunter rules they demand that he relinquish the victim's body to them Zoro who does not consider himself a bounty hunter complies explaining that he only brings in a bounty from time to time so that he can survive until he can become the greatest swordsman in the world Later that day a group of bandits led by a man with a much higher bounty plunders the village Johnny and Yo s aku inspired by Zoro's conviction decide to take on the villain but are quickly defeated As the bandits prepare to kill the pair Zoro returns and saves Johnny and Yo s aku After he defeats the bandits and their leader Johnny and Yo s aku become his followers",
    "tf_idf_text": "legend pirate hunter fabled pirate hunter zoro wander swordsman transliteration kai oku gari asura ken shi zoro japanese junji shimizu junk take gam december august meet luffy zoro travel world search hawk eye hawk flashback zoro capture target bounty hunter johnny aku bar accord bounty hunter rule demand relinquish victim body zoro not consider bounty hunter complies explain brings bounty time time survive become great swordsman world later day group bandits lead man much high bounty plunder village johnny aku inspire zoros conviction decide take villain quickly defeat bandit prepare kill pair zoro return save johnny aku defeat bandit leader johnny aku become follower"
}