{
    "title": "136 — 6 \"Zenny of the Island of Goats and the Pirate Ship in the Mountains!\"Transliteration: \"Yagi no Shima no Zenii to Yama no Naka no Kaizoku Sen!\" (Japanese:ヤギの島のゼニィと山の中の海賊船!) Directed by: Junichi FujiseStoryboarded by: Kenji Yokoyama Yoshiyuki Suga December 8, 2002(2002-12-08)[22] —",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_5",
    "transformers_text": "136 — 6 \"Zenny of the Island of Goats and the Pirate Ship in the Mountains!\"Transliteration: \"Yagi no Shima no Zenii to Yama no Naka no Kaizoku Sen!\" (Japanese:ヤギの島のゼニィと山の中の海賊船!) Directed by: Junichi FujiseStoryboarded by: Kenji Yokoyama Yoshiyuki Suga December 8, 2002(2002-12-08)[22] —\n\nA few navy ships chase the Straw Hats. To escape them, the Straw Hats sail through an area of wild currents, which surround an island that is only inhabited by an old man named Zenny and his goats. Zenny realizes that the Straw Hats are pirates and sends his goats to attack them. During the fight Zenny's heart stops from fear. The Straw Hats take him to his home, nurse him back to health, and complete his chores, such as cleaning his house, preparing meals, and chopping wood. Zoro searches for food and discovers a small nearly completed pirate ship atop the island's mountain. At the day's end, as the crew is about to leave, Chopper reveals that the old man will die within three days. Driven by guilt, the Straw Hats decide to stay with him until then.",
    "tf_idf_text": "zenny island goat pirate ship mountainstransliteration yagi shima zenii yama naka kaizoku sen japanese direct junichi fujisestoryboarded kenji yokoyama yoshiyuki suga december navy ship chase straw hat escape straw hat sail area wild current surround island inhabit old man name zenny goat zenny realize straw hat pirate sends goat attack fight zennys heart stop fear straw hat take home nurse back health complete chore clean house prepare meal chop wood zoro search food discovers small nearly complete pirate ship atop island mountain day end crew leave chopper reveals old man die within three day driven guilt straw hat decide stay"
}