{
    "title": "137 — 7 \"How's Tricks? The Designs of Zenny the Moneylender!\"Transliteration: \"Mōkarimakka? Kanekashi Zenii no Yabō!\" (Japanese:儲かりまっか? 金貸しゼニィの野望!) Yuji Endo Yoshiyuki Suga December 15, 2002(2002-12-15)[23] —",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_5",
    "transformers_text": "137 — 7 \"How's Tricks? The Designs of Zenny the Moneylender!\"Transliteration: \"Mōkarimakka? Kanekashi Zenii no Yabō!\" (Japanese:儲かりまっか? 金貸しゼニィの野望!) Yuji Endo Yoshiyuki Suga December 15, 2002(2002-12-15)[23] —\n\nThe Straw Hats continue to do Zenny's daily work and finish building his pirate ship, which he intends to use as a coffin. Zoro eventually realizes that the three days until Zenny's death, which Chopper had diagnosed, have long passed, but by the time he convinces the others to leave, Nami has already lost the Straw Hats' ship in a game of chess. Robin wins it back and they all have a party. As Zenny becomes drunk, he recollects his past as a moneylender who lent money to pirates. He describes how he was shipwrecked twenty years earlier, and that he, in hopes of one day becoming a pirate, started building a ship. As the years passed, he became too old for a pirate's life. Luffy disagrees, saying that pirates can be of any age. The next day, a group of marines lures the Straw Hats into a trap. To save them, Zenny and his goats ride his ship down the mountainside.",
    "tf_idf_text": "hows trick design zenny moneylendertransliteration mkarimakka kanekashi zenii yab japanese yuji endo yoshiyuki suga december straw hat continue zennys daily work finish building pirate ship intend use coffin zoro eventually realize three day zennys death chopper diagnose long passed time convinces others leave nami already lose straw hat ship game chess robin win back party zenny become drunk recollects past moneylender lent money pirate describe shipwreck twenty year earlier hop one day become pirate start build ship year pass become old pirate life luffy disagrees say pirate age next day group marines lure straw hat trap save zenny goat ride ship mountainside"
}