{
    "title": "138 — 8 \"Whereabouts of the Island Treasure! Attack of the Zenny Pirates!\"Transliteration: \"Shima no Otakara no Yukue! Zenii Kaizoku Dan Shutsugeki!\" (Japanese:島のお宝の行方! ゼニィ海賊団出撃!) Yoko Ikeda Yoshiyuki Suga December 22, 2002(2002-12-22)[24][25] —",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_5",
    "transformers_text": "138 — 8 \"Whereabouts of the Island Treasure! Attack of the Zenny Pirates!\"Transliteration: \"Shima no Otakara no Yukue! Zenii Kaizoku Dan Shutsugeki!\" (Japanese:島のお宝の行方! ゼニィ海賊団出撃!) Yoko Ikeda Yoshiyuki Suga December 22, 2002(2002-12-22)[24][25] —\n\nThe commotion caused by Zenny's arrival allows Nami, Sanji, Usopp, and Chopper to board their ship safely. Zenny and his goats get on the navy ship and Zenny uses of his martial arts skills, with acounting frameto fight. Luffy attempts toslingshothimself over to help him, but lands in the water instead. Zoro immediately jumps in after him to rescue the non-swimmer, only to be run over by the Straw Hats' own ship. The marines are eventually defeated, but a fleet of nine more ships is still waiting in the fog surrounding the island. Zenny tells the Straw Hats that, on his arrival on the island, the goats ate all of his money and that they became his treasure instead. The Straw Hats give Zenny enough medicine to survive and leave the island, escaping from the navy.",
    "tf_idf_text": "whereabouts island treasure attack zenny piratestransliteration shima otakara yukue zenii kaizoku dan shutsugeki japanese yoko ikeda yoshiyuki suga december commotion cause zennys arrival allow nami sanji usopp chopper board ship safely zenny goat get navy ship zenny use martial art skill acounting frameto fight luffy attempt toslingshothimself help land water instead zoro immediately jump rescue nonswimmer run straw hat ship marine eventually defeat fleet nine ship still wait fog surround island zenny tell straw hat arrival island goat eat money become treasure instead straw hat give zenny enough medicine survive leave island escape navy"
}