{
    "title": "139 100 9 \"The Rainbow Mist\"\"Legend of the Rainbow Mist! Old Man Henzo of Luluka Island!\"Transliteration: \"Nijiiro no Kiri Densetsu! Rurukajima no Rōjin Henzo\" (Japanese:虹色の霧伝説! ルルカ島の老人ヘンゾ) Hidehiko Kadota Ryōta Yamaguchi January 5, 2003(2003-01-05)[26][27] August 11, 2007[28][29]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_5",
    "transformers_text": "139 100 9 \"The Rainbow Mist\"\"Legend of the Rainbow Mist! Old Man Henzo of Luluka Island!\"Transliteration: \"Nijiiro no Kiri Densetsu! Rurukajima no Rōjin Henzo\" (Japanese:虹色の霧伝説! ルルカ島の老人ヘンゾ) Hidehiko Kadota Ryōta Yamaguchi January 5, 2003(2003-01-05)[26][27] August 11, 2007[28][29]\n\nAfter escaping from another fleet of navy ships, the Straw Hats drop anchor outside a town with a huge tower. After they set foot on land, an official demands that they pay a harbor tax. The Straw Hats meet a scientist named Henzo, who asks them if they have seen what he calls the \"Rainbow Mist.\" The other citizens of the town dislike Henzo because they have topay high taxesto fund for his research. While shopping with Nami and Chopper, Sanji has a violent encounter with a tax collector, who is wearing an electric battle suit. A large, unmanned galley appears in the harbor, in the same condition that Henzo saw it fifty years ago. Henzo, Luffy, Robin, and Usopp board it. Further out at sea, a rainbow-colored mist appears and the group uses the Straw Hats' ship to enter it.",
    "tf_idf_text": "rainbow mistlegend rainbow mist old man henzo luluka islandtransliteration nijiiro kiri densetsu rurukajima rjin henzo japanese hidehiko kadota ryta yamaguchi january august escape another fleet navy ship straw hat drop anchor outside town huge tower set foot land official demand pay harbor tax straw hat meet scientist name henzo ask see call rainbow mist citizen town dislike henzo topay high taxesto fund research shop nami chopper sanji violent encounter tax collector wear electric battle suit large unmanned galley appear harbor condition henzo saw fifty year ago henzo luffy robin usopp board sea rainbowcolored mist appear group use straw hat ship enter"
}