{
    "title": "139 100 9 \"The Rainbow Mist\"\"Legend of the Rainbow Mist! Old Man Henzo of Luluka Island!\"Transliteration: \"Nijiiro no Kiri Densetsu! Rurukajima no Rōjin Henzo\" (Japanese:虹色の霧伝説! ルルカ島の老人ヘンゾ) Hidehiko Kadota Ryōta Yamaguchi January 5, 2003(2003-01-05)[26][27] August 11, 2007[28][29]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_5",
    "transformers_text": "139 100 9 The Rainbow Mist Legend of the Rainbow Mist Old Man H enzo of Lulu ka Island Transliteration Ni j ii ro no Kiri Dense tsu R uruk a jima no R j in H enzo Japanese Hidehiko Ka dota Ry ta Yamaguchi January 5 2003 2003 01 05 26 27 August 11 2007 28 29 After escaping from another fleet of navy ships the Straw Hats drop anchor outside a town with a huge tower After they set foot on land an official demands that they pay a harbor tax The Straw Hats meet a scientist named H enzo who asks them if they have seen what he calls the Rainbow Mist The other citizens of the town dislike H enzo because they have to pay high taxes to fund for his research While shopping with Nami and Chopper Sanji has a violent encounter with a tax collector who is wearing an electric battle suit A large unmanned galley appears in the harbor in the same condition that H enzo saw it fifty years ago H enzo Luffy Robin and Us opp board it Further out at sea a rainbow colored mist appears and the group uses the Straw Hats ' ship to enter it",
    "tf_idf_text": "rainbow mist legend rainbow mist old man enzo lulu island transliteration kiri dense tsu uruk jima enzo japanese hidehiko dota yamaguchi january august escape another fleet navy ship straw hat drop anchor outside town huge tower set foot land official demand pay harbor tax straw hat meet scientist name enzo ask see call rainbow mist citizen town dislike enzo pay high tax fund research shopping nami chopper sanji violent encounter tax collector wear electric battle suit large unmanned galley appear harbor condition enzo saw fifty year ago enzo luffy robin opp board sea rainbow color mist appear group use straw hat ship enter"
}