{
    "title": "140 101 10 \"Wreckers Reef\"\"Residents of the Land of Eternity! The Pumpkin Pirates!\"Transliteration: \"Eien no Kuni no Jūnin! Panpukin Kaizoku Dan!\" (Japanese:永遠の国の住人! パンプキン海賊団!) Munehisa Sakai Ryōta Yamaguchi January 12, 2003(2003-01-12)[30] August 25, 2007[31][32]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_5",
    "transformers_text": "140 101 10 \"Wreckers Reef\"\"Residents of the Land of Eternity! The Pumpkin Pirates!\"Transliteration: \"Eien no Kuni no Jūnin! Panpukin Kaizoku Dan!\" (Japanese:永遠の国の住人! パンプキン海賊団!) Munehisa Sakai Ryōta Yamaguchi January 12, 2003(2003-01-12)[30] August 25, 2007[31][32]\n\nInside the mist, Luffy and his group discover a largeship graveyard. Luffy salvages a chest filled with gold and jewels from one of the shipwrecks, but a distant voice tells him to return the treasure and leave the mist. Usopp believes the voices to be ghosts, but they actually originate from a group of children who call themselves the Pumpkin Pirates. In his youth, Henzo was a member of this group, and they are the reason for his research. He spent his life in search of a means to rescue them from the Rainbow Mist. Only a short time earlier from their point of view, but fifty years earlier from Henzo's perspective, a group of pirates, led by a Captain Whetton, attacked the children's town. When Whetton came after the children, they tried to escape by stealing the pirates' ship. During the fight, Whetton smashed the ship's helm, and Henzo jumped overboard, taking Whetton with him, while the other children sailed into the mist.",
    "tf_idf_text": "wrecker reefresidents land eternity pumpkin piratestransliteration eien kuni jnin panpukin kaizoku dan japanese munehisa sakai ryta yamaguchi january august inside mist luffy group discover largeship graveyard luffy salvage chest fill gold jewel one shipwreck distant voice tell return treasure leave mist usopp believe voice ghost actually originate group child call pumpkin pirate youth henzo member group reason research spend life search mean rescue rainbow mist short time earlier point view fifty year earlier henzos perspective group pirate lead captain whetton attack childrens town whetton come child try escape steal pirate ship fight whetton smash ship helm henzo jump overboard take whetton child sail mist"
}