{
    "title": "141 102 11 \"No Way Out\"\"Thoughts of Home! The Pirate Graveyard of No Escape!\"Transliteration: \"Kokyū e no Omoi! Dasshutsu Funō no Kaizoku Hakaba!\" (Japanese:故郷への想い! 脱出不能の海賊墓場!) Ken Koyama Ryōta Yamaguchi January 19, 2003(2003-01-19)[33] September 1, 2007[34][35]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_5",
    "transformers_text": "141 102 11 \"No Way Out\"\"Thoughts of Home! The Pirate Graveyard of No Escape!\"Transliteration: \"Kokyū e no Omoi! Dasshutsu Funō no Kaizoku Hakaba!\" (Japanese:故郷への想い! 脱出不能の海賊墓場!) Ken Koyama Ryōta Yamaguchi January 19, 2003(2003-01-19)[33] September 1, 2007[34][35]\n\nAfter entering the Rainbow Mist, the children followed the orders of Ian, the only pirate left on the ship. He mistreated them and they eventually locked him up in thebrigof the wreck of a navy ship. Luffy and his group try to escape the mist, but they soon realize that they need help. The Straw Hats persuade one of the children to lead them to the Pumpkin Pirates' hiding place so they can ask them for a way out. Usopp prepares a steaming meal, which causes most of the children to like the Straw Hats; however, their leader, Lapanui, remains suspicious and unwilling to help. Henzo'stransponder snailrings and the son of Whetton wants Henzo to investigate the mist, not knowing that the professor is already inside the mist. When Lapanui hears Whetton's name, he loses what little trust he has for Henzo.",
    "tf_idf_text": "way outthoughts home pirate graveyard escapetransliteration koky omoi dasshutsu fun kaizoku hakaba japanese ken koyama ryta yamaguchi january september enter rainbow mist child follow order ian pirate leave ship mistreat eventually lock thebrigof wreck navy ship luffy group try escape mist soon realize need help straw hat persuade one child lead pumpkin pirate hide place ask way usopp prepares steam meal cause child like straw hat however leader lapanui remain suspicious unwilling help henzostransponder snailrings son whetton want henzo investigate mist not know professor already inside mist lapanui hears whettons name lose little trust henzo"
}