{
    "title": "141 102 11 \"No Way Out\"\"Thoughts of Home! The Pirate Graveyard of No Escape!\"Transliteration: \"Kokyū e no Omoi! Dasshutsu Funō no Kaizoku Hakaba!\" (Japanese:故郷への想い! 脱出不能の海賊墓場!) Ken Koyama Ryōta Yamaguchi January 19, 2003(2003-01-19)[33] September 1, 2007[34][35]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_5",
    "transformers_text": "141 102 11 No Way Out Thoughts of Home The Pirate Graveyard of No Escape Transliteration Kok y e no Omo i Das shuts u Fun no Kai z oku Haka ba Japanese Ken Koyama Ry ta Yamaguchi January 19 2003 2003 01 19 33 September 1 2007 34 35 After entering the Rainbow Mist the children followed the orders of Ian the only pirate left on the ship He mistreated them and they eventually locked him up in the brig of the wreck of a navy ship Luffy and his group try to escape the mist but they soon realize that they need help The Straw Hats persuade one of the children to lead them to the Pumpkin Pirates ' hiding place so they can ask them for a way out Us opp prepares a steaming meal which causes most of the children to like the Straw Hats however their leader Lapa nui remains suspicious and unwilling to help H enzo's transponder snail rings and the son of W hetton wants H enzo to investigate the mist not knowing that the professor is already inside the mist When Lapa nui hears W hetton's name he loses what little trust he has for H enzo",
    "tf_idf_text": "way thought home pirate graveyard escape transliteration kok omo da shut fun kai oku haka japanese ken koyama yamaguchi january september enter rainbow mist child follow order ian pirate leave ship mistreat eventually lock brig wreck navy ship luffy group try escape mist soon realize need help straw hat persuade one child lead pumpkin pirate hide place ask way opp prepares steam meal cause child like straw hat however leader lapa nui remain suspicious unwilling help enzos transponder snail ring son hetton want enzo investigate mist not know professor already inside mist lapa nui hears hettons name lose little trust enzo"
}