{
    "title": "142 103 12 \"Into The Mist\"\"An Inevitable Melee! Wetton's Schemes and the Rainbow Tower!\"Transliteration: \"Ransen Hissu! Uetton no Yabō to Niji no Tō\" (Japanese:乱戦必死! ウエットンの野望と虹の塔) Yuji Endo Ryōta Yamaguchi January 26, 2003(2003-01-26)[36] September 15, 2007[37]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_5",
    "transformers_text": "142 103 12 \"Into The Mist\"\"An Inevitable Melee! Wetton's Schemes and the Rainbow Tower!\"Transliteration: \"Ransen Hissu! Uetton no Yabō to Niji no Tō\" (Japanese:乱戦必死! ウエットンの野望と虹の塔) Yuji Endo Ryōta Yamaguchi January 26, 2003(2003-01-26)[36] September 15, 2007[37]\n\nLapanui accuses Henzo of being Whetton's lapdog and says that in the past, Henzo would have never allowed that to happen. Usopp tells Lapanui that Henzo had endured the same insults from the townspeople yet still tried to rescue the children. Then, for no apparent reason, Luffy slingshots himself and Lapanui to another part of the mist. At the harbor, Nami ties a long lifeline, prepared by Henzo, to a boat and enters the Rainbow Mist. Once inside, Ian, who convinced one of the children to release him, steals the boat and escapes. He reaches Whetton and describes to him the mist's treasures. Whetton orders his men to invade the mist. The town's large tower falls into the water, creating a bridge from the island into the mist, and Whetton and his men cross it to attack.",
    "tf_idf_text": "mistan inevitable melee wettons scheme rainbow towertransliteration ransen hissu uetton yab niji japanese yuji endo ryta yamaguchi january september lapanui accuse henzo whettons lapdog say past henzo would never allow happen usopp tell lapanui henzo endure insult townspeople yet still try rescue child apparent reason luffy slingshot lapanui another part mist harbor nami tie long lifeline prepare henzo boat enters rainbow mist inside ian convince one child release steal boat escape reach whetton describes mist treasure whetton order men invade mist town large tower fall water create bridge island mist whetton men cross attack"
}