{
    "title": "142 103 12 \"Into The Mist\"\"An Inevitable Melee! Wetton's Schemes and the Rainbow Tower!\"Transliteration: \"Ransen Hissu! Uetton no Yabō to Niji no Tō\" (Japanese:乱戦必死! ウエットンの野望と虹の塔) Yuji Endo Ryōta Yamaguchi January 26, 2003(2003-01-26)[36] September 15, 2007[37]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_5",
    "transformers_text": "142 103 12 Into The Mist An Inevitable Melee Wet ton's Schemes and the Rainbow Tower Transliteration Ran sen His su U ett on no Ya b to N iji no T Japanese Yuji Endo Ry ta Yamaguchi January 26 2003 2003 01 26 36 September 15 2007 37 Lapa nui accuses H enzo of being W hetton's lap dog and says that in the past H enzo would have never allowed that to happen Us opp tells Lapa nui that H enzo had endured the same insults from the townspeople yet still tried to rescue the children Then for no apparent reason Luffy slingshots himself and Lapa nui to another part of the mist At the harbor Nami ties a long lifeline prepared by H enzo to a boat and enters the Rainbow Mist Once inside Ian who convinced one of the children to release him steals the boat and escapes He reaches W hetton and describes to him the mist's treasures W hetton orders his men to invade the mist The town's large tower falls into the water creating a bridge from the island into the mist and W hetton and his men cross it to attack",
    "tf_idf_text": "mist inevitable melee wet ton scheme rainbow tower transliteration run sen ett iji japanese yuji endo yamaguchi january september lapa nui accuses enzo hettons lap dog say past enzo would never allow happen opp tell lapa nui enzo endure insult townspeople yet still try rescue child apparent reason luffy slingshot lapa nui another part mist harbor nami tie long lifeline prepare enzo boat enters rainbow mist inside ian convince one child release steal boat escape reach hetton describes mist treasure hetton order men invade mist town large tower fall water create bridge island mist hetton men cross attack"
}