{
    "title": "143 104 13 \"The Great Escape!\"\"And so, the Legend Begins! To the Other Side of the Rainbow!\"Transliteration: \"Soshite Densetsu ga Hajimaru! Iza Niji no Kanata e\" (Japanese:そして伝説が始まる! いざ虹の彼方へ) Directed by: Junichi FujiseStoryboarded by: Junji Shimizu Ryōta Yamaguchi February 2, 2003(2003-02-02)[38] September 22, 2007[39][40]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_5",
    "transformers_text": "143 104 13 \"The Great Escape!\"\"And so, the Legend Begins! To the Other Side of the Rainbow!\"Transliteration: \"Soshite Densetsu ga Hajimaru! Iza Niji no Kanata e\" (Japanese:そして伝説が始まる! いざ虹の彼方へ) Directed by: Junichi FujiseStoryboarded by: Junji Shimizu Ryōta Yamaguchi February 2, 2003(2003-02-02)[38] September 22, 2007[39][40]\n\nLuffy and Lapanui are outside the mist and use the newly created bridge to reenter it. There, Luffy fights Whetton and, as it becomes clear that he cannot defeat Luffy face-to-face, Whetton detonates the tower, trapping everyone else inside and Whetton's abandoned men join forces with Luffy's group. An exit appears in the distance and they row toward it, but it closes too fast for them to reach it. Hoping to generate enough wind to blow the Straw Hats' ship clear of the mist, Lapanui stays behind to destroy the navy ship's armory. The other children follow him, promising to meet Henzo again. The explosion they cause successfully blows the Straw Hats' ship outside the mist. There, a group of navy ships, led by an aged Lapanui, arrives and confiscates the Rainbow Mist's treasures from Whetton and takes him and his men into custody.",
    "tf_idf_text": "great escapeand legend begin side rainbowtransliteration soshite densetsu hajimaru iza niji kanata japanese direct junichi fujisestoryboarded junji shimizu ryta yamaguchi february september luffy lapanui outside mist use newly create bridge reenter luffy fight whetton become clear cannot defeat luffy facetoface whetton detonate tower trap everyone else inside whettons abandon men join force luffys group exit appear distance row toward close fast reach hop generate enough wind blow straw hat ship clear mist lapanui stay behind destroy navy ship armory child follow promise meet henzo explosion cause successfully blow straw hat ship outside mist group navy ship lead age lapanui arrive confiscates rainbow mist treasure whetton take men custody"
}