{
    "title": "143 104 13 \"The Great Escape!\"\"And so, the Legend Begins! To the Other Side of the Rainbow!\"Transliteration: \"Soshite Densetsu ga Hajimaru! Iza Niji no Kanata e\" (Japanese:そして伝説が始まる! いざ虹の彼方へ) Directed by: Junichi FujiseStoryboarded by: Junji Shimizu Ryōta Yamaguchi February 2, 2003(2003-02-02)[38] September 22, 2007[39][40]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_5",
    "transformers_text": "143 104 13 The Great Escape And so the Legend Begins To the Other Side of the Rainbow Transliteration So shite Dense tsu ga Haji maru Iz a N iji no Kanata e Japanese Directed by Junichi Fuji se Story boarded by Junji Shimizu Ry ta Yamaguchi February 2 2003 2003 02 02 38 September 22 2007 39 40 Luffy and Lapa nui are outside the mist and use the newly created bridge to reenter it There Luffy fights W hetton and as it becomes clear that he cannot defeat Luffy face to face W hetton detonates the tower trapping everyone else inside and W hetton's abandoned men join forces with Luffy's group An exit appears in the distance and they row toward it but it closes too fast for them to reach it Hoping to generate enough wind to blow the Straw Hats ' ship clear of the mist Lapa nui stays behind to destroy the navy ship's armory The other children follow him promising to meet H enzo again The explosion they cause successfully blows the Straw Hats ' ship outside the mist There a group of navy ships led by an aged Lapa nui arrives and confiscates the Rainbow Mist's treasures from W hetton and takes him and his men into custody",
    "tf_idf_text": "great escape legend begin side rainbow transliteration shite dense tsu haji maru iji kanata japanese direct junichi fuji story board junji shimizu yamaguchi february september luffy lapa nui outside mist use newly create bridge reenter luffy fight hetton become clear cannot defeat luffy face face hetton detonates tower trap everyone else inside hettons abandon men join force luffys group exit appear distance row toward close fast reach hop generate enough wind blow straw hat ship clear mist lapa nui stay behind destroy navy ship armory child follow promise meet enzo explosion cause successfully blow straw hat ship outside mist group navy ship lead age lapa nui arrive confiscates rainbow mist treasure hetton take men custody"
}