{
    "title": "en.wikipedia.org_wiki_War_Memorial_of_Korea",
    "url": "https://en.wikipedia.org/wiki/War_Memorial_of_Korea",
    "transformers_text": "The War Memorial of Korea ( Korean : 전쟁기념관 ) is a museum located in Yongsan-dong , Yongsan-gu , Seoul , South Korea . It opened in 1994 on the former site of the army headquarters to exhibit and memorialize the military history of Korea . It was built for the purpose of preventing war through lessons from the Korean War and for the hoped for peaceful reunification of North and South Korea. The memorial building has six indoor exhibition rooms and an outdoor exhibition centre displaying war memorabilia and military equipment from China, South Korea and the United States. [ 2 ]\n\nThe War Memorial covers the history of Korean War which took place from June 25, 1950, to July 27, 1953. [ 3 ]\n\nThe construction of the War Memorial of Korea was completed in December 1993. The project was carried out in consultation with military experts while collecting a wide range of exhibition items from at home and abroad. Upon the completion of the interior, the memorial opened officially on June 10, 1994, and became the largest landmark of its kind in the world. [ citation needed ]\n\nLocated on the old site of Army Headquarters, the War Memorial of Korea has three above-ground floors of exhibits. [ 3 ] It also has two underground floors in the main building, which stands on an area of about 20,000 m 2 (220,000 sq ft).\n\nIn cloistered left and right galleries, flanking the facade of the main building, are rows of black marble monuments inscribed with the names of those who died during the Korean War , Vietnam War , clashes with North Korea since the Korean War and of policemen who died on duty. The plaza in the museum compound has an artificial waterfall , and around it are widespread rest areas so that visitors can picnic while enjoying the pleasant landscape. In the center of the plaza stands the Statue of Brothers , the elder a South Korean soldier and the younger a North Korean soldier, which symbolizes the situation of Korea's division .\n\n6,300 items are displayed in seven halls and an outdoor exhibition area. There is a Memorial Hall, War History Room, Korean War Room, Expeditionary Forces Room, ROK Armed Forces Room, Exhibition Hall for Donated Artifacts, and Exhibition of Large Military Equipments. [ 3 ]\n\nThe exhibitions show weapons and equipment from prehistoric times to the modern period, [ 4 ] as well as depictions of notable military and militant figures. About 100 large weapons are displayed in the outside exhibition area on the lawns around the building.\n\nUpon entering the memorial halls, this English text is inscribed:\n\nInscribed on this memorial are the names of the Republic of Korea Armed Forces Soldiers and Policemen killed in the Armed Forces Activation, Korean War, Vietnam War and Counter Infiltration Operation and the United Nations Forces Soldiers killed in the Korean War.\n\nObjects on display inside include:\n\nItems on display include:\n\nFixed-wing aircraft:\n\nHelicopters\n\nArmored Vehicles:\n\nArtillery and Anti-Aircraft Guns:\n\nMissiles:\n\nVessels:\n\n37°32′11″N 126°58′38″E ﻿ / ﻿ 37.5365°N 126.9771°E ﻿ / 37.5365; 126.9771",
    "tf_idf_text": "war memorial korea korean museum locate yongsandong yongsangu seoul south korea open former site army headquarters exhibit memorialize military history korea build purpose prevent war lesson korean war hop peaceful reunification north south korea memorial building six indoor exhibition room outdoor exhibition centre display war memorabilia military equipment china south korea united state war memorial cover history korean war take place june july construction war memorial korea complete december project carry consultation military expert collect wide range exhibition item home abroad upon completion interior memorial open officially june become large landmark kind world citation need locate old site army headquarters war memorial korea three aboveground floor exhibit also two underground floor main building stand area cloister leave right gallery flank facade main building row black marble monument inscribe names died korean war vietnam war clash north korea since korean war policeman die duty plaza museum compound artificial waterfall around widespread rest area visitor picnic enjoy pleasant landscape center plaza stand statue brother elder south korean soldier young north korean soldier symbolize situation korea division item display seven hall outdoor exhibition area memorial hall war history room korean war room expeditionary force room rok arm force room exhibition hall donate artifact exhibition large military equipment exhibition show weapon equipment prehistoric time modern period well depiction notable military militant figure large weapon display outside exhibition area lawns around build upon enter memorial hall english text inscribe inscribed memorial name republic korea arm force soldier policeman kill armed force activation korean war vietnam war counter infiltration operation united nation force soldier kill korean war object display inside include item display include fixedwing aircraft helicopter armor vehicle artillery antiaircraft gun missile vessel"
}