{
    "title": "en.wikipedia.org_wiki_ComicsAlliance",
    "url": "https://en.wikipedia.org/wiki/ComicsAlliance",
    "transformers_text": "ComicsAlliance is an American website dedicated to covering the comic book industry as well as comic-related media, and is owned by Townsquare Media . [ 1 ] [ 2 ] It was nominated for multiple awards, winning an Eisner Award in 2015 for Best Comics Periodical/Journalism.\n\nComicsAlliance was established in 2007 as part of an online network of sites owned by AOL , and run by editors-in-chief John Anderson and Chris Dooley. [ 3 ] The site featured writing from critics including David Brothers, Andy Khouri, Caleb Goellner and Chris Sims. Laura Hudson became the editor-in-chief in 2009. In 2012 Hudson left the site, with former Vertigo Comics editor Joe Hughes later announced as the new editor-in-chief. [ 4 ]\n\nOn April 26, 2013, ComicsAlliance and the AOL Music properties were abruptly shut down. [ 5 ] On June 2, 2013, AOL sold ComicsAlliance and several of the AOL Music blogs to Townsquare Media , [ 6 ] with editors Joe Hughes, Andy Khouri, and Caleb Goellner remaining in position on the site.\n\nIn 2015 the site was the recipient of an Eisner Award in the category Best Comics Periodical/Journalism. [ 7 ]\n\nIn April 2017, ComicsAlliance was placed on hiatus by Townsquare Media and the most recent editorial staff was dissolved. [ 8 ] [ better source needed ]\n\nIn July 2021, Comics Alliance had new content posted on its site and social media accounts but there was no new content published since then.\n\nThe longest-running column on the site is Ask Chris, written by Chris Sims, which has run on the site since 2010. [ 9 ] In 2011, Sims was featured on The Daily Show as part of a feature on the Batman comics series, credited as a 'Batmanologist'. [ 10 ] Additional features of note for the site have included Kate or Die , a regular comic from cartoonist Kate Leth ; as well as Best Art Ever (This Week), a weekly feature showcasing new comics-related art. The podcasts War Rocket Ajax and The Arkham Sessions have both been serialised on the site.",
    "tf_idf_text": "comicsalliance american website dedicate cover comic book industry well comicrelated medium own townsquare medium nominate multiple award win eisner award best comic periodicaljournalism comicsalliance establish part online network site own aol run editorsinchief john anderson chris dooley site feature write critic include david brother andy khouri caleb goellner chris sims laura hudson become editorinchief hudson leave site former vertigo comic editor joe hughes later announce new editorinchief april comicsalliance aol music property abruptly shut june aol sell comicsalliance several aol music blog townsquare medium editor joe hughes andy khouri caleb goellner remain position site site recipient eisner award category best comic periodicaljournalism april comicsalliance place hiatus townsquare medium recent editorial staff dissolve well source need july comic alliance new content post site social medium account new content publish since longestrunning column site ask chris write chris sims run site since sims feature daily show part feature batman comic series credit batmanologist additional feature note site include kate die regular comic cartoonist kate leth well best art ever week weekly feature showcasing new comicsrelated art podcasts war rocket ajax arkham session serialise site"
}