{
    "title": "en.wikipedia.org_wiki_ISSN_(identifier)",
    "url": "https://en.wikipedia.org/wiki/ISSN_(identifier)",
    "transformers_text": "An International Standard Serial Number ( ISSN ) is an eight-digit code to uniquely identify a periodical publication (periodical), such as a magazine. [ 1 ] The ISSN is especially helpful in distinguishing between serials with the same title. ISSNs are used in ordering, cataloging, interlibrary loans, and other practices in connection with serial literature. [ 2 ]\n\nThe ISSN system was first drafted as an International Organization for Standardization (ISO) international standard in 1971 and published as ISO 3297 in 1975. [ 3 ] ISO subcommittee TC 46/SC 9 is responsible for maintaining the standard.\n\nWhen a serial with the same content is published in more than one media type , a different ISSN is assigned to each media type. For example, many serials are published both in print and electronic media . The ISSN system refers to these types as print ISSN ( p-ISSN ) and electronic ISSN ( e-ISSN ). [ 4 ] Consequently, as defined in ISO 3297:2007, every serial in the ISSN system is also assigned a linking ISSN ( ISSN-L ), typically the same as the ISSN assigned to the serial in its first published medium, which links together all ISSNs assigned to the serial in every medium. [ 5 ]\n\nAn ISSN is an eight-digit code, divided by a hyphen into two four-digit numbers. [ 1 ] The last digit, which may be zero through nine or an X, is a check digit , so the ISSN is uniquely represented by its first seven digits. Formally, the general form of the ISSN (also named \"ISSN structure\" or \"ISSN syntax\") can be expressed as follows: [ 6 ]\n\nwhere N is in the set { 0,1,2,...,9 }, a decimal digit character, and C is in { 0,1,2,...,9,X }; or by a Perl Compatible Regular Expressions (PCRE) regular expression :\n\nFor example, the ISSN of the journal Hearing Research , is 0378-5955, where the final 5 is the check digit, that is C =5. To calculate the check digit, the following algorithm may be used:\n\n0 ⋅ 8 + 3 ⋅ 7 + 7 ⋅ 6 + 8 ⋅ 5 + 5 ⋅ 4 + 9 ⋅ 3 + 5 ⋅ 2 = 0 + 21 + 42 + 40 + 20 + 27 + 10 = 160 . {\\displaystyle {\\begin{aligned}&0\\cdot 8+3\\cdot 7+7\\cdot 6+8\\cdot 5+5\\cdot 4+9\\cdot 3+5\\cdot 2\\\\&=0+21+42+40+20+27+10\\\\&=160\\;.\\end{aligned}}}\n\nThe remainder of this sum modulo 11 is then calculated: 160 11 = 14 remainder 6 = 14 + 6 11 {\\displaystyle {\\frac {160}{11}}=14{\\mbox{ remainder }}6=14+{\\frac {6}{11}}}\n\nIf there is no remainder, the check digit is 0; otherwise the remainder is subtracted from 11. If the result is less than 10, it yields the check digit: 11 − 6 = 5 . {\\displaystyle 11-6=5\\;.} Thus, in this example, the check digit C is 5.\n\nTo confirm the check digit, calculate the sum of all eight digits of the ISSN multiplied by their position in the number, counting from the right. (If the check digit is X, add 10 to the sum.) The remainder of the sum modulo 11 must be 0. There is an online ISSN checker that can validate an ISSN, based on the above algorithm. [ citation needed ]\n\nISSNs can be encoded in EAN-13 bar codes with a 977 \"country code\" (compare the 978 \" bookland \" country code for ISBNs ), followed by the 7 main digits of the ISSN (the check digit is not included), followed by 2 publisher-defined digits, followed by the EAN check digit (in most cases, this will not match the ISSN check digit, since they are each calculated in a different way). [ 7 ]\n\nISSN codes are assigned by a network of ISSN National Centres, usually located at national libraries and coordinated by the ISSN International Centre (CIEPS [ 8 ] ) based in Paris . The International Centre is an intergovernmental organization created in 1974 through an agreement between UNESCO and the French government.\n\nISSN-L is a unique identifier for all versions of the serial containing the same content across different media. As defined by ISO 3297:2007 , the \"linking ISSN (ISSN-L)\" provides a mechanism for collocation or linking among the different media versions of the same continuing resource. The ISSN-L is one of a serial's existing ISSNs, so does not change the use or assignment of \"ordinary\" ISSNs; [ 9 ] it is based on the ISSN of the first published medium version of the publication. If the print and online versions of the publication are published at the same time, the ISSN of the print version is chosen as the basis of the ISSN-L .\n\nWith ISSN-L is possible to designate one single ISSN for all those media versions of the title. The use of ISSN-L facilitates search, retrieval and delivery across all media versions for services like OpenURL , library catalogues , search engines or knowledge bases .\n\nThe International Centre maintains a database of all ISSNs assigned worldwide, the ISDS Register (International Serials Data System), otherwise known as the ISSN Register . At the end of 2016, [update] the ISSN Register contained records for 1,943,572 items. [ 10 ] The Register is not freely available for interrogation on the web, but is available by subscription.\n\nISSN and ISBN codes are similar in concept, where ISBNs are assigned to individual books . An ISBN might be assigned for particular issues of a serial, in addition to the ISSN code for the serial as a whole. An ISSN, unlike the ISBN code, is an anonymous identifier associated with a serial title, containing no information as to the publisher or its location . For this reason a new ISSN is assigned to a serial each time it undergoes a major title change.\n\nSince the ISSN applies to an entire serial, other identifiers have been built on top of it to allow references to specific volumes, articles, or other identifiable components (like the table of contents ): the Publisher Item Identifier (PII) and the Serial Item and Contribution Identifier (SICI).\n\nSeparate ISSNs are needed for serials in different media (except reproduction microforms ). Thus, the print and electronic media versions of a serial need separate ISSNs, [ 11 ] and CD-ROM versions and web versions require different ISSNs. However, the same ISSN can be used for different file formats (e.g. PDF and HTML ) of the same online serial.\n\nThis \"media-oriented identification\" of serials made sense in the 1970s. In the 1990s and onward, with personal computers, better screens, and the Web, it makes sense to consider only content , independent of media. This \"content-oriented identification\" of serials was a repressed demand during a decade, but no ISSN update or initiative occurred. A natural extension for ISSN, the unique-identification of the articles in the serials, was the main demand application. An alternative serials' contents model arrived with the indecs Content Model and its application, the digital object identifier (DOI), an ISSN-independent initiative, consolidated in the 2000s.\n\nOnly later, in 2007, ISSN-L was defined in the new ISSN standard (ISO 3297:2007) as an \"ISSN designated by the ISSN Network to enable collocation or versions of a continuing resource linking among the different media\". [ 12 ]\n\nAn ISSN can be encoded as a uniform resource name (URN) by prefixing it with \" urn:ISSN: \". [ 6 ] For example, Rail could be referred to as \" urn:ISSN:0953-4563 \". URN namespaces are case-sensitive, and the ISSN namespace is all caps. [ 13 ] If the checksum digit is \"X\" then it is always encoded in uppercase in a URN.\n\nThe URNs are content-oriented , but ISSN is media-oriented:\n\nA unique URN for serials simplifies the search, recovery and delivery of data for various services including, in particular, search systems and knowledge databases . [ 12 ] ISSN-L (see Linking ISSN above) was created to fill this gap.\n\nThe two standard categories of media in which serials are most available are print and electronic . In metadata contexts (e.g., JATS ), these may have standard labels.\n\np-ISSN is a standard label for \"Print ISSN\", the ISSN for the print media (paper) version of a serial. Usually it is the \"default media\" and so the \"default ISSN\".\n\ne-ISSN (or eISSN ) is a standard label for \"Electronic ISSN\", the ISSN for the electronic media (online) version of a serial. [ 15 ]",
    "tf_idf_text": "international standard serial number issn eightdigit code uniquely identify periodical publication periodical magazine issn especially helpful distinguish serial title issns use order catalog interlibrary loan practice connection serial literature issn system first draft international organization standardization iso international standard publish iso iso subcommittee responsible maintain standard serial content publish one medium type different issn assign medium type example many serial publish print electronic medium issn system refers type print issn pissn electronic issn eissn consequently define iso every serial issn system also assign link issn issnl typically issn assign serial first publish medium link together issns assign serial every medium issn eightdigit code divide hyphen two fourdigit number last digit may zero nine check digit issn uniquely represent first seven digit formally general form issn also name issn structure issn syntax express follow set decimal digit character perl compatible regular expression pcre regular expression example issn journal hearing research final check digit calculate check digit follow algorithm may use displaystyle beginalignedcdot cdot cdot cdot cdot cdot cdot endaligned remainder sum modulo calculate remainder displaystyle frac mbox remainder frac remainder check digit otherwise remainder subtract result less yield check digit displaystyle thus example check digit confirm check digit calculate sum eight digit issn multiply position number count right check digit add sum remainder sum modulo must online issn checker validate issn base algorithm citation need issns encode ean bar code country code compare bookland country code isbns follow main digit issn check digit not include follow publisherdefined digit follow ean check digit case not match issn check digit since calculate different way issn code assign network issn national centre usually locate national library coordinate issn international centre cieps base paris international centre intergovernmental organization create agreement unesco french government issnl unique identifier version serial contain content across different medium define iso link issn issnl provide mechanism collocation link among different medium version continue resource issnl one serials exist issns not change use assignment ordinary issns base issn first publish medium version publication print online version publication publish time issn print version choose basis issnl issnl possible designate one single issn medium version title use issnl facilitate search retrieval delivery across medium version service like openurl library catalogue search engine knowledge base international centre maintain database issns assign worldwide isds register international serial data system otherwise know issn register end update issn register contain record item register not freely available interrogation web available subscription issn isbn code similar concept isbns assign individual book isbn might assign particular issue serial addition issn code serial whole issn unlike isbn code anonymous identifier associate serial title contain information publisher location reason new issn assign serial time undergoes major title change since issn applies entire serial identifier build top allow reference specific volume article identifiable component like table content publisher item identifier pii serial item contribution identifier sici separate issns need serial different medium except reproduction microforms thus print electronic medium version serial need separate issns cdrom version web version require different issns however issn used different file format pdf html online serial mediaoriented identification serial make sense onward personal computer well screen web make sense consider content independent medium contentoriented identification serial repress demand decade issn update initiative occur natural extension issn uniqueidentification article serial main demand application alternative serial content model arrive indecs content model application digital object identifier doi issnindependent initiative consolidate later issnl define new issn standard iso issn designate issn network enable collocation version continue resource link among different medium issn encode uniform resource name urn prefix urnissn example rail could refer urnissn urn namespaces casesensitive issn namespace cap checksum digit always encode uppercase urn urn contentoriented issn mediaoriented unique urn serial simplifies search recovery delivery data various service include particular search system knowledge databases issnl see link issn create fill gap two standard category medium serial available print electronic metadata context jat may standard label pissn standard label print issn issn print medium paper version serial usually default medium default issn eissn eissn standard label electronic issn issn electronic medium online version serial"
}