{
    "title": "en.wikipedia.org_wiki_Share_the_World___We_Are!",
    "url": "https://en.wikipedia.org/wiki/Share_the_World_/_We_Are!",
    "transformers_text": "\" Share the World / We Are! \" ( ウィーアー! ) is Korean boy band Tohoshinki 's twenty-seventh Japanese single and was released on April 22, 2009 by Rhythm Zone . This is their sixth number one single in Japan, extending the record they set back in earlier in the year with \" Bolero/Kiss the Baby Sky/Wasurenaide \". The single has been labeled as a \" One Piece single\" since all three songs on the single at some point have been used as a theme song for the anime One Piece . [ 1 ]\n\n\"Share the World / We Are!\" was released nearly a month after the release of their fourth Japanese studio album The Secret Code . \"We Are! (Animation One Piece 10th Anniversary Ver.)\" was used as the opening theme for anime series One Piece from episodes 373 to 394. \"We Are!\" is a cover of the first opening by Hiroshi Kitadani . \"Share the World\" took the place of \"We Are!\" as the opening theme of the series. The single debuted at number one on the Oricon charts giving the group their sixth number one single which extends their record making them the first foreign artist to have six number one singles in Japan. [ 2 ] The bonus track \"Asu wa Kuru Kara\" ( 明日は来るから , lit. Because Tomorrow Will Come ) , which was released in 2006, was used as the ending theme for the eighth and half of the ninth season of One Piece .\n\nThe music video was shot by Tsuyoshi Inoue ( 井上強 , Inoue Tsuyoshi ) . [ 3 ] The video begins with Hero dusting off a book and proceeds to open it. The members appear on a wasteland where the weather changes from sunny to rainy, when the first verse begins. At the start of the chorus the scene switches to a white background and near the end the wasteland fills with water and Hero emerges from it. At the start of the second chorus they are swimming under water and near the end of the video they are flying in the sky. In the end camera zooms out and shows the globe and reveals the title of the book, Share the World .",
    "tf_idf_text": "share world korean boy band tohoshinki twentyseventh japanese single release april rhythm zone sixth number one single japan extending record set back earlier year bolerokiss baby skywasurenaide single label one piece single since three song single point use theme song anime one piece share world release nearly month release fourth japanese studio album secret code animation one piece anniversary ver use open theme anime series one piece episodes cover first open hiroshi kitadani share world take place opening theme series single debut number one oricon chart give group sixth number one single extend record make first foreign artist six number one single japan bonus track asu kuru kara lit tomorrow come release used end theme eighth half ninth season one piece music video shot tsuyoshi inoue inoue tsuyoshi video begin hero dust book proceeds open member appear wasteland weather change sunny rainy first verse begin start chorus scene switch white background near end wasteland fill water hero emerge start second chorus swim water near end video fly sky end camera zoom show globe reveals title book share world"
}