{
    "title": "\"Long Long a Go Go\"",
    "url": "https://en.wikipedia.org/wiki/Witch_Watch",
    "transformers_text": "\"Long Long a Go Go\" \"We Got Trapped in a Death Game, but It Sucked\" : Morihito, Kanshi, Keigo, and Miharu wake up to find themselves trapped in a death game by a man named Jig-Jag, who is holding Nico hostage. However, the boys discover that Jig-Jag's rules for his game, \"Ouroboros\", are not actually very good and they start revising them. Morihito then explains he figured out Jig-Jag is actually Keigo, and the Keigo with them is a Doppelganger created by Nico, who is his accomplice. Keigo admits he wanted to make a viral video, but the video of his friends fixing his game goes viral anyway. \"Long Long a Go Go\" : During a meeting, Tenryu informs Morihito and his friends that the school faculty is considering classifying them as \"dangerous students\" due to their supernatural powers. However, various parts of their bodies suddenly grow in length due to Nico miscasting a Enlongen spell. While attempting to sneak back to Morihito's home, they end up saving a man's life. Impressed that Morihito and his friends are willing to help others, Tenryu decides to take no further action against them. Nico then tries to dispel Enlongen, only to accidentally miscast it again.",
    "tf_idf_text": "long long get trap death game suck morihito kanshi keigo miharu wake find trap death game man name jigjag hold nico hostage however boys discover jigjags rule game ouroboros not actually good start revise morihito explains figure jigjag actually keigo keigo doppelganger create nico accomplice keigo admits want make viral video video friends fixing game go viral anyway long long meeting tenryu informs morihito friend school faculty consider classify dangerous student due supernatural power however various part body suddenly grow length due nico miscast enlongen spell attempt sneak back morihitos home end save man life impress morihito friend willing help others tenryu decides take action nico try dispel enlongen accidentally miscast"
}