{
    "title": "en.wikipedia.org_wiki_International_Association_of_Amusement_Parks_an_c1bf1f9576",
    "url": "https://en.wikipedia.org/wiki/International_Association_of_Amusement_Parks_and_Attractions",
    "transformers_text": "The International Association of Amusement Parks and Attractions ( IAAPA ) represents over 6,000 amusement-industry members in more than 100 countries worldwide and operates several global attractions-industry trade shows. Its annual IAAPA Expo in Orlando, Florida , is recognized as the world's largest attractions trade show in the number of attendees and exhibitors and providing members insight into current amusement trends, laws, operations and industry methodology. [ 4 ] [ 5 ] IAAPA also helps to promote guest-safety and ride-safety guidelines in conjunction with ASTM International and assists its members to uphold the highest amusement-industry safety and professional standards.\n\nIAAPA represents a variety of location-based entertainment facilities, including amusement and theme parks, family entertainment centers, arcades , museums , water parks , aquariums , science centers , zoos , and resorts . It also represents industry equipment manufacturers, distributors, operators, industry suppliers, and service providers.\n\nIn 1976, Aaron Fechter brought the first full animated show to the convention.\n\nIn 1990, IAAPA established an international council in expand its global reach and give advice and direction about programs and services for members outside the United States. The council and its operations committee were instrumental in recruiting international members and developing quality products and services. IAAPA also established the IAAPA Hall of Fame, with amusement-industry pioneers its first class of inductees.\n\nThe following year, the 73rd annual convention and trade show in Orlando, Florida had over 19,000 attendees. The IAAPA Expo was the largest amusement-industry exhibition in the world, offering trends in amusement and arcade equipment, food, beverage, park technology and entertainment.\n\nIn 2000 the association worked to counter negative publicity following high-profile amusement-ride incidents and surrounding amusement safety, publicizing the industry's overall safety record. It established a ride-incident reporting system for its U.S. facilities with rides (releasing the initial results in 2003 through the National Safety Council ), and helped facilitate independent scientific reviews of ride forces in 2002-03 indicating the inherent safety of rides for the general public. In 2000, IAAPA opened its first full-time overseas office (IAAPA Europe) in Brussels .\n\nThe organization acquired the Asian Amusement Expo (AAE) in 2003, but canceled the event because of the SARS outbreak in Asia. IAAPA maintained its focus on industry safety that year, establishing an international standards harmonization group to implement universal ride-safety criteria. In 2004, it helped spearhead the adoption of the ASTM International amusement-ride design and manufacture standard and the European standard for amusement machinery and structures.\n\nTwo years later, IAAPA joined the Travel Industry Association of America to produce \"The Economic Impact of Domestic and Overseas Travelers Who Visit Amusement/Theme Parks and Other Attractions in the United States\" on the importance of amusement, theme parks and other attractions to U.S. tourism and its wider economy. The association extended membership to casinos and resorts, since a number of facilities had incorporated amusement and entertainment features. To promote park safety, IAAPA made its ride incident reporting system mandatory for U.S. members and supported Europarks' efforts to implement a similar system for its members. IAAPA encouraged voluntary ride reporting by its global partners, supplying background materials.\n\nIn 2007 the association opened a new office in Europe with expanded programs and services and increased collaboration with Europarks on ride-safety reporting, and held its annual senior-level training program (the Institute for Executive Education) to the Wharton School of the University of Pennsylvania . At its Attractions Expo, the association unveiled its institute for emerging leaders (later renamed the Institute for Attractions Managers) to recruit candidates for senior-level positions.\n\nThe following year, IAAPA acquired the Euro Attractions Show (EAS). It held its first Middle East safety conference in Dubai in February, and had its inaugural Attractions Safety Awareness Week to enhance understanding of the industry's safety practices and record in June.\n\nIn 2010, the IAAPA Foundation was created as a 501(c)(3) organization to fund the development of education programs and information resources for the global attractions industry. The following year, the association implemented its certification program to help raise amusement-industry standards. Its Institute for Executive Education was revived in conjunction with San Diego State University , and IAAPA's first \"Latin America State of the Industry Report\" and \"European Manifesto\" were released. In September 2016, the association announced plans to move its headquarters from Alexandria, Virginia to Orlando in 2017 [ 6 ] [ 7 ] and to hold its expo in Orlando until 2030. [ 8 ] [ 9 ]\n\nDuring the COVID-19 pandemic , the themed entertainment industry faced significant new pressures. IAAPA was among a number of themed entertainment organizations whose members faced potential tens of billions in losses as a result. [ 10 ] As a result, IAAPA has asked the United States Congress to amend the Paycheck Protection Program to protect small businesses in the industry. [ 11 ] [ 12 ] The IAAPA Asia Expo had already been postponed by a year due to the pandemic, with the American expo presently [ when? ] staying on the books for November 2020. [ 13 ]\n\nFounded in 1918, IAAPA is the largest international trade association for permanent amusement facilities and attractions and is dedicated to the preservation and prosperity of the attractions industry. The association represents over 6,000 facility, supplier, and individual members in more than 100 countries. Member facilities include amusement and theme parks, water parks, attractions, family entertainment centers, zoos, aquariums, museums, science centers, and resorts. IAAPA is a nonprofit organization with its headquarters in Orlando, Florida and regional offices in Brussels, Mexico City , Hong Kong , and Shanghai . [ 14 ]\n\nThe association operates IAAPA Expo, IAAPA Expo Asia, and IAAPA Expo Europe. At each show, IAAPA offers educational, informational, operational, safety, and leadership seminars and behind-the-scenes tours of member amusement parks, theme parks, water parks, and family entertainment centers. IAAPA publishes Funworld the official magazine for members, keeps its global membership informed about current and pending federal, state and local amusement-related laws and legislation and publishes \"News Daily\", a daily e-newsletter with industry news stories from around the world.\n\nThe IAAPA Hall Of Fame was established in 1990 to celebrate achievements in and contributions to the growth and development of the amusement park and attractions industry. Its Service Awards honor members who excel in dedication to the association and the industry.\n\nIAAPA offers training in every aspect of the amusement-park and attractions industry and provides member facilities with opportunities to educate their personnel with workshops, on-site seminars, videotapes, manuals, webinars and services provided by institute programs, such as the IAAPA Institutes for Attractions Managers and Executive Education and the IAAPA Safety Institute. The association promotes amusement park safety standards to its members and maintains a partnership with the ASTM International to develop and update ride safety standards and maintenance requirements. IAAPA's advocacy department reaches out to governments in a number of countries, representing the industry in attraction and amusement-park legislation and regulations.",
    "tf_idf_text": "international association amusement park attraction iaapa represent amusementindustry member country worldwide operate several global attractionsindustry trade show annual iaapa expo orlando florida recognize world large attraction trade show number attendee exhibitor provide member insight current amusement trend law operation industry methodology iaapa also help promote guestsafety ridesafety guideline conjunction astm international assist member uphold high amusementindustry safety professional standard iaapa represent variety locationbased entertainment facility include amusement theme park family entertainment center arcades museum water park aquariums science center zoos resort also represent industry equipment manufacturer distributor operator industry supplier service provider aaron fechter bring first full animate show convention iaapa establish international council expand global reach give advice direction program service member outside united state council operation committee instrumental recruit international member develop quality product service iaapa also establish iaapa hall fame amusementindustry pioneer first class inductee follow year annual convention trade show orlando florida attendee iaapa expo large amusementindustry exhibition world offer trend amusement arcade equipment food beverage park technology entertainment association work counter negative publicity follow highprofile amusementride incident surround amusement safety publicize industrys overall safety record establish rideincident reporting system facility rid release initial result national safety council help facilitate independent scientific review ride force indicate inherent safety rid general public iaapa open first fulltime overseas office iaapa europe brussels organization acquire asian amusement expo aae cancel event sars outbreak asia iaapa maintain focus industry safety year establish international standard harmonization group implement universal ridesafety criterion help spearhead adoption astm international amusementride design manufacture standard european standard amusement machinery structure two year later iaapa join travel industry association america produce economic impact domestic overseas traveler visit amusementtheme park attraction united state importance amusement theme park attraction tourism wider economy association extend membership casino resort since number facility incorporate amusement entertainment feature promote park safety iaapa make ride incident reporting system mandatory member support europarks effort implement similar system member iaapa encouraged voluntary ride report global partner supply background material association open new office europe expand program service increase collaboration europarks ridesafety report hold annual seniorlevel train program institute executive education wharton school university pennsylvania attraction expo association unveil institute emerge leader later rename institute attraction manager recruit candidate seniorlevel position follow year iaapa acquire euro attraction show eas hold first middle east safety conference dubai february inaugural attraction safety awareness week enhance understanding industrys safety practice record june iaapa foundation create organization fund development education program information resource global attraction industry follow year association implement certification program help raise amusementindustry standard institute executive education revive conjunction san diego state university iaapas first latin america state industry report european manifesto release september association announce plan move headquarters alexandria virginia orlando hold expo orlando covid pandemic theme entertainment industry face significant new pressure iaapa among number theme entertainment organization whose member face potential ten billion loss result result iaapa ask united state congress amend paycheck protection program protect small business industry iaapa asia expo already postpone year due pandemic american expo presently stay book november found iaapa large international trade association permanent amusement facility attraction dedicate preservation prosperity attraction industry association represent facility supplier individual member country member facility include amusement theme park water park attraction family entertainment center zoos aquarium museum science center resort iaapa nonprofit organization headquarters orlando florida regional office brussels mexico city hong kong shanghai association operate iaapa expo iaapa expo asia iaapa expo europe show iaapa offer educational informational operational safety leadership seminar behindthescenes tour member amusement park theme park water park family entertainment center iaapa publishes funworld official magazine member keep global membership inform current pending federal state local amusementrelated law legislation publish news daily daily enewsletter industry news story around world iaapa hall fame establish celebrate achievement contribution growth development amusement park attraction industry service award honor member excel dedication association industry iaapa offer train every aspect amusementpark attraction industry provide member facility opportunity educate personnel workshop onsite seminar videotape manual webinars service provide institute program iaapa institute attraction manager executive education iaapa safety institute association promote amusement park safety standard member maintains partnership astm international develop update ride safety standard maintenance requirement iaapas advocacy department reach government number country represent industry attraction amusementpark legislation regulation"
}