{
    "title": "en.wikipedia.org_wiki_Nue%27s_Exorcist",
    "url": "https://en.wikipedia.org/wiki/Nue%27s_Exorcist",
    "transformers_text": "Nue's Exorcist ( Japanese : 鵺の陰陽師 , Hepburn : Nue no Onmyōji ) is a Japanese manga series written and illustrated by Kōta Kawae. It began serialization in Shueisha 's Weekly Shōnen Jump magazine in May 2023. As of November 2025, twelve tankōbon volumes have been released.\n\nEver since he was young, Gakuro Yajima has been able to see spirits, but is timid around them due to one malevolent spirit killing his father. One day, he meets Nue, a powerful spirit in the form of a young woman who lives in a secret room in his high school. After an event with a violent spirit causes Gakuro to be mortally wounded, he makes a contract with Nue where she lends him her power, but only on the condition that he help her vanquish evil spirits and work alongside local exorcists who are wary of her.\n\nWritten and illustrated by Kōta Kawae, the series began serialization in Shueisha 's Weekly Shōnen Jump magazine on May 15, 2023. [ 2 ] [ 3 ] As of November 2025, the series' individual chapters have been collected into twelve tankōbon volumes. [ 4 ]\n\nViz Media and Manga Plus are publishing the series in English simultaneously with its Japanese release. [ 5 ] In February 2024, Viz Media announced that it would publish the series as a digital exclusive, with the first volume being released on June 25, 2024. [ 6 ] [ 7 ] In October 2024, Viz Media announced a physical release, with the first volume being released on July 1, 2025. [ 8 ] [ 9 ]\n\nThese chapters have yet to be published in a tankōbon volume.\n\nA café collaboration with Nue's Exorcist at Bandai Namco Cross Store Tokyo was announced on May 27, 2024. [ 26 ] The café booth was held from July 4 to August 4, 2024. [ 27 ]\n\nThe series also received two pop-up stores, the first store being at AKIHABARA Gamers Main Store in Tokyo from August 16, 2025, to August 31, 2025. The second store was at Abeno Raku Bus in Osaka, and it ran from August 30, 2025, September 7, 2025. [ 28 ]\n\nThe series was ranked eleventh in the Nationwide Bookstores Employees' Recommended Comics of 2024 list. [ 29 ] The series ranked seventh in the print category at the tenth Next Manga Awards in 2024. [ 30 ] The series topped AnimeJapan 's \"Manga We Want to See Animated\" poll in 2025. [ 31 ]\n\nLight novel authors such as Ryōgo Narita and Tappei Nagatsuki have praised the series on social media. [ 32 ] [ 33 ] Manga artists such as Yukinobu Tatsu of Dandadan [ 34 ] and Takuma Yokota [ 35 ] of Destroy All Humans. They Can't Be Regenerated fame have created fanart of the series.\n\nJonathan Greenall of Comic Book Resources praised the story, artwork, and characters, as well as the character's designs. [ 36 ] Rowan Grover of Multiversity Comics liked the artwork, though he criticized the humor and fan service, ultimately describing it as \"forgettable to annoying\". [ 37 ]\n\nBy July 2025, the series had over 1.2 million copies in circulation. [ 38 ]",
    "tf_idf_text": "nues exorcist japanese hepburn nue onmyji japanese manga series write illustrated kta kawae begin serialization shueisha weekly shnen jump magazine may november twelve tankbon volume release ever since young gakuro yajima able see spirit timid around due one malevolent spirit kill father one day meet nue powerful spirit form young woman live secret room high school event violent spirit cause gakuro mortally wound make contract nue lend power condition help vanquish evil spirit work alongside local exorcist wary write illustrated kta kawae series begin serialization shueisha weekly shnen jump magazine may november series individual chapter collect twelve tankbon volume viz medium manga plus publishing series english simultaneously japanese release february viz medium announce would publish series digital exclusive first volume release june october viz medium announce physical release first volume release july chapter yet publish tankbon volume caf collaboration nues exorcist bandai namco cross store tokyo announce may caf booth hold july august series also receive two popup store first store akihabara gamers main store tokyo august august second store abeno raku bus osaka run august september series rank eleventh nationwide bookstore employee recommend comic list series rank seventh print category tenth next manga award series top animejapan manga want see animated poll light novel author rygo narita tappei nagatsuki praise series social medium manga artist yukinobu tatsu dandadan takuma yokota destroy human cant regenerate fame create fanart series jonathan greenall comic book resource praise story artwork character well character design rowan grover multiversity comic like artwork though criticized humor fan service ultimately describe forgettable annoy july series million copy circulation"
}