{
    "title": "en.wikipedia.org_wiki_Nielsen_BookScan",
    "url": "https://en.wikipedia.org/wiki/Nielsen_BookScan",
    "transformers_text": "BookScan is a data provider for the book publishing industry that compiles point of sale data for book sales, owned by Circana in the United States and NIQ in the United Kingdom, Ireland, Australia, New Zealand, India, South Africa, Italy, Spain, Brazil, Mexico, and Poland. [ 1 ] [ 2 ] [ 3 ] [ 4 ]\n\nIn the United States, Nielsen sold BookScan to NPD in 2017, and the service was renamed NPD BookScan in that territory. [ 5 ] Elsewhere in the world, Nielsen BookScan continued to operate as an independent service. In March 2023, the official name for the service became Circana BookScan. [ 6 ]\n\nFollowing the success of Nielsen SoundScan which tracked point of sale figures for music, the Nielsen Company decided to launch a similar service for book sales which had been established and was owned by UK based Whitaker & Sons Ltd. [ 7 ] Nielsen BookScan was launched in January 2001. [ 1 ] Previously, tracking of book sales, such as by the New York Times Best Seller list , was done without raw numbers. The New York Times would survey hundreds of outlets to estimate which books were selling the most copies, and would publish rankings but not figures. Only the publisher of a book tracked how many copies had been sold, but rarely shared this data.\n\nBookScan operated under Nielsen in the US until 2016 when it was acquired by The NPD Group from Nielsen's U.S. market information and research services for the book industry. In the U.S. the service has been a part of NPD Book since January, 2017. [ 8 ] In the rest of the world the BookScan service is owned by NIQ . [ 9 ] NIQ was formed from the divestiture of consumer intelligence business of the Nielsen Holdings (known as NielsenIQ) to private equity firm Advent International in March 2021. [ 10 ]\n\nSince October 2022, the American Booksellers Association has been BookScan’s official aggregator for independent bookstore data. [ 11 ]\n\nIn March 2023, following the merger of The NPD Group and IRI to form a new company called Circana, NPD BookScan was rebranded as Circana BookScan. [ 12 ] [ 13 ]\n\nBookScan relies on point of sale data from a number of major book sellers. In 2009, BookScan's US Consumer Market Panel covered 75% of retail sales.\n\nBookScan was initially greeted with scepticism, but is now widely used by both the publishing industry and the media. [ 2 ] Publishers use the numbers to track the success of their rivals. The media uses the figures as a reference to gauge a title's success. Daniel Gross of Slate has noted the increase of pundits using the figures to disparage each other. [ 1 ]\n\nBookScan also provided previously unavailable metrics on books published by multiple publishers, such as classic novels in the public domain which may be published by many different houses. Previously, no single entity had figures for the sales of these books; publishers and bookstores only knew their own sales. Slate noted that Jane Austen 's Pride and Prejudice was available from Amazon in 130 different editions; prior to BookScan there was no way to tabulate total sales. By summing BookScan data, however, Pride and Prejudice was reported to command sales of 110,000 a year, nearly 200 years after being published. [ 3 ]\n\nBookScan records cash register sales of books by tracking ISBNs when a clerk scans the barcode. BookScan only tracks print book sales, thus excluding ebook sales from major e-tailers such as Amazon Kindle , Barnes & Noble Nook , Kobo , Apple , and Google Play . BookScan likewise does not include non-retail sales through channels such as libraries, nor specialty retailers who do not report to the service. [ 14 ] The weekend edition of the Wall Street Journal carried bestseller lists from BookScan data (non-fiction and fiction lists broken into traditional book, ebook, and combined lists) until the fall of 2023. [ 15 ]\n\nNIQ offers the BookScan service in 10 territories outside the U.S.: the UK, Ireland, Australia, New Zealand, India, South Africa, Italy, Spain, Brazil and Mexico, with Poland next to launch. [ 16 ] [ 9 ] [ 17 ]",
    "tf_idf_text": "bookscan data provider book publishing industry compiles point sale data book sale own circana united state niq united kingdom ireland australia new zealand india south africa italy spain brazil mexico poland united state nielsen sell bookscan npd service rename npd bookscan territory elsewhere world nielsen bookscan continue operate independent service march official name service become circana bookscan follow success nielsen soundscan track point sale figure music nielsen company decide launch similar service book sale establish own base whitaker son ltd nielsen bookscan launch january previously track book sale new york time best seller list do without raw number new york time would survey hundred outlet estimate book sell copy would publish ranking not figure publisher book track many copy sell rarely share data bookscan operate nielsen acquire npd group nielsens market information research service book industry service part npd book since january rest world bookscan service own niq niq form divestiture consumer intelligence business nielsen holding know nielseniq private equity firm advent international march since october american bookseller association bookscans official aggregator independent bookstore data march follow merger npd group iri form new company call circana npd bookscan rebranded circana bookscan bookscan relies point sale data number major book seller bookscans consumer market panel cover retail sale bookscan initially greet scepticism widely use publishing industry medium publisher use number track success rival medium use figure reference gauge title success daniel gross slate note increase pundit use figure disparage bookscan also provide previously unavailable metric book publish multiple publisher classic novel public domain may publish many different house previously single entity figure sale book publisher bookstores know sale slate note jane austen pride prejudice available amazon different edition prior bookscan way tabulate total sale sum bookscan data however pride prejudice report command sale year nearly year publish bookscan record cash register sale book track isbns clerk scan barcode bookscan track print book sale thus exclude ebook sale major etailers amazon kindle barnes noble nook kobo apple google play bookscan likewise not include nonretail sale channel library nor specialty retailer not report service weekend edition wall street journal carry bestseller list bookscan data nonfiction fiction list broken traditional book ebook combine list fall niq offer bookscan service territory outside ireland australia new zealand india south africa italy spain brazil mexico poland next launch"
}