{
    "title": "en.wikipedia.org_wiki_Tank%C5%8Dbon",
    "url": "https://en.wikipedia.org/wiki/Tank%C5%8Dbon",
    "transformers_text": "A tankōbon ( 単行本 ; lit. ' independent/standalone book ' ) [ a ] is a standard publishing format for books in Japan, alongside other formats such as shinsho (17×11 cm paperback books) and bunkobon . Used as a loanword in English, the term specifically refers to a printed collection of a manga that was previously published in a serialized format. Manga tankōbon typically contain a handful of chapters, and may collect multiple volumes as a series continues publication.\n\nMajor publishing imprints for tankōbon of manga include Jump Comics (for serials in Shueisha 's Weekly Shōnen Jump and other Jump magazines ), Kodansha 's Shōnen Magazine Comics , Shogakukan 's Shōnen Sunday Comics, and Akita Shoten ’s Shōnen Champion Comics .\n\nIncreasingly after 1959, [ citation needed ] manga came to be published in thick, phone-book -sized weekly or monthly anthology manga magazines , such as Weekly Shōnen Magazine or Weekly Shōnen Jump . These anthologies often have hundreds of pages and dozens of individual series by multiple authors. They are printed on cheap newsprint and are considered disposable. Since the 1930s, though, comic strips had been compiled into tankōbon collecting multiple installments from a single series and reprinting them in a roughly paperback -sized volume on higher quality paper than in the original magazine printing. [ 1 ] Strips in manga magazines and tankobon are typically printed in black and white, but sometimes certain sections may be printed in colour or using colored inks or paper.\n\nIn English , while a tankōbon translation is usually marketed as a \" graphic novel \" or \" trade paperback \", the transliterated terms tankoubon and tankōbon are sometimes used amongst online communities. Japanese speakers frequently refer to manga tankōbon by the English loanword \"comics\" ( コミックス , komikkusu ) , [ 2 ] although it is more widespread for being used in place of the word \"manga\", as they are the same thing. The term also refers to the format itself—a comic collection in a trade paperback sized (roughly 13 cm × 18 cm, 5 in × 7 in) book (as opposed to the larger 18 cm × 25 cm, 7 in × 10 in format used by traditional American graphic novels). [ 3 ]\n\nAlthough Japanese manga tankobon may be in various sizes, the most common are Japanese B6 (12.8 cm × 18.2 cm, 5.04 in × 7.17 in) and ISO A5 (14.8 cm × 21.0 cm, 5.83 in × 8.27 in). The tankōbon format has made inroads in the American comics market, with several major publishers opting to release some of their titles in this smaller format, which is sometimes also called \"digest format\" or \" digest size \". In the United States, many manga are released in the so-called \"Tokyopop trim\" or \"Tokyopop size\" (approximately 13 cm × 19 cm, 5 in × 7.5 in). [ 4 ]\n\nAn aizōban ( 愛蔵版 ; lit. \"cherished edition\") is a collector's edition volume . These volumes are generally more expensive and lavished with special features such as a special cover created specifically for the edition, a special paper used for the cover, higher quality paper, a special slipcase, etc. Aizōban are generally printed in a limited run, thereby increasing the value and collectability of those few copies made. The aizōban format has begun to make inroads into the US market, with titles such as Fruits Basket and Mobile Suit Gundam: The Origin being reissued in a similar format.\n\nA bunkoban ( 文庫版 ; lit. \"paperback edition\") edition refers to a tankōbon printed in bunko format, or a typical Japanese novel-sized volume. Bunkoban are generally A6 size (105 mm × 148 mm, 4.1 in × 5.8 in) and thicker than tankōbon and, in the case of manga, usually have a new cover designed specifically for the release. In the case of manga, a bunkoban tends to contain considerably more pages than a tankōbon and usually is a republication of tankōbon of the same title which may or may not have been out of print. [ 5 ]\n\nThus, the bunko edition of a given manga will consist of fewer volumes. For example, Please Save My Earth was published in 21 tankōbon volumes, and then re-released in 12 bunko volumes. [ 6 ] If the original manga was a wide-ban release, the bunkoban release will generally have the same number of volumes.\n\nA gōka aizōban ( 豪華愛蔵版 ; lit. \"luxury collector's edition\") is another term occasionally used to designate a type of special release. [ 7 ]\n\nThe kanzenban ( 完全版 ; lit. \"complete edition\") is yet another term sometimes used to denote a type of special release. A kanzenban release is generally A5 size (148 mm × 210 mm, 5.8 in × 8.3 in) and will typically reproduce individual chapter covers, colour pages, and side-stories from its original magazine run, features that are often omitted or converted to grayscale in standard tankōbon releases. While the aizōban appellation emphasizes the value of the volumes, the term kanzenban emphasizes their completeness.\n\nSimilar to a wide-ban , a shinsōban ( 新装版 ; lit. \"redecorated edition\") or tokusōban ( 特装版 ; lit. \"specially bound edition\") is a special edition released, usually with a new cover. The volumes in such a release usually have new colour pages and other extras. For example, in 2003, Sailor Moon was re-edited; some pages were completely redrawn, and most dialogues were rewritten by the author. The chapters were redivided to fit into 12 volumes instead of 18. [ 8 ]\n\nThe sōshūhen ( 総集編 ; lit. \"compilation\") is a format published by Shueisha beginning in 2008. A sōshūhen edition is B5 size (176 mm × 250 mm, 6.9 in × 9.8 in), larger than a kanzenban , and similarly reproduces chapter covers and colour pages while also including a variety of bonus features such as posters and interviews. The majority of sōshūhen releases are for popular manga with ongoing serializations. They contain far more pages than a standard tankōbon and feature more chapters in fewer volumes; Naruto Part I was originally published in 27 tankōbon volumes, but was completed in just eight sōshūhen volumes. [ 9 ]\n\nA wide-ban or waidoban ( ワイド版 ; lit. \"wide edition\") edition is larger ( A5 size) than a regular tankōbon . Many manga, particularly seinen and josei manga , are published in wide-ban editions after magazine serialisation, and are never released in the tankōbon format that is common in shōnen manga and shōjo manga . When a series originally published in tankōbon format is re-released in wide-ban format, each volume will contain more pages than in the original edition, and therefore the series will consist of fewer volumes. For example, Inuyasha was originally released in 56 tankōbon volumes, but was republished as 30 wide-ban volumes. [ 10 ]",
    "tf_idf_text": "tankbon light independentstandalone book standard publishing format book japan alongside format shinsho paperback book bunkobon use loanword english term specifically refers print collection manga previously publish serialized format manga tankbon typically contain handful chapter may collect multiple volume series continue publication major publishing imprint tankbon manga include jump comic serial shueisha weekly shnen jump jump magazine kodansha shnen magazine comic shogakukan shnen sunday comic akita shoten shnen champion comic increasingly citation need manga come publish thick phonebook size weekly monthly anthology manga magazine weekly shnen magazine weekly shnen jump anthology often hundred page dozens individual series multiple author print cheap newsprint consider disposable since though comic strip compile tankbon collect multiple installment single series reprint roughly paperback sized volume high quality paper original magazine print strip manga magazine tankobon typically printed black white sometimes certain section may print colour use colored ink paper english tankbon translation usually market graphic novel trade paperback transliterate term tankoubon tankbon sometimes use amongst online community japanese speaker frequently refer manga tankbon english loanword comic komikkusu although widespread used place word manga thing term also refer format itselfa comic collection trade paperback size roughly book oppose large format use traditional american graphic novel although japanese manga tankobon may various size common japanese iso tankbon format make inroad american comic market several major publisher opt release title small format sometimes also call digest format digest size united state many manga release socalled tokyopop trim tokyopop size approximately aizban lit cherish edition collector edition volume volume generally expensive lavish special feature special cover create specifically edition special paper use cover high quality paper special slipcase etc aizban generally print limited run thereby increase value collectability copy make aizban format begin make inroads market title fruit basket mobile suit gundam origin reissue similar format bunkoban light paperback edition edition refers tankbon print bunko format typical japanese novelsized volume bunkoban generally size thicker tankbon case manga usually new cover design specifically release case manga bunkoban tend contain considerably page tankbon usually republication tankbon title may may not print thus bunko edition give manga consist few volume example please save earth publish tankbon volume rereleased bunko volume original manga wideban release bunkoban release generally number volume gka aizban lit luxury collector edition another term occasionally used designate type special release kanzenban light complete edition yet another term sometimes used denote type special release kanzenban release generally size typically reproduce individual chapter cover colour page sidestories original magazine run feature often omit convert grayscale standard tankbon release aizban appellation emphasize value volume term kanzenban emphasize completeness similar wideban shinsban lit redecorate edition tokusban light specially bind edition special edition release usually new cover volume release usually new colour page extras example sailor moon reedited page completely redrawn dialogue rewrite author chapter redivided fit volume instead sshhen lit compilation format publish shueisha begin sshhen edition size large kanzenban similarly reproduces chapter cover colour page also include variety bonus feature poster interview majority sshhen release popular manga ongoing serialization contain far page standard tankbon feature chapter few volume naruto part originally publish tankbon volume complete eight sshhen volumes wideban waidoban lit wide edition edition large size regular tankbon many manga particularly seinen josei manga publish wideban edition magazine serialisation never release tankbon format common shnen manga shjo manga series originally publish tankbon format rereleased wideban format volume contain page original edition therefore series consist few volume example inuyasha originally release tankbon volume republish wideban volume"
}