{
    "title": "en.wikipedia.org_wiki_One_Piece_Card_Game",
    "url": "https://en.wikipedia.org/wiki/One_Piece_Card_Game",
    "transformers_text": "One Piece Card Game is a collectible card game based on the manga One Piece . The One Piece Card Game most resembles the Dragon Ball Super and Hearthstone card games. [ 1 ] Bandai has created an official free tutorial app that teaches the basics of gameplay. [ 2 ]\n\nThe One Piece Card Game is a new and separate card game to the previously released One Piece card game, which was also produced by Bandai. [ 3 ] [ 4 ] The new card game was released by Bandai in Japan on July 8, 2022, [ 5 ] [ 6 ] and globally on December 2, 2022. [ 7 ] [ 8 ] The launch included four themed-starter decks based on different groups from the series: the Straw Hat Pirates , the Worst Generation, the Seven Warlords of the Sea , and the Animal Kingdom Pirates. [ 4 ]\n\nManga creator Eiichiro Oda confirms the use of manga art in the card game. [ 6 ] Moreover, a unique set of cards based on characters featured in Netflix 's live-action adaptation of the anime. [ 9 ]\n\nThe game involves each player selecting a Leader and assembling a team (or \"crew\") to battle against an opponent. [ 10 ]\n\nCompared to the other big three trading card games ( Magic: The Gathering , Pokémon , and Yu-Gi-Oh ), One Piece Card Game separates the resource cards from the rest of the cards to prevent a draw of cards with no playable moves. [ 10 ]\n\nThere are five types of cards split between the main deck or used elsewhere: [ 10 ]\n\nA player can only use other non-Leader cards that match the color of their Leader card. [ 10 ]\n\nTheGamer comments that \"less experienced players will find the streamlined rules to be beginner-friendly and easy to learn\". [ 10 ] First impressions by Dicebreaker comments the game \"offers a solid gameplay foundation\" with \"remarkable consistency and quality of its art design\" that \"certainly has an exciting future ahead\". [ 2 ]",
    "tf_idf_text": "one piece card game collectible card game base manga one piece one piece card game resemble dragon ball super hearthstone card game bandai create official free tutorial app teach basic gameplay one piece card game new separate card game previously release one piece card game also produce bandai new card game release bandai japan july globally december launch include four themedstarter deck base different group series straw hat pirate bad generation seven warlord sea animal kingdom pirate manga creator eiichiro oda confirms use manga art card game moreover unique set card base character feature netflix liveaction adaptation anime game involve player select leader assemble team crew battle opponent compare big three trade card game magic gather pokmon yugioh one piece card game separate resource card rest card prevent draw card playable move five type card split main deck use elsewhere player use nonleader card match color leader card thegamer comment less experienced player find streamlined rule beginnerfriendly easy learn first impression dicebreaker comment game offer solid gameplay foundation remarkable consistency quality art design certainly exciting future ahead"
}