{
    "title": "10 10a 10 \"The Bluff and the Bluffer\"\"The Weirdest Guy Ever! Jango the Hypnotist!\"Transliteration: \"Shijō Saikyō no Hen na Yatsu! Saiminjutsushi Jango\" (Japanese:史上最強の変な奴!催眠術師ジャンゴ) Munehisa Sakai Junki Takegami 912.7 January 19, 2000(2000-01-19)[20] November 20, 2004[21]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_1",
    "transformers_text": "10 10a 10 \"The Bluff and the Bluffer\"\"The Weirdest Guy Ever! Jango the Hypnotist!\"Transliteration: \"Shijō Saikyō no Hen na Yatsu! Saiminjutsushi Jango\" (Japanese:史上最強の変な奴!催眠術師ジャンゴ) Munehisa Sakai Junki Takegami 912.7 January 19, 2000(2000-01-19)[20] November 20, 2004[21]\n\nAt Kaya's mansion, Klahadore goes on about how Usopp's father is a filthy pirate, making Usopp livid enough to punch him in the face. Klahadore continues taunting Usopp, who eventually leaves. Later, Kaya is crying in her room. Klahadore enters to bring her a meal and reminds her of the day he came to the mansion, when he was battered and her father took him in. He then claims that if anything happened to Kaya, he would not forgive himself. The Usopp Pirates, Nami, and Zoro encounter Jango, who claims to be only a passing hypnotist. He then hypnotizes the Usopp Pirates — and accidentally himself — into falling asleep in the middle of the road. Later, by a cliff overlooking the ocean, Luffy and Usopp witness Jango and Klahadore — whose true identity turns out to be that of the infamous pirate Captain Kuro — plotting a raid of the village, and Kaya's murder. Luffy yells at them not to get rid of Kaya, but Jango uses his hypnotism to put Luffy to sleep, causing him to fall off the cliff. He lands on his head and appears to be dead. They do not worry about Usopp knowing, because of his reputation as a liar.",
    "tf_idf_text": "bluff blufferthe weird guy ever jango hypnotisttransliteration shij saiky hen yatsu saiminjutsushi jango japanese munehisa sakai junki takegami january november kayas mansion klahadore go usopps father filthy pirate making usopp livid enough punch face klahadore continue taunt usopp eventually leave later kaya cry room klahadore enters bring meal reminds day come mansion batter father take claim anything happen kaya would not forgive usopp pirate nami zoro encounter jango claim pass hypnotist hypnotizes usopp pirate accidentally fall asleep middle road later cliff overlook ocean luffy usopp witness jango klahadore whose true identity turn infamous pirate captain kuro plot raid village kayas murder luffy yell not get rid kaya jango use hypnotism put luffy sleep cause fall cliff land head appear dead not worry usopp know reputation liar"
}