{
    "title": "12 11b 12 \"The War at the Shore\"\"Clash with the Black Cat Pirates! The Great Battle on the Slope!\"Transliteration: \"Gekitotsu! Kuroneko Kaizoku-dan Sakamichi no Daikōbō!\" (Japanese:激突!クロネコ海賊団坂道の大攻防!) Junichi Fujise Junki Takegami 913.2 February 2, 2000(2000-02-02)[24] November 27, 2004",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_1",
    "transformers_text": "12 11b 12 \"The War at the Shore\"\"Clash with the Black Cat Pirates! The Great Battle on the Slope!\"Transliteration: \"Gekitotsu! Kuroneko Kaizoku-dan Sakamichi no Daikōbō!\" (Japanese:激突!クロネコ海賊団坂道の大攻防!) Junichi Fujise Junki Takegami 913.2 February 2, 2000(2000-02-02)[24] November 27, 2004\n\nUsopp, Luffy, Zoro, and Nami formulate a plan on the slope for when the pirates come. Meanwhile, Kuro breaks the glasses Kaya gave him and injures Merry with his clawed glove. Kuro then steps into Kaya's room, and he holds his blood-stained claw over Kaya's head, remembering the deed he has to commit the following day. By the coast, the Black Cat Pirates's ship approaches Syrup Village. Jango reiterates the plan to his men. Meanwhile, Luffy, Usopp, Zoro, and Nami stand on the slope leading to the village, and have poured a barrel of oil on it to make it slippery. The plan is that when the Black Cat Pirates slip on the oil, the four will spring out and attack them. Dawn breaks, and so the Black Cat Pirates land on the coast, spotting Luffy's boat. At that moment, Luffy and the others are waiting for the pirates as the sun has now risen, and Nami hears the pirates coming from the north. Usopp notes that there is an identical slope at the north end of the village, and they realize they are at the wrong coast. Panicking, Nami then realizes that their ship is located at the north coast, and their treasure will be robbed by the pirates. Luffy and Usopp take off running for the coast. Zoro and Nami start to leave, but Nami slips on the oil and drags Zoro down the slope, stepping on him to climb back up. Zoro is unable to get up the slippery slope, and he slides to the bottom, but eventually uses his swords to pull his way up. At the north coast, Usopp arrives, surprised that Luffy hasn't come yet - Luffy is now lost. The Black Cat Pirates arrive, and Usopp stands up to them, but realizes he can't beat them by himself. He sees the pirates taking the treasure from the Straw Hats's ship, and he says that the treasure belongs to him, and he'll give it to them if they leave. Jango decides to hypnotize Usopp instead, but an enraged Nami arrives in the nick of time and whacks Usopp in the head, knocking him over, refusing to give up her treasure. Usopp then reports that Luffy has not arrived yet, and is probably lost. The Black Cat Pirates then charge, and Usopp stands up to them, but they knock him down swiftly. Usopp struggles to fight them, but there are far too many. He is shocked when they are all sent flying back, and sees that Luffy and Zoro have arrived. Zoro yells at Nami about leaving him there, and Luffy yells at Usopp for not telling him which way was north. However, united, the four face off against the invading Black Cat Pirates.",
    "tf_idf_text": "war shoreclash black cat pirate great battle slopetransliteration gekitotsu kuroneko kaizokudan sakamichi daikb japanese junichi fujise junki takegami february november usopp luffy zoro nami formulate plan slope pirate come meanwhile kuro break glass kaya give injures merry claw glove kuro step kayas room hold bloodstained claw kayas head remember deed commit follow day coast black cat piratess ship approach syrup village jango reiterate plan men meanwhile luffy usopp zoro nami stand slope leading village pour barrel oil make slippery plan black cat pirate slip oil four spring attack dawn break black cat pirate land coast spot luffys boat moment luffy others wait pirate sun rise nami hears pirate come north usopp note identical slope north end village realize wrong coast panic nami realizes ship located north coast treasure rob pirate luffy usopp take run coast zoro nami start leave nami slips oil drag zoro slope step climb back zoro unable get slippery slope slide bottom eventually use sword pull way north coast usopp arrives surprise luffy hasnt come yet luffy lose black cat pirate arrive usopp stand realize cant beat see pirate take treasure straw hatss ship say treasure belongs hell give leave jango decides hypnotize usopp instead enrage nami arrives nick time whack usopp head knock refuse give treasure usopp report luffy not arrive yet probably lose black cat pirate charge usopp stand knock swiftly usopp struggle fight far many shocked send fly back see luffy zoro arrive zoro yell nami leave luffy yell usopp not tell way north however united four face invade black cat pirate"
}