{
    "title": "13 12 13 \"The Black Cat Pirates\"\"The Terrifying Duo! Meowban Brothers vs. Zoro!\"Transliteration: \"Kyōfu no Futarigumi! Nyāban Burazāsu VS Zoro\" (Japanese:恐怖の二人組!ニャーバン兄弟VSゾロ) Hidehiko Kadota Junki Takegami 714.7 February 9, 2000(2000-02-09)[25] December 4, 2004[26]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_1",
    "transformers_text": "13 12 13 \"The Black Cat Pirates\"\"The Terrifying Duo! Meowban Brothers vs. Zoro!\"Transliteration: \"Kyōfu no Futarigumi! Nyāban Burazāsu VS Zoro\" (Japanese:恐怖の二人組!ニャーバン兄弟VSゾロ) Hidehiko Kadota Junki Takegami 714.7 February 9, 2000(2000-02-09)[25] December 4, 2004[26]\n\nJango kneels beside the fallen pirates and starts to hypnotize them. Once the hypnotism takes effect, the pirates became wild and ravenous, and foaming at their mouths, they charge at the Straw Hats. One pounds down a cliff with his fist. Zoro says that he and Luffy will handle it, but Luffy was also hypnotized, becoming a wild animal himself. Luffy charges down the slope and uses hisGum-Gum Gatlingtechnique to plow through the pirates with ease. Luffy keeps charging, and soon runs past the pirates, causing Jango to fear that he will be the next target. Luffy takes the bow of Kuro's ship in an attempt to kill him, but Jango hypnotizes Luffy, and so Luffy falls asleep, the bow falling on top of him and squishing him as he does this. With Luffy out of the way, Jango prepares for the next attack. Seeing the pirates are defeated, he calls for Siam and Butchie and orders them to attack. They turn out to be cowards, but after some heavy persuasion they charge for Zoro. Zoro blocks their claws with his sword, and engages in a great fight with the two Meowban Brothers. Zoro slashes Siam through the lowersection, but finds out Siam has a very thin waist. He sits on top of Zoro and Buchie leaps down, but Zoro manages to avoid the bone-crushing attack that leaves a crater. Butchie then uses his cat-like abilities to steal Zoro's two swords, and throws them away. Zoro has no chance to grab them and faces another assault by the Nyaban Brothers. Usopp decides to help and fires at the brothers, but Zoro blocks it with his back, yelling at Nami and Usopp to not get themselves killed. Nami then runs for Zoro's swords, picking them up, but Jango reacts swiftly and slashes her in the shoulder with his chakram. Just as Jango and the others are about to kill the Straw Hats, Kuro appears, enraged that his plan has been completely foiled.",
    "tf_idf_text": "black cat piratesthe terrify duo meowban brother zorotransliteration kyfu futarigumi nyban burazsu zoro japanesevs hidehiko kadota junki takegami february december jango kneel beside fall pirate start hypnotize hypnotism take effect pirate become wild ravenous foam mouths charge straw hat one pound cliff fist zoro say luffy handle luffy also hypnotize become wild animal luffy charge slope use hisgumgum gatlingtechnique plow pirate ease luffy keep charge soon run past pirate cause jango fear next target luffy take bow kuros ship attempt kill jango hypnotize luffy luffy fall asleep bow fall top squishing luffy way jango prepare next attack see pirate defeat call siam butchie order attack turn coward heavy persuasion charge zoro zoro block claw sword engage great fight two meowban brother zoro slash siam lowersection find siam thin waist sits top zoro buchie leap zoro manages avoid bonecrushing attack leave crater butchie use catlike ability steal zoros two sword throw away zoro chance grab face another assault nyaban brother usopp decides help fire brother zoro block back yell nami usopp not get kill nami run zoros sword pick jango reacts swiftly slash shoulder chakram jango others kill straw hat kuro appear enraged plan completely foil"
}