{
    "title": "14 13 14 \"Good Pirates vs. Bad Pirates\"\"Luffy Back in Action! Miss Kaya's Desperate Resistance!\"Transliteration: \"Rufi Fukkatsu! Kaya-ojōsama no Kesshi no Teikō\" (Japanese:ルフィ復活!カヤお嬢様の決死の抵抗) Yukio Kaizawa Junki Takegami 1012.8 February 16, 2000(2000-02-16)[27] December 11, 2004[28]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_1",
    "transformers_text": "14 13 14 \"Good Pirates vs. Bad Pirates\"\"Luffy Back in Action! Miss Kaya's Desperate Resistance!\"Transliteration: \"Rufi Fukkatsu! Kaya-ojōsama no Kesshi no Teikō\" (Japanese:ルフィ復活!カヤお嬢様の決死の抵抗) Yukio Kaizawa Junki Takegami 1012.8 February 16, 2000(2000-02-16)[27] December 11, 2004[28]\n\nThe episode begins with Kuro standing impatiently. Siam and Butchie decide that Kuro, having been inactive for three years, has lost his edge, and that they can defeat him. They charge at Kuro but only swing at thin air, and Kuro appears behind them, holding his claws to their necks. He says that everyone has five minutes to finish their job, or he will kill them all. He releases the Meowban Brothers, pushing them so that they can continue their battle with Zoro. However, Nami sees her chance and kicks Zoro's swords through the air. Zoro catches them, and as the Meowban Brothers charge at him he unleashes a great Toragiri, taking both of them down with one mighty swing. He turns to Kuro and declares he won't even need five minutes. Nami realizes how dangerous Kuro is, and so runs to wake up Luffy. As she runs, Jango spots her, and hurls a chakram at her. Nami turns and steps on Luffy's face, waking up Luffy abruptly. He springs up, pulling Nami down just as the chakram strikes him right in the mouth. Luffy stays standing, though, and he breaks the chakram with his teeth. He then sees Nami is wounded, and furious, prepares for battle with Kuro. At the mansion, Kaya wakes up from a nightmare, and she heads down the stairs to find Merry leaning against the wall, bloody and wounded. Merry explains the whole situation to Kaya, how Kuro is planning to kill her and take her money in a will. Kaya realizes that Usopp was telling the truth the entire time, and so she puts on her overcoat and sets out. She arrives at the top of the slope, and tells Kuro to stop immediately, and that Merry told her everything. Kuro turns to her and wonders why Merry isn't dead, and Kaya sees the state Usopp is in. Usopp charges in and aims a punch at Kuro's face, but Kuro avoids the swing and so Usopp careens into the ground. Kaya then pulls out a gun and points it at Kuro, ordering him to leave the village. Kuro reminds Kaya of the fun times they had together, and Kaya hesitates. Kuro takes the gun from Kaya's hands, knowing she won't shoot, and he drops it to the ground. Usopp picks up the gun and fires at Kuro, but Kuro sidesteps the shot and knocks Usopp down. From out of nowhere flies Luffy's fist, striking Kuro in the face. As Kuro falls back, Luffy retracts his Gum-Gum Pistol and declares that he has a hundred more where that came from.",
    "tf_idf_text": "good pirate bad piratesluffy back action miss kayas desperate resistancetransliteration rufi fukkatsu kayaojsama kesshi teik japanese yukio kaizawa junki takegami february december episode begin kuro stand impatiently siam butchie decide kuro inactive three year lose edge defeat charge kuro swing thin air kuro appear behind hold claw neck say everyone five minute finish job kill release meowban brother push continue battle zoro however nami see chance kick zoros sword air zoro catch meowban brother charge unleashes great toragiri take one mighty swing turn kuro declares wont even need five minute nami realize dangerous kuro run wake luffy run jango spot hurl chakram nami turn step luffys face wake luffy abruptly spring pull nami chakram strike right mouth luffy stay stand though breaks chakram teeth see nami wound furious prepares battle kuro mansion kaya wake nightmare head stair find merry lean wall bloody wound merry explains whole situation kaya kuro planning kill take money kaya realize usopp tell truth entire time put overcoat set arrive top slope tell kuro stop immediately merry tell everything kuro turn wonder merry isnt dead kaya see state usopp usopp charge aim punch kuros face kuro avoids swing usopp careen ground kaya pull gun point kuro order leave village kuro remind kaya fun time together kaya hesitates kuro take gun kayas hand know wont shoot drop ground usopp pick gun fire kuro kuro sidestep shot knock usopp nowhere fly luffys fist strike kuro face kuro fall back luffy retracts gumgum pistol declares hundred come"
}