{
    "title": "1 1 1 \"I'm Gonna Be King of the Pirates!\"\"I'm Luffy! The Man Who's Gonna Be King of the Pirates!\"Transliteration: \"Ore wa Rufi! Kaizoku Ō ni Naru Otoko Da!\" (Japanese:俺はルフィ!海賊王になる男だ!) Kōnosuke Uda Junki Takegami 612.4 October 20, 1999(1999-10-20)[5] September 18, 2004[6]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_1",
    "transformers_text": "1 1 1 I'm Gonna Be King of the Pirates I'm Luffy The Man Who's Gonna Be King of the Pirates Transliteration Ore wa Ru fi Kai z oku ni Naru O toko Da Japanese K no suke Uda Junk i Take gam i 612 4 October 20 1999 1999 10 20 5 September 18 2004 6 In the ocean Al vida and her pirate crew attack a cruise ship Coby a slave of Al vida discovers a barrel One of Al vida's pirates attempts to open the barrel but a young boy emerges and accidentally hits him The remaining pirates attack him but the stranger stops them and says that his name is Monkey D Luffy Luffy drags Coby to the storage cellar of the ship where he eats and converses with Coby who reveals his dream of being a marine as Luffy reveals his dream to become the King of the Pirates Al vida confronts Luffy but he escapes and knocks her pirate crew down with his Devil Fruit power to Coby's shock Luffy explains that he ate the Gum Gum Fruit therefore he has the properties of rubber Coby inspired by Luffy stands up for himself when Al vida confronts them Luffy uses his Gum Gum Pistol technique on Al vida defeating her and sending her flying into the sea Luffy and Coby sail away in a borrowed boat from Al vida's crew Luffy asks about the bounty hunter that Coby mentioned earlier Coby says that he was captured by the Marines and Luffy announces his intention of asking him to join his crew",
    "tf_idf_text": "gonna king pirate luffy man who gonna king pirate transliteration ore kai oku naru toko japanese suke uda junk take gam october september ocean vida pirate crew attack cruise ship coby slave vida discovers barrel one vidas pirate attempt open barrel young boy emerge accidentally hit remain pirate attack stranger stop say name monkey luffy luffy drag coby storage cellar ship eats converse coby reveals dream marine luffy reveals dream become king pirate vida confronts luffy escape knock pirate crew devil fruit power cobys shock luffy explain ate gum gum fruit therefore property rubber coby inspire luffy stand vida confronts luffy us gum gum pistol technique vida defeat send fly sea luffy coby sail away borrow boat vidas crew luffy asks bounty hunter coby mention earlier coby say capture marine luffy announces intention ask join crew"
}