{
    "title": "20 19 20 \"King of the Busboys\"\"Famous Cook! Sanji of the Sea Restaurant!\"Transliteration: \"Meibutsu Kokku! Kaijō Resutoran no Sanji\" (Japanese:名物コック!海上レストランのサンジ) Yukio Kaizawa Junki Takegami 315.0 April 12, 2000(2000-04-12)[39] February 5, 2005[40]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_1",
    "transformers_text": "20 19 20 \"King of the Busboys\"\"Famous Cook! Sanji of the Sea Restaurant!\"Transliteration: \"Meibutsu Kokku! Kaijō Resutoran no Sanji\" (Japanese:名物コック!海上レストランのサンジ) Yukio Kaizawa Junki Takegami 315.0 April 12, 2000(2000-04-12)[39] February 5, 2005[40]\n\nAfter a review of the ending of the previous episode, the episode begins with Marine Lieutenant Iron Fist Fullbody pouring a drink to a beautiful lady on his marine ship and saying how he is taking her to the greatest restaurant in the world. The lady then questions if the restaurant is in the middle of the ocean, which Fullbody answers by telling her to just look forward to it. In the meantime, on theGoing Merry,Zororecognizes the intruder who got beat up byLuffyfrom the last episode as Johnny. Johnny then brings the Straw Hat pirates' attention toYosaku, who lies ill on his and Johnny's small ship. It turns out that Johnny, Yosaku, and Zoro used to be bounty hunter partners some time ago. Johnny then proceeds to tell the Straw Hat pirates that he took Yosaku to a small rock island to rest, which was coincidentally blown up byUsoppand Luffy for target practice in the last episode. Usopp and Luffy quickly apologize. Johnny, however, was more worried about Yosaku's condition, whichNamiquickly diagnoses as scurvy caused by a lack of Vitamin C. Luffy and Usopp then shove a bunch of lemons into Yosaku's mouth and Yosaku is revived!... for five minutes. The straw hat pirates conclude that they need a cook for their potential nutritional problems. Johnny points out that they probably can find a good candidate in the floating sea restaurant known as Baratie. He also states that the one Zoro has been looking for, the greatest swordsman in the worldDracule Mihawk, is near there too. Thus they head to Baratie, which is closeby. They are then passed by Fullbody's marine ship. Fullbody doesn't recognize the Straw Hat pirates' mark, but he recognizes Johnny and Yosaku as worthless pirate hunters. Johnny responds by shouting \"this is what pirate hunters do\" while throwing a bunch of wanted posters in the air. Nami takes note of theArlongposter with an angry look and crumbles the poster in her hands. Fullbody then orders his crew to sink the pirate ship. Luffy attempts to deflect the cannon but after losing his grip accidentally deflects it to the head chief's room in Baratie, where the head chief was subsequently injured and demands that Luffy work off his crime by working at the restaurant for one year. In Baratie, while attempting to impress his girlfriend, Fullbody instead becomes humiliated bySanji's witty remarks. It turns out that Sanji is actually the Assistant Head Chef. Frustrated, Fullbody destroys his table full of food. Sanji, who is angry that Fullbody wasted precious food, beats Fullbody up.",
    "tf_idf_text": "king busboysfamous cook sanji sea restauranttransliteration meibutsu kokku kaij resutoran sanji japanese yukio kaizawa junki takegami april february review end previous episode episode begin marine lieutenant iron fist fullbody pour drink beautiful lady marine ship say take great restaurant world lady question restaurant middle ocean fullbody answer tell look forward meantime thegoing merryzororecognizes intruder get beat byluffyfrom last episode johnny johnny bring straw hat pirate attention toyosaku lie ill johnnys small ship turn johnny yosaku zoro use bounty hunter partner time ago johnny proceeds tell straw hat pirate take yosaku small rock island rest coincidentally blow byusoppand luffy target practice last episode usopp luffy quickly apologize johnny however worry yosakus condition whichnamiquickly diagnose scurvy cause lack vitamin luffy usopp shove bunch lemon yosakus mouth yosaku revive five minute straw hat pirate conclude need cook potential nutritional problem johnny point probably find good candidate float sea restaurant know baratie also state one zoro look great swordsman worlddracule mihawk near thus head baratie closeby pass fullbodys marine ship fullbody doesnt recognize straw hat pirate mark recognize johnny yosaku worthless pirate hunter johnny responds shout pirate hunter throw bunch want poster air nami take note thearlongposter angry look crumbles poster hand fullbody order crew sink pirate ship luffy attempt deflect cannon lose grip accidentally deflect head chief room baratie head chief subsequently injure demand luffy work crime work restaurant one year baratie attempt impress girlfriend fullbody instead becomes humiliated bysanjis witty remark turn sanji actually assistant head chef frustrate fullbody destroys table full food sanji angry fullbody waste precious food beat fullbody"
}