{
    "title": "27 26 27 \"Here We Go A Ghin\"\"Cool-headed, Cold-hearted Demon! Pirate Fleet Chief Commander Gin!\"Transliteration: \"Reitetsu Hijō no Kijin Kaizoku Kantai Sōchō Gin\" (Japanese:冷徹非情の鬼人·海賊艦隊総隊長ギン) Kōnosuke Uda Junki Takegami 314.2 May 31, 2000(2000-05-31)[51] March 26, 2005[52]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_1",
    "transformers_text": "27 26 27 \"Here We Go A Ghin\"\"Cool-headed, Cold-hearted Demon! Pirate Fleet Chief Commander Gin!\"Transliteration: \"Reitetsu Hijō no Kijin Kaizoku Kantai Sōchō Gin\" (Japanese:冷徹非情の鬼人·海賊艦隊総隊長ギン) Kōnosuke Uda Junki Takegami 314.2 May 31, 2000(2000-05-31)[51] March 26, 2005[52]\n\nGhin finishes off Pearl, claiming that he wants to kill Sanji himself. A lengthy battle ensues but Ghin eventually gains the upper hand after Sanji breaks his ribs. Gin, however, comes to terms with himself, realizing he does not have the strength to kill the man who saved him from malnutrition. He then begs Krieg to leave the Baratie alone, but Krieg is disgusted with this show of emotion. Because of this, Ghin is no longer a member of the Krieg pirates and Krieg decides to have him executed. He then pulls off one of his shoulder pads, attaches it to his hand and it turns into a launcher for one of his deadliest weapons, the MH5 Poison Gas Bomb. Even the Krieg pirates are shocked at this means of execution and are quick to put on their masks, except Gin, who throws his in the water. The Baratie chefs swim away while Patty and Carne run inside with Zeff. Luffy attempts to make a beeline for Krieg, but is thrown back by the Needle Gun concealed in the launcher shoulder pad. Krieg fires the MH5 while Luffy steals two masks from two Krieg pirates and throws them to Sanji and Gin. He turns round to get another for himself but the pirates have vanished out to sea, and he begins to panic. The MH5 explodes.",
    "tf_idf_text": "ghincoolheaded coldhearted demon pirate fleet chief commander gintransliteration reitetsu hij kijin kaizoku kantai sch gin japanese knosuke uda junki takegami may march ghin finish pearl claim want kill sanji lengthy battle ensues ghin eventually gain upper hand sanji break rib gin however come term realize not strength kill man save malnutrition begs krieg leave baratie alone krieg disgust show emotion ghin longer member krieg pirate krieg decides execute pull one shoulder pad attache hand turn launcher one deadly weapon poison gas bomb even krieg pirate shocked mean execution quick put mask except gin throw water baratie chef swim away patty carne run inside zeff luffy attempt make beeline krieg throw back needle gun conceal launcher shoulder pad krieg fire luffy steal two mask two krieg pirate throw sanji gin turn round get another pirate vanish sea begin panic explodes"
}