{
    "title": "29 28 29 \"The Crack of Don\"\"The Conclusion of the Deadly Battle! A Spear of Blind Determination!\"Transliteration: \"Shitō no Ketchaku! Hara ni Kukutta Ippon no Yari!\" (Japanese:決闘の決着!腹にくくった1本の槍!) Junichi Fujise Junki Takegami 1010.6 June 21, 2000(2000-06-21)[55] April 9, 2005[56]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_1",
    "transformers_text": "29 28 29 The Crack of Don The Conclusion of the Deadly Battle A Spear of Blind Determination Transliteration Shit no Ketch aku Hara ni Kuku tt a Ip pon no Yar i Japanese 1 Junichi Fuji se Junk i Take gam i 1010 6 June 21 2000 2000 06 21 55 April 9 2005 56 Luffy continues battling Krieg who retreats up a mast Luffy follows and knocks him into the air while Krieg drops explosives to bring down the mast Luffy un fazed punches through Krieg's armour while Krieg ensnares him in a net to bring them both down Luffy frees his limbs corkscrews himself around Krieg's head with his feet and slams him into the deck Sanji dives to save Luffy from drowning After the battle ends in Luffy's favour Gh in resolves to take Krieg's ambition to sail the Grand Line as his own He subdues Krieg who was on a delirious rampage and leads the crew away with ambitions of his own supposing he survives his poisoning Elsewhere Nami expresses remorse for leaving and hopes she can sail with the others again",
    "tf_idf_text": "crack conclusion deadly battle spear blind determination transliteration shit ketch aku hara kuku pon yar japanese junichi fuji junk take gam june april luffy continue battle krieg retreat mast luffy follow knock air krieg drop explosive bring mast luffy faze punch kriegs armour krieg ensnares net bring luffy free limbs corkscrew around kriegs head foot slams deck sanji dive save luffy drown battle end luffys favour resolve take kriegs ambition sail grand line subdues krieg delirious rampage lead crew away ambition suppose survives poison elsewhere nami express remorse leave hope sail others"
}