{
    "title": "2 2 2 \"Roronoa Zoro: Pirate Hunter\"\"Enter the Great Swordsman! Pirate Hunter Roronoa Zoro!\"Transliteration: \"Daikengō Arawaru! Kaizokugari Roronoa Zoro\" (Japanese:大剣豪現る!海賊狩りロロノア·ゾロ) Tetsuji Nakamura Michiru Shimada 911.7 November 17, 1999(1999-11-17)[7] September 25, 2004[8]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_1",
    "transformers_text": "2 2 2 \"Roronoa Zoro: Pirate Hunter\"\"Enter the Great Swordsman! Pirate Hunter Roronoa Zoro!\"Transliteration: \"Daikengō Arawaru! Kaizokugari Roronoa Zoro\" (Japanese:大剣豪現る!海賊狩りロロノア·ゾロ) Tetsuji Nakamura Michiru Shimada 911.7 November 17, 1999(1999-11-17)[7] September 25, 2004[8]\n\nLuffy and Coby arrive at a place with a large Marine base, where Luffy discovers the great swordsman, the \"Pirate Hunter\"Roronoa Zorotied to a pole. Rika, a young girl, offers Zoro somerice ballsthat she made herself.Helmeppo, the son of Marine Captain Morgan, discovers this and has Rika thrown out. Luffy asks Zoro to join his crew, but Zoro refuses and has Luffy give him the rice balls. Luffy and Coby meet Rika in town, who is happy to hear that Zoro enjoyed the rice balls. She tells them how Helmeppo brought his vicious pet dog into their bar and that Zoro knocked it out to protect everyone inside. He then made a deal with Helmeppo: if he can survive being tied to a pole with no food or water for thirty days, then Helmeppo will spare the little girl and her mother. However, Helmeppo says that he will execute Zoro the next day despite his word. Luffy punches him, and Helmeppo runs off to tell his father. While Luffy invades the Navy base to find Zoro's swords, Coby attempts to untie Zoro and explains the situation to him. Morgan orders that they are both to be executed. The soldiers open fire, but before the bullets can reach them, Luffy leaps from the base and uses his rubber body to block the bullets.",
    "tf_idf_text": "roronoa zoro pirate hunterenter great swordsman pirate hunter roronoa zorotransliteration daikeng arawaru kaizokugari roronoa zoro japanese tetsuji nakamura michiru shimada november september luffy coby arrive place large marine base luffy discover great swordsman pirate hunterroronoa zorotied pole rika young girl offer zoro somerice ballsthat make herselfhelmeppo son marine captain morgan discovers rika thrown luffy ask zoro join crew zoro refuse luffy give rice ball luffy coby meet rika town happy hear zoro enjoy rice ball tell helmeppo brought vicious pet dog bar zoro knock protect everyone inside make deal helmeppo survive tie pole food water thirty day helmeppo spare little girl mother however helmeppo say execute zoro next day despite word luffy punch helmeppo run tell father luffy invades navy base find zoros sword coby attempt untie zoro explain situation morgan order execute soldier open fire bullet reach luffy leap base use rubber body block bullet"
}