{
    "title": "36 34b 36 \"The Belle of the Brawl\"\"Survive! Mother Bellemere and Nami's Bond!\"Transliteration: \"Ikinuke! Haha Berumēru to Nami no Kizuna!\" (Japanese:生き抜け!母ベルメールとナミの絆!) Kōnosuke Uda Michiru Shimada 512.2 August 9, 2000(2000-08-09)[68] May 21, 2005",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_1",
    "transformers_text": "36 34b 36 \"The Belle of the Brawl\"\"Survive! Mother Bellemere and Nami's Bond!\"Transliteration: \"Ikinuke! Haha Berumēru to Nami no Kizuna!\" (Japanese:生き抜け!母ベルメールとナミの絆!) Kōnosuke Uda Michiru Shimada 512.2 August 9, 2000(2000-08-09)[68] May 21, 2005\n\nNojiko continues her story, explaining how their life was ruined when the Arlong Pirates first took over the village. Arlong forces the villagers to pay him in tribute or be killed (100,000 berries per adult and 50,000 per child). When the Fishmen arrive at Bellemere's house, she tries to fight back but is easily subdued. Having only 100,000 berries, Bellemere uses it to save Nami and Nojiko, which results in Arlong killing her. Seeing a map skillfully drawn by Nami, Arlong kidnaps her and shanghaies her into joining the Arlong Pirates to make maps and charts for them. Arlong does make a deal with Nami: if she can gather 100,000,000 berries for him, Arlong will free Cocoyashi Village. It is shown that for the last eight years Nami has stolen countless amounts of money from other pirates, thus explaining why she stole theGoing Merryfrom the Straw Hats.",
    "tf_idf_text": "belle brawlsurvive mother bellemere namis bondtransliteration ikinuke haha berumru nami kizuna japanese knosuke uda michiru shimada august may nojiko continue story explain life ruin arlong pirate first take village arlong force villager pay tribute kill berry per adult per child fishmen arrive bellemeres house try fight back easily subdue berry bellemere us save nami nojiko result arlong kill see map skillfully draw nami arlong kidnaps shanghaies join arlong pirate make map chart arlong make deal nami gather berry arlong free cocoyashi village show last eight year nami steal countless amount money pirate thus explain stole thegoing merryfrom straw hat"
}