{
    "title": "36 34b 36 \"The Belle of the Brawl\"\"Survive! Mother Bellemere and Nami's Bond!\"Transliteration: \"Ikinuke! Haha Berumēru to Nami no Kizuna!\" (Japanese:生き抜け!母ベルメールとナミの絆!) Kōnosuke Uda Michiru Shimada 512.2 August 9, 2000(2000-08-09)[68] May 21, 2005",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_1",
    "transformers_text": "36 34 b 36 The Belle of the Brawl Survive Mother Belle mere and Nami's Bond Transliteration Iki nuke Hah a Be rum ru to Nami no Ki zun a Japanese K no suke Uda Michiru Shimada 512 2 August 9 2000 2000 08 09 68 May 21 2005 No ji ko continues her story explaining how their life was ruined when the Ar long Pirates first took over the village Ar long forces the villagers to pay him in tribute or be killed 100 000 berries per adult and 50 000 per child When the Fish men arrive at Belle mere's house she tries to fight back but is easily subdued Having only 100 000 berries Belle mere uses it to save Nami and No ji ko which results in Ar long killing her Seeing a map skillfully drawn by Nami Ar long kidnaps her and shanghai es her into joining the Ar long Pirates to make maps and charts for them Ar long does make a deal with Nami if she can gather 100 000 000 berries for him Ar long will free Coco yash i Village It is shown that for the last eight years Nami has stolen countless amounts of money from other pirates thus explaining why she stole the Going Merry from the Straw Hats",
    "tf_idf_text": "belle brawl survive mother belle mere namis bond transliteration iki nuke hah rum nami zun japanese suke uda michiru shimada august may continue story explain life ruin long pirate first take village long force villager pay tribute kill berry per adult per child fish men arrive belle mere house try fight back easily subdue berry belle mere us save nami result long kill see map skillfully draw nami long kidnaps shanghai join long pirate make map chart long make deal nami gather berry long free coco yash village show last eight year nami steal countless amount money pirate thus explain stole go merry straw hat"
}