{
    "title": "4 4 4 \"The Passing Of The Hat\"\"Luffy's Past! Enter Red-Haired Shanks!\"Transliteration: \"Rufi no Kako! Akagami no Shankusu Tōjō\" (Japanese:ルフィの過去!赤髪のシャンクス登場) Munehisa Sakai Junki Takegami 912.9 December 8, 1999(1999-12-08)[11] October 9, 2004[12]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_1",
    "transformers_text": "4 4 4 \"The Passing Of The Hat\"\"Luffy's Past! Enter Red-Haired Shanks!\"Transliteration: \"Rufi no Kako! Akagami no Shankusu Tōjō\" (Japanese:ルフィの過去!赤髪のシャンクス登場) Munehisa Sakai Junki Takegami 912.9 December 8, 1999(1999-12-08)[11] October 9, 2004[12]\n\nIn a flashback, a seven-year-old young Luffy sits in a bar filled with the pirate crew of the \"Red-Haired\" Shanks, begging him to take him out to sea. But the pirate captain laughs and refuses. A bandit named Higuma enters and orders several barrels of booze. Shanks offers him the last bottle but Higuma smashes it and humiliates Shanks. After the bandit leaves the bar, all of the pirates start to laugh. Luffy is angered by the crew's laughs and Shanks' passivity, and in a huff, eats a purple fruit lying on the bar. Shanks notices and tries to make Luffy spit it out, but it is too late. An enraged Shanks tells Luffy that he just ate the Gum-Gum Fruit, aDevil Fruit, and now he is a rubber human who won't be able to ever swim again. Later, Luffy gets attacked by Higuma and his bandits. He is about to be killed, when Shanks and his crew arrive and effortlessly defeat Higuma's men. Frightened, Higuma throws down a smoke bomb and makes his escape, taking Luffy with him. He flees out to sea in a boat. As he throws Luffy into the water and laughs at his plight, a Sea King appears behind him and devours him whole. The sea monster then goes for Luffy, but Shanks stops the sea monster as it takes a bite, and with one look, drives the beast away. Luffy clutches Shanks and starts crying, since Shanks' arm was bitten off by the creature. Shanks replies that it is fine, as long as Luffy is safe. As the pirates get ready to leave, Luffy decides he will become a pirate on his own, that he will gather a own crew that will beat Shanks' crew, and that he will become King of the Pirates. Shanks gives his straw hat to Luffy and promises him to return it some day, as a great pirate. Back in the present, Luffy slingshots into the sky to catch a bird. Instead he is caught himself. Zoro, now alone in their boat, tries to keep up, paddling. On his way he picks up three castaways from Buggy the Clown's crew. The bird, carrying Luffy, flies over a town, where it is shot down by Buggy's men. Luffy falls and lands right in front of Nami, who is running away from Buggy's crew after stealing their precious map to the Grand Line.",
    "tf_idf_text": "pass hatluffys past enter redhaired shankstransliteration rufi kako akagami shankusu japanese munehisa sakai junki takegami december october flashback sevenyearold young luffy sit bar fill pirate crew redhaired shank beg take sea pirate captain laugh refuse bandit name higuma enters order several barrel booze shank offer last bottle higuma smash humiliate shank bandit leave bar pirate start laugh luffy anger crew laugh shank passivity huff eat purple fruit lie bar shank notice try make luffy spit late enrage shank tell luffy ate gumgum fruit adevil fruit rubber human wont able ever swim later luffy get attack higuma bandit kill shank crew arrive effortlessly defeat higumas men frighten higuma throw smoke bomb make escape take luffy flees sea boat throw luffy water laugh plight sea king appear behind devours whole sea monster go luffy shank stop sea monster take bite one look drive beast away luffy clutch shank start cry since shank arm bitten creature shank reply fine long luffy safe pirate get ready leave luffy decide become pirate gather crew beat shank crew become king pirate shank give straw hat luffy promise return day great pirate back present luffy slingshot sky catch bird instead catch zoro alone boat try keep paddle way pick three castaway buggy clown crew bird carry luffy fly town shot buggy men luffy fall land right front nami run away buggys crew steal precious map grand line"
}