{
    "title": "52 42b43a 52 \"Sanji Sizzles\" / \"Buggy's Back\"\"Buggy's Revenge! The Man Who Smiles On the Execution Platform!\"Transliteration: \"Bagī no Ribenji! Shokeidai de Warau Otoko!\" (Japanese:バギーのリベンジ!処刑台で笑う男!) Hidehiko Kadota Michiru Shimada 514.7 December 13, 2000(2000-12-13)[90] July 16, 2005",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_1",
    "transformers_text": "52 42 b 43 a 52 Sanji Sizzles Buggy's Back Buggy's Revenge The Man Who Smiles On the Execution Platform Transliteration Bag no Ri benji Sho kei dai de War au O toko Japanese Hidehiko Ka dota Michiru Shimada 514 7 December 13 2000 2000 12 13 90 July 16 2005 Zoro and Sanji show up too late to stop Buggy but a bolt of lightning shows up Buggy just in time to cancel the execution Then Smoker catches Buggy and Al vida and gets on a Dune Buggy to follow Luffy Meanwhile Luffy Zoro and Sanji run into T as hig i Zoro defeats her reluctantly Then Smoker catches up and tells Luffy that he must get through him to go to the Grand Line Luffy isn't able to effectively fight Smoker due to the latter's Plume Plume Fruit powers allowing him to turn into smoke Just when Smoker is about to finish off Luffy a mysterious man with a green cloak named Dragon saves him A green gust of wind blows through that lets Buggy and Al vida escape Then Luffy and company can get away Smoker T as hig i Al vida and Buggy all depart to chase the Straw Hats into the Grand Line",
    "tf_idf_text": "sanji sizzle buggys back buggys revenge man smile execution platform transliteration bag benji sho kei dai war toko japanese hidehiko dota michiru shimada december july zoro sanji show late stop buggy bolt lightning show buggy time cancel execution smoker catch buggy vida get dune buggy follow luffy meanwhile luffy zoro sanji run hig zoro defeat reluctantly smoker catch tell luffy must get grand line luffy isnt able effectively fight smoker due latter plume plume fruit power allow turn smoke smoker finish luffy mysterious man green cloak name dragon save green gust wind blow let buggy vida escape luffy company get away smoker hig vida buggy depart chase straw hat grand line"
}