{
    "title": "5 5 5 \"The Circus Comes To Town\"\"A Terrifying Mysterious Power! Captain Buggy, the Clown Pirate!\"Transliteration: \"Kyōfu Nazo no Chikara! Kaizoku Dōke Bagī-senchō!\" (Japanese:恐怖!謎の力·海賊道化バギー船長!) Junichi Fujise Junki Takegami 813.5 December 15, 1999(1999-12-15)[13] October 16, 2004[14]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_1",
    "transformers_text": "5 5 5 \"The Circus Comes To Town\"\"A Terrifying Mysterious Power! Captain Buggy, the Clown Pirate!\"Transliteration: \"Kyōfu Nazo no Chikara! Kaizoku Dōke Bagī-senchō!\" (Japanese:恐怖!謎の力·海賊道化バギー船長!) Junichi Fujise Junki Takegami 813.5 December 15, 1999(1999-12-15)[13] October 16, 2004[14]\n\nNami pretends that Luffy is her boss, using the distraction to escape from Buggy's men. After Luffy beats them, she asks him to join her. Then Luffy finds out that she is a navigator, and asks her to join his crew of pirates. But as she hates pirates, she refuses. Then she tricks Luffy into letting himself be tied up and brought to Buggy, where he is locked up in a small cage, while Nami fakes joining Buggy's crew. As proof of loyalty, Buggy demands that Nami kill Luffy, but she cannot bring herself to do it. As Buggy's pirates attack her, Zoro arrives to save his captain and her. Buggy recognizes Zoro as the pirate hunter and attacks him. Zoro cuts Buggy into pieces. Believing Buggy to be dead, he sheaths his swords and is stabbed in the back by Buggy, who reveals he ate the Chop-Chop Fruit and can separate his body and is impervious to being cut. The wound puts Zoro at a disadvantage. He picks up the cage with Luffy inside and the three escape.",
    "tf_idf_text": "circus come towna terrify mysterious power captain buggy clown piratetransliteration kyfu nazo chikara kaizoku dke bagsench japanese junichi fujise junki takegami december october nami pretend luffy bos use distraction escape buggy men luffy beat ask join luffy find navigator asks join crew pirate hat pirate refuse trick luffy let tie brought buggy lock small cage nami fake join buggy crew proof loyalty buggy demand nami kill luffy cannot bring buggys pirate attack zoro arrives save captain buggy recognize zoro pirate hunter attack zoro cut buggy piece believe buggy dead sheath sword stab back buggy reveals eat chopchop fruit separate body impervious cut wound put zoro disadvantage pick cage luffy inside three escape"
}