{
    "title": "9 9 9 \"The Teller of Tales\"\"The Honorable Liar? Captain Usopp!\"Transliteration: \"Seigi no Usotsuki? Kyaputen Usoppu\" (Japanese:正義のうそつき?キャプテンウソップ) Hidehiko Kadota Junki Takegami 811.4 January 12, 2000(2000-01-12)[18] November 13, 2004[19]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_1",
    "transformers_text": "9 9 9 \"The Teller of Tales\"\"The Honorable Liar? Captain Usopp!\"Transliteration: \"Seigi no Usotsuki? Kyaputen Usoppu\" (Japanese:正義のうそつき?キャプテンウソップ) Hidehiko Kadota Junki Takegami 811.4 January 12, 2000(2000-01-12)[18] November 13, 2004[19]\n\nWhen Luffy, Zoro, and Nami land on another island, Usopp appears to greet them, with three children hiding in the bushes. After a failed attempt on Usopp's part to scare the pirates away, they talk about Shanks and his marksman Yasopp, Usopp's father. Usopp brings them to a restaurant, where after a meal, he leaves them to head for a mansion outside town. The mansion belongs to Kaya, a sickly young woman. She and Klahadore, her butler, talk about Usopp and Klahadore forbids her to see him. Usopp comes anyway and he tells Kaya a story about fighting a giant goldfish with droppings the size of islands. Back at the restaurant, Usopp's small friends, the Usopp Pirates enter in search of their captain. They bring Luffy, Zoro, and Nami to Kaya's mansion, and tell them how Usopp tells Kaya lies to cheer her up since her parents died and she became ill. Luffy decides they should ask her for a ship and as there are bodyguards guarding the gate, he slingshots the whole group over the fence. They crash into the ground near Usopp, and as they get up, Klahadore comes out and calls them intruders.",
    "tf_idf_text": "teller talesthe honorable liar captain usopptransliteration seigi usotsuki kyaputen usoppu japanese hidehiko kadota junki takegami january november luffy zoro nami land another island usopp appear greet three child hide bush fail attempt usopps part scare pirate away talk shank marksman yasopp usopps father usopp bring restaurant meal leave head mansion outside town mansion belong kaya sickly young woman klahadore butler talk usopp klahadore forbids see usopp come anyway tells kaya story fight giant goldfish droppings size island back restaurant usopps small friend usopp pirate enter search captain bring luffy zoro nami kayas mansion tell usopp tell kaya lie cheer since parent die become ill luffy decides ask ship bodyguard guard gate slingshot whole group fence crash ground near usopp get klahadore come call intruder"
}