{
    "title": "November 27, 2004[23]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_1",
    "transformers_text": "November 27, 2004[23]\n\nZoro, Nami, and the Usopp Pirates are still waiting around for Luffy and Usopp. The Usopp Pirates mention how Usopp always goes to the coast. They then spot Usopp running up to them, but he does not respond to any of their questions and runs right past them. Usopp is unable to convince the villagers that pirates are coming and that they have to abandon their homes. Meanwhile, Zoro and the others find Luffy. At Kaya's mansion, Merry shows Kaya the glasses that she got him to buy for Klahadore's third year of being a caretaker. Usopp is unable to convince Kaya of Kuro's assassination attempt and leaves, but gets shot by Merry in the process. Kuro announces his plans to attack the village at dawn. At sunset, Usopp remembers the stories he would tell Kaya, when Luffy and the Usopp Pirates arrive. Usopp tells them about Kuro's plan, but then says that he was joking about it. The Usopp pirates abandon him. Nami asks Usopp why he said he made everything up. Usopp replies that it is because he is a liar. He says how he loves the village and wants to protect it, so he will stand against the pirates. Luffy, Zoro, and Nami decide to join him, and so Usopp stands up, declaring that even though he is scared, he will fight.",
    "tf_idf_text": "november zoro nami usopp pirate still wait around luffy usopp usopp pirate mention usopp always go coast spot usopp run not respond question run right past usopp unable convince villager pirate come abandon home meanwhile zoro others find luffy kayas mansion merry show kaya glass get buy klahadores third year caretaker usopp unable convince kaya kuros assassination attempt leave get shot merry process kuro announces plan attack village dawn sunset usopp remembers story would tell kaya luffy usopp pirate arrive usopp tell kuros plan say joke usopp pirate abandon nami asks usopp say make everything usopp reply liar say love village want protect stand pirate luffy zoro nami decide join usopp stand declare even though scared fight"
}