{
    "title": "en.wikipedia.org_wiki_Wikipedia_Wikimedia_sister_projects",
    "url": "https://en.wikipedia.org/wiki/Wikipedia:Wikimedia_sister_projects",
    "transformers_text": "Wikimedia sister projects are all the publicly available wikis operated by the Wikimedia Foundation , including Wikipedia . This guideline covers Wikipedia's relations to the sister projects, including linking and copying content between a Wikipedia article and a sister project's article.\n\nWikipedia is written by volunteer editors and hosted by the Wikimedia Foundation , a non-profit organization that also hosts a range of other volunteer projects :\n\nThe above list of the current English language sister projects can be easily duplicated using the {{ Wikipedia's sister projects }} template.\n\nWikipedia encourages links from Wikipedia articles to pages on sister projects when such links are likely to be useful to our readers, and interlingual crosslinking to articles on foreign-language editions of Wikipedia whenever such links are possible.\n\nBy far the most common use of links to the non-Wikipedia sister projects is the use of images that are stored on the Wikimedia Commons site (see Wikipedia:Wikimedia Commons ).\n\nFor example:\n\nLinks to sister projects are made in several ways:\n\nSister project links generally appear in the External links section (or the last section, whatever it is), rather than the body of the article. Wiktionary and Wikisource may be linked inline (e.g. to an unusual word or the text of a document being discussed).\n\nAppropriate material from Wikimedia Commons may also be included within the main body of an article. See Embedding Commons' media in Wikipedia articles . Links to Wikinews should not be made within the main body of an article, being made only as per the external links guideline .\n\nMost box-type templates such as {{ Commons }} shown at right should be put at the beginning of the last section of the article (which is usually, but not necessarily, the \"External links\" section) so that boxes will appear next to, rather than below, the list items. [ a ] Do not make a section whose sole content is box-type templates. Many box links can be unified to one by using {{ Sister project links }} or {{ Sister project }} .\n\nSometimes box-type templates are not aesthetically pleasing, either because there are no external links except sister project ones, or because they result in an odd layout, such as a long sequence of right-aligned boxes hanging off the bottom of the article or excessive white space when the section is laid out in columns. In such cases, consider using \"inline\" templates, such as {{ Commons-inline }} , in the \"External links\" section, so that links to sister projects appear as list items, like this:\n\nAnother alternative to box-type templates in the body of the article is a {{ Sister bar }} navbox at the end of the article. The sister links can be combined with portal links using {{ Subject bar }} .\n\nSister project links are normally made only once within an article, as with standard links to other Wikipedia articles .\n\nSometimes an entry is more appropriate on some other sister project than on Wikipedia because they are of a non-encyclopedic scope (e.g. they can never be expanded beyond a simple dictionary definition , or call for a level of detail more appropriate to a textbook ). Normally, such articles are copied to the more appropriate sister using the transwiki process, and deleted from Wikipedia afterwards.\n\nHowever, if a word or phrase is commonly wikified, it is quite likely that the deleted entry will be quickly re-created again by well-meaning users. The re-created article is likely to again become non-encyclopedic.\n\nTo avoid this, do seek deletion of the page (or suppress after transwiki'ing). One solution, as suggested by Wikipedia deletion policy , is to instead normally redirect the word to a relevant article within Wikipedia. For instance, Organize could redirect to a well-developed Organization article via #REDIRECT [[Organization]] .\n\nIf this is not possible, turn a Wikipedia page into a soft redirect to a sister project. The plain {{ soft redirect }} template should not be used in the mainspace . Instead, use one of the specialized templates (see below ). These templates inform readers of information on the sister project: in the case of this example, one link would be provided to the wikt:organize page. This has multiple benefits:\n\nWikipedia does not have an article on \"wikimedia sister projects\" , but its sister project Wiktionary does:\n\nYou can also:\n\nPlease keep in mind that only topics with a less-than-encyclopedic scope that are commonly wikified words or that are repeatedly recreated should become soft redirects. We don't need a soft redirect for every possible word or phrase to be included in Wikipedia.\n\nMainspace exclusive\n\nUnified login is a mechanism which allows users to use a single login across the majority of the Wikimedia Foundation 's sister projects. This allows users to maintain a consistent identity throughout Wikimedia, following a single sign-up. Other advantages of this mechanism include the removal of the threat that impersonation poses and the ability to visit many projects without having to go through the labors of logging in everywhere. Users can create a unified login by visiting Special:MergeAccount on a project where they already have an account, and following the prompts.\n\nYes, you can copy parts of one sister project into another, but you must link to the source article in your edit summary . The exact edit summary and attribution required depends on how the sister project was licensed, see WP:SISTERCOPY for more detailed instructions. If the material is translated from another language, see WP:TFOLWP for instructions.",
    "tf_idf_text": "wikimedia sister project publicly available wikis operate wikimedia foundation include wikipedia guideline cover wikipedias relation sister project include link copying content wikipedia article sister project article wikipedia write volunteer editor host wikimedia foundation nonprofit organization also host range volunteer project list current english language sister project easily duplicate use wikipedias sister project template wikipedia encourages link wikipedia article page sister project links likely useful reader interlingual crosslinking article foreignlanguage edition wikipedia whenever link possible far common use link nonwikipedia sister project use image store wikimedia common site see wikipediawikimedia common example link sister project make several way sister project link generally appear external link section last section whatever rather body article wiktionary wikisource may link inline unusual word text document discuss appropriate material wikimedia common may also include within main body article see embed common medium wikipedia article link wikinews not make within main body article make per external link guideline boxtype template common show right put begin last section article usually not necessarily external link section box appear next rather list item not make section whose sole content boxtype templates many box link unify one use sister project link sister project sometimes boxtype template not aesthetically please either external link except sister project one result odd layout long sequence rightaligned box hang bottom article excessive white space section lay column case consider use inline template commonsinline external link section link sister project appear list item like another alternative boxtype template body article sister bar navbox end article sister link combine portal link use subject bar sister project link normally make within article standard link wikipedia article sometimes entry appropriate sister project wikipedia nonencyclopedic scope never expand beyond simple dictionary definition call level detail appropriate textbook normally article copied appropriate sister use transwiki process delete wikipedia afterwards however word phrase commonly wikified quite likely deleted entry quickly recreate wellmeaning user recreate article likely become nonencyclopedic avoid seek deletion page suppress transwikiing one solution suggest wikipedia deletion policy instead normally redirect word relevant article within wikipedia instance organize could redirect welldeveloped organization article via redirect organization not possible turn wikipedia page soft redirect sister project plain soft redirect template not use mainspace instead use one specialized template see template inform reader information sister project case example one link would provide wiktorganize page multiple benefit wikipedia not article wikimedia sister project sister project wiktionary also please keep mind topic lessthanencyclopedic scope commonly wikified word repeatedly recreate become soft redirects dont need soft redirect every possible word phrase include wikipedia mainspace exclusive unified login mechanism allow user use single login across majority wikimedia foundation sister project allow user maintain consistent identity throughout wikimedia follow single signup advantage mechanism include removal threat impersonation pose ability visit many project without labor log everywhere user create unified login visit specialmergeaccount project already account follow prompt yes copy part one sister project another must link source article edit summary exact edit summary attribution require depend sister project license see wpsistercopy detailed instruction material translate another language see wptfolwp instruction"
}