{
    "title": "en.wikipedia.org_wiki_Harukaze_Mound",
    "url": "https://en.wikipedia.org/wiki/Harukaze_Mound",
    "transformers_text": "Harukaze Mound ( Japanese : ハルカゼマウンド , Hepburn : Harukaze Maundo ) is a Japanese manga series written by Togo Goto and illustrated by Kento Matsuura. It was originally a one-shot published in Shueisha 's Weekly Shōnen Jump magazine 33rd issue in 2022, before being serialized in the same magazine starting in June 2025.\n\nWhen they were young, twin brothers Aokaze and Nagiharu Kuzumi promised to play baseball together at Kōshien . In middle school, right-handed Aokaze, the younger brother, blossoms into a top pitching prospect recruited to Hojitsu, while left-handed Nagiharu trails in his shadow. With insight from brilliant catcher Ibuki Hayama, Nagiharu develops a completely different submarine style and follows Ibuki as a battery to a team of \"outsiders\" at Hinazakura High School rather than Hojitsu.\n\nWritten by Togo Goto and illustrated by Kento Matsuura, Harukaze Mound was initially a one-shot published in Shueisha 's Weekly Shōnen Jump magazine 33rd issue in 2022, before being serialized in the same magazine starting in June 2025. [ 1 ] For its serialization debut, the series was featured on the cover of Jump and a promotional video was published. [ 2 ] As of November 2025 [update] , the chapters have been collected into one tankōbon volume.\n\nThese chapters have yet to be published in a tankōbon volume.",
    "tf_idf_text": "harukaze mound japanese hepburn harukaze maundo japanese manga series write togo goto illustrate kento matsuura originally oneshot publish shueisha weekly shnen jump magazine issue serialize magazine start june young twin brother aokaze nagiharu kuzumi promise play baseball together kshien middle school righthanded aokaze young brother blossom top pitching prospect recruit hojitsu lefthanded nagiharu trails shadow insight brilliant catcher ibuki hayama nagiharu develop completely different submarine style follow ibuki battery team outsider hinazakura high school rather hojitsu write togo goto illustrate kento matsuura harukaze mound initially oneshot publish shueisha weekly shnen jump magazine issue serialize magazine start june serialization debut series feature cover jump promotional video publish november update chapter collect one tankbon volume chapter yet publish tankbon volume"
}