{
    "title": "en.wikipedia.org_wiki_Kagurabachi",
    "url": "https://en.wikipedia.org/wiki/Kagurabachi",
    "transformers_text": "Kagurabachi ( カグラバチ ) is a Japanese manga series written and illustrated by Takeru Hokazono . It has been serialized in Shueisha 's shōnen manga magazine Weekly Shōnen Jump since September 2023, with its chapters collected in nine tankōbon volumes as of October 2025 [update] .\n\nThe series follows Chihiro Rokuhira, a bearer of a unique and powerful katana called \"Enten\", one of the seven Enchanted Blades created by his father, Kunishige Rokuhira. Driven by vengeance, he embarks on a quest to avenge his father's murder and reclaim the six other stolen Enchanted Blades, which were taken by a sinister group of sorcerers.\n\nBy October 2025, the manga had sold over 3 million copies. In 2024, the series won the 10th Next Manga Award in the print category.\n\nChihiro Rokuhira is the son of Kunishige Rokuhira, a renowned blacksmith who crafted six extraordinary katana —known as the \"Enchanted Blades\"—forged from the rare ore Datenseki ( 雫天石 ) . These blades played a pivotal role in ending the Seitei War. After years of living in secrecy, the Rokuhira family is hunted down by the Hishaku, a ruthless criminal syndicate of sorcerers, who murder Kunishige and steal the Enchanted Blades. Wielding Enten, a seventh and hidden Enchanted Blade, Chihiro sets out on a brutal quest of vengeance—to annihilate the Hishaku and reclaim his father's stolen legacy.\n\nThe Kamunabi ( 神奈備 ) is a government-backed agency of sorcerers founded during the Seitei War ( 斉廷戦争 , Seitei Sensō ) to combat threats endangering Japan as a whole, unlike civilian sorcerers who handle smaller-scale conflicts. It replaced the Counter-Sorcery Army ( 対魔術軍 , Tai Majutsu-Gun ) , abandoning its military hierarchy to focus on countering sorcerers from a hostile island nation. The Kamunabi's current priority is securing the Enchanted Blades to maintain national stability. For three years, they have been locked in conflict with the Hishaku, who possess the blades but cannot wield them due to preexisting contracts. The Kamunabi safeguards the blades' rightful bearers, preventing the Hishaku from exploiting their power.\n\nThe Anti-Cloud Gouger Special Forces ( 対クラウドガウガー特殊部隊 , Tai Kuraudo Gaugā Tokushu Butai ) was a squadron of six elite fighters within the Kamunabi who were tasked with opposing Genichi Sojo and the Enchanted Blade Cloud Gouger he wielded. Only two survived the battle against Sojo.\n\nThe Masumi ( 巻墨 ) are a ninja clan loyal to the Kamunabi, known for their willingness to die for their master. Three members—Ro, Moku, and Sumi—guard Seiichi Samura at Senkutsuji Temple after Kunishige Rokuhira's death. When the Hishaku attack, they suppress sound and scent to aid Samura, who fights using his keen sense of hearing. Though prepared to sacrifice themselves for his escape, Samura refuses and later rescues them, releasing them from service. After his betrayal, they join Chihiro to oppose Samura and protect his daughter Iori in \"Operation: Easy Does It\".\n\nThe Enchanted Blade Bearers are elite swordsmen selected by Kunishige Rokuhira to wield his blades during the Seitei War. Their prowess secured Japan's victory against an island nation skilled in wielding the Datenseki, earning them public acclaim as war heroes. After the conflict, they concealed themselves for safety. When Kunishige and the bearer Ibuki Misaka are killed by the Hishaku, the Kamunabi places the survivors under heavy guard. Among them, Seiichi Samura seeks to eliminate the remaining bearers—and himself—to atone for their concealed wartime crimes, which remain unknown to the public.\n\nThe Hishaku ( 毘灼 ) are a secretive group of ten elite sorcerers who murdered Kunishige Rokuhira and stole his six Enchanted Blades. Recognizable by flame-emblem tattoos, they wield fire-based teleportation sorcery. Two blades are distributed—Cloud Gouger to Genichi Sojo and Shinuchi sold through the Sazanami Clan. Allied with underworld factions like the Korogumi Yakuza and aided by a Kamunabi insider, they spend three years targeting Kamunabi fortresses to sever bearers' contracts. Though forming a truce with Seiichi Samura, the Hishaku anticipate his betrayal, attacking the Kamunabi's Tokyo headquarters while others attempt to kidnap his daughter. They later exploit blackmailed Kamunabi personnel to destabilize the organization.\n\nThe Sazanami Clan ( 漣家 , Sazanami-ke ) is a powerful criminal clan of sorcerers who are the proprietors of the Rakuzaichi, an annual auction of black market artifacts and weapons, as well as people which serves as a highly popular fixture in the Japanese underworld, and have administered this auction for over 200 years.\n\nThe Tou ( 濤 , Tō ) , also known as the Special Defense Corp ( 特別防衛隊 , Tokubetsu Bōei-Tai ) , is a small group of the four best fighters in the Sazanami Clan. Their duties are to follow the commands of the clan head and protect the Rakuzaichi.\n\nWritten and illustrated by Takeru Hokazono , Kagurabachi began serialization in Shueisha 's shōnen manga magazine Weekly Shōnen Jump on September 19, 2023. [ 3 ] [ 1 ] The first tankōbon volume was released on February 2, 2024. [ 4 ] As of October 3, 2025, nine volumes have been released. [ 5 ]\n\nViz Media and Shueisha's Manga Plus platform are publishing the series in English. [ 6 ] In March 2024, Viz Media announced the print release of the manga. [ 7 ] The first volume was released on November 5, 2024. [ 8 ]\n\nThese chapters have yet to be published in a tankōbon volume.\n\nOn December 2, 2024, Toyo Keizai Online reported that Kagurabachi will get an anime adaptation by CygamesPictures , through a joint production by CyberAgent and Shochiku . No further details were provided at the time of the report. [ 22 ]\n\nUpon release, Kagurabachi surpassed series such as Spy × Family , Dragon Ball Super , and Boruto on Manga Plus ' s popularity ranking. Its sudden popularity amongst global readers was partially the result of numerous Internet memes , with many ironically considering it to be the inheritor of Weekly Shōnen Jump ' s \"Big Three\" ( One Piece , Naruto , and Bleach ). [ 23 ] Its first chapter was the world's most viewed in its first week of publication on Manga Plus , and the series received over 99 million page views on the platform by April 2024. [ 24 ]\n\nKagurabachi ranked seventh on AnimeJapan 's \"Most Wanted Anime Adaptation\" poll in 2024. [ 25 ] [ 26 ] It ranked 22nd on the 2024 \"Book of the Year\" list by Da Vinci magazine. [ 27 ] It ranked sixth on Takarajimasha 's Kono Manga ga Sugoi! list of best manga of 2025 for male readers. [ 28 ]\n\nThe series has been recommended by manga creators Kōhei Horikoshi and Masashi Kishimoto , and the musician Vaundy . [ 29 ] [ 30 ] [ 31 ]\n\nBy July 2024, the manga had over 350,000 copies in circulation (including digital copies); [ 32 ] over 600,000 copies in circulation by August 2024; [ 33 ] over 1 million copies in circulation by October 2024; [ 34 ] over 1.3 million copies in circulation by December 2024; [ 35 ] and over 2.2 million copies in circulation by May 2025. [ 36 ] By October 2025, the manga had sold over 3 million copies. [ 37 ]\n\nIn North America, the volumes of Kagurabachi were ranked on Circana (formerly NPD) BookScan 's monthly top 20 adult graphic novels list since November 2024. [ 38 ] They were also ranked on The New York Times ' Graphic Books and Manga bestseller monthly list since December 2024. [ 39 ]\n\nIn 2024, the manga won the 10th Next Manga Award in the print category, [ 40 ] and was also nominated for the 70th Shogakukan Manga Award . [ 41 ] In 2025, it was nominated for the 49th Kodansha Manga Award in the shōnen category [ 42 ] and for the Eisner Awards 's Best U.S. Edition of International Material—Asia category. [ 43 ]",
    "tf_idf_text": "kagurabachi japanese manga series write illustrated takeru hokazono serialize shueisha shnen manga magazine weekly shnen jump since september chapter collect nine tankbon volume october update series follow chihiro rokuhira bearer unique powerful katana call enten one seven enchant blade create father kunishige rokuhira drive vengeance embark quest avenge father murder reclaim six steal enchant blade take sinister group sorcerer october manga sell million copy series next manga award print category chihiro rokuhira son kunishige rokuhira renowned blacksmith craft six extraordinary katana know enchant bladesforged rare ore datenseki blade play pivotal role end seitei war year live secrecy rokuhira family hunt hishaku ruthless criminal syndicate sorcerer murder kunishige steal enchant blade wield enten seventh hidden enchant blade chihiro set brutal quest vengeanceto annihilate hishaku reclaim father steal legacy kamunabi governmentbacked agency sorcerer found seitei war seitei sens combat threat endanger japan whole unlike civilian sorcerer handle smallerscale conflict replace countersorcery army tai majutsugun abandon military hierarchy focus counter sorcerer hostile island nation kamunabis current priority securing enchant blade maintain national stability three year lock conflict hishaku possess blade cannot wield due preexist contract kamunabi safeguard blade rightful bearer prevent hishaku exploit power anticloud gouger special force tai kuraudo gaug tokushu butai squadron six elite fighter within kamunabi task oppose genichi sojo enchant blade cloud gouger wield two survive battle sojo masumi ninja clan loyal kamunabi know willingness die master three membersro moku sumiguard seiichi samura senkutsuji temple kunishige rokuhiras death hishaku attack suppress sound scent aid samura fight use keen sense hear though prepared sacrifice escape samura refuse later rescue release service betrayal join chihiro oppose samura protect daughter iori operation easy enchant blade bearer elite swordsman select kunishige rokuhira wield blade seitei war prowess secure japan victory island nation skilled wield datenseki earn public acclaim war hero conflict conceal safety kunishige bearer ibuki misaka kill hishaku kamunabi place survivor heavy guard among seiichi samura seek eliminate remain bearersand himselfto atone conceal wartime crime remain unknown public hishaku secretive group ten elite sorcerer murder kunishige rokuhira stole six enchant blade recognizable flameemblem tattoo wield firebased teleportation sorcery two blade distributedcloud gouger genichi sojo shinuchi sell sazanami clan ally underworld faction like korogumi yakuza aid kamunabi insider spend three year target kamunabi fortress sever bearer contract though form truce seiichi samura hishaku anticipate betrayal attack kamunabis tokyo headquarters others attempt kidnap daughter later exploit blackmail kamunabi personnel destabilize organization sazanami clan sazanamike powerful criminal clan sorcerer proprietor rakuzaichi annual auction black market artifact weapon well people serve highly popular fixture japanese underworld administer auction year tou also know special defense corp tokubetsu beitai small group four best fighter sazanami clan duty follow command clan head protect rakuzaichi write illustrated takeru hokazono kagurabachi begin serialization shueisha shnen manga magazine weekly shnen jump september first tankbon volume release february october nine volume release viz medium shueishas manga plus platform publishing series english march viz medium announce print release manga first volume release november chapter yet publish tankbon volume december toyo keizai online report kagurabachi get anime adaptation cygamespictures joint production cyberagent shochiku detail provide time report upon release kagurabachi surpass series spy family dragon ball super boruto manga plus popularity rank sudden popularity amongst global reader partially result numerous internet meme many ironically consider inheritor weekly shnen jump big three one piece naruto bleach first chapter world view first week publication manga plus series receive million page view platform april kagurabachi rank seventh animejapan want anime adaptation poll rank book year list vinci magazine rank sixth takarajimasha kono manga sugoi list best manga male reader series recommend manga creator khei horikoshi masashi kishimoto musician vaundy july manga copy circulation include digital copy copy circulation august million copy circulation october million copy circulation december million copy circulation may october manga sell million copy north america volume kagurabachi rank circana formerly npd bookscan monthly top adult graphic novel list since november also rank new york time graphic book manga bestseller monthly list since december manga next manga award print category also nominate shogakukan manga award nominate kodansha manga award shnen category eisner award best edition international materialasia category"
}