{
    "title": "en.wikipedia.org_wiki_One_Piece__Pirate_Warriors_3",
    "url": "https://en.wikipedia.org/wiki/One_Piece:_Pirate_Warriors_3",
    "transformers_text": "One Piece: Pirate Warriors 3 [ a ] is an action video game , developed by Omega Force and published by Bandai Namco Entertainment for PlayStation 3 , PlayStation 4 , PlayStation Vita , and Windows . The game is the sequel to One Piece: Pirate Warriors 2 , released in Japan on March 26, 2015 [ 1 ] and subsequently in the West on August 25, 2015. [ 2 ] [ 3 ] This is the last One Piece video game released for the PlayStation 3. An enhanced port for the Nintendo Switch was released in December 2017. [ 4 ] It is the third installment in the Pirate Warriors video-game series .\n\nA sequel, One Piece: Pirate Warriors 4 , was released in March 2020.\n\nThe plot of One Piece: Pirate Warriors 3 is very similar to that of the original One Piece series. The game’s story starts with Gol D. Roger ’s last words and execution, and then moves onto Red-Hair Shanks giving a young Luffy his straw hat before leaving his hometown. The game summarizes the series’ original storyline with entire arcs being condensed into a single mission, ending with the Dressrosa arc, which has an ending different than the original series. [ 5 ]\n\nThe gameplay is similar to the first two installments. A new feature is the Kizuna Rush, which summons another character alongside the player in battle to perform a combination attack. Up to four players can be summoned at once this way, with the finishing attacks becoming more powerful as more characters join.\n\nDuring the battle, one of the NPC support characters (known as Crew in the game) may become a Hero, which causes the Kizuna Gauge of the support character who is a hero to fill up more easily. Maxing out this support character's Kizuna Level and filling their Kizuna Gauge, will unleash their Hero Power. Each character (Playable & Support) have their own Hero Powers which produce different effects, such as causing a barrage (such as Fujitora causing a barrage of meteors, Sakazuki unleashing a barrage of magma, or Garp throwing a barrage of Cannonballs) that deals out damage to every enemy on a stage, restoring health of allied units (Chopper & Sanji's hero power), reducing the enemy units attack power by intimidating them (Zoro and Luffy's Hero Power), or inspiring allied units increasing their combat effectiveness and attack strength. However, tough enemies can also unleash their Hero Power which causes a stunned Gauge to appear over their head, and when the gauge reaches zero the enemy will be stunned causing their Hero Power to end.\n\nSome characters like Luffy, Usopp, and Sanji can use a special state called an Overdrive which allow them to use their signature power-up states like Gear Second, Sogeking, or Diable Jambe respectively when Kizuna Rush is activated. However these Overdrives are not automatically available and require specific Coins to unlock them. Also for most of the Logia users in the game, their Logia state acts as their Overdrive and unlike characters Luffy, Usopp, and Sanji these Overdrives do not need to be unlocked using Coins.\n\nThe main story mode, \"Legend Log\" mode features special cutscenes called \"Treasure Events\" which can be triggered under certain conditions (e.g. using a certain character, completing specific tasks, defeating a specific enemy, etc.).\n\nIn addition to the main story mode, there is also a \"Dream Log\" mode, in which characters and items are revealed and unlocked as the player progresses through the mode's semi-randomized battles. After the Final Island in Dream Log is completed a second harder version called \"Nightmare Log\" is unlocked.\n\nThe game features a \"Legend Diary\" that functions as an overall progress indicator. Achieving S-Ranks on levels, defeating bosses with Special Kizuna Attacks, and fulfilling other miscellaneous objectives gradually fills out the grid and rewards the player with coins that can be used to upgrade each character's stats, to unlock their second special attack, or unlock their overdrives (if they have one). The game also features \"Skill Posters\" for each character that allow the player to unlock various equipable skills by fulfilling certain conditions. All playable characters have a 50 Level Limit and in order to level up a character to Level 100 (the game's maximum level) one must obtain a set of Rare Coins (each character has their own set of coins required) to break their Level Limit.\n\nThe game features a total of 37 playable characters, including all 27 characters from the previous games. Other characters also appear as non-playable enemies .\n\nNewcomers to the series are marked in bold .\n\nIn December 2014, it was announced that One Piece: Pirate Warriors 3 would be released in Japan on March 26, 2015. Later that same month it was announced that the game would be coming to western territories at some point in 2015 with a Summer release scheduled for North America. Release dates were later announced to be at the end of August 2015 for both North America and the EU. Chris Gilbert, the senior vice president of sales and marketing at Bandai Namco Games America, said that \"The worldwide popularity of One Piece continues to grow due to the franchise's fantastic action, storytelling, and character development. One Piece: Pirate Warriors 3 's magical blend of hijinks and humor with Dynasty Warriors' frenetic gameplay style has produced a truly satisfying experience that One Piece fans will surely look forward to enjoying in the summer of 2015″. [ 6 ] In an interview, Hisashi Koinuma, Koei Tecmo's general director, explained why the game included the Dressrosa arc even though it had not yet been finished in the original manga series. He stated \"We came to this decision because rather than not having the Dressrosa arc in the game, we think fans would be excited to see the storyline even if parts of it were original for the game.\" He then said that they \"waited until the very end of development so the manga could go as long as it could until we needed to work on it.\" When Koji Nakajima, one of the game's producers, was asked about his thoughts on adding Red-Haired Shanks to the game, he stated \"there were restrictions when we created Shanks for One Piece: Pirate Warriors 3,\" due to some of Shanks’ moves not being fully described in the manga. [ 7 ]\n\nReview aggregator Metacritic , which gives games a weighted average score based on published critical reviews, gave the game's PlayStation 4 version a score of 74, [ 9 ] indicating \"mixed or average reviews\", whereas the PlayStation Vita version received a score of 76, indicating \"generally favorable reviews\". [ 10 ] Gaming Age said for the PlayStation Vita version, \"It's not often that a game will embrace its own ludicrousness and just be totally and completely ridiculous, but One Piece: Pirate Warriors 3 does just that\". [ 21 ] However, the PC port's reviews were more mixed, with a weighted average score of 62 on Metacritic. [ 8 ] Hardcore Gamer gave a positive review, describing the game as \"very playable\" but criticised it for being \"weak in technical terms\", [ 22 ] and one negative review came from Russian gaming website Riot Pixels , which criticised the graphics and porting issues, and stated that \"It all boils down to this: One Piece is just not a fun beat-'em-up game\". [ 23 ]\n\nJapanese gaming magazine Famitsu gave the game a positive rating of 36 out of 40. [ citation needed ] IGN awarded the game a score of 6.9 out of 10, saying \"Pirate Warriors 3 combines musou combat with One Piece's spirit intact, but it's bogged down by cutscenes.\" [ 24 ] Richard Eisenbeis of Kotaku gave the game a mixed review, praising the combat but criticizing the lack of innovation, describing it as \"an incredibly run-of-the-mill Dynasty Warriors.\" [ 25 ]\n\nBy February 2, 2016, One Piece: Pirate Warriors 3 sold 1 million units across different platforms. [ 26 ]\n\nThe Nintendo Switch version of One Piece: Pirate Warriors 3 sold 16,011 copies within its first week on sale in Japan. [ 27 ]",
    "tf_idf_text": "one piece pirate warrior action video game develop omega force publish bandai namco entertainment playstation playstation playstation vita window game sequel one piece pirate warrior release japan march subsequently west august last one piece video game release playstation enhance port nintendo switch release december third installment pirate warrior videogame series sequel one piece pirate warrior release march plot one piece pirate warrior similar original one piece series game story start gol roger last word execution move onto redhair shank give young luffy straw hat leave hometown game summarizes series original storyline entire arc condense single mission end dressrosa arc end different original series gameplay similar first two installment new feature kizuna rush summons another character alongside player battle perform combination attack four player summon way finish attack become powerful character join battle one npc support character know crew game may become hero cause kizuna gauge support character hero fill easily maxing support character kizuna level fill kizuna gauge unleash hero power character playable support hero power produce different effect cause barrage fujitora cause barrage meteor sakazuki unleashing barrage magma garp throw barrage cannonball deal damage every enemy stage restore health ally unit chopper sanjis hero power reduce enemy unit attack power intimidate zoro luffys hero power inspire allied unit increase combat effectiveness attack strength however tough enemy also unleash hero power cause stun gauge appear head gauge reach zero enemy stun cause hero power end character like luffy usopp sanji use special state call overdrive allow use signature powerup state like gear second sogeking diable jambe respectively kizuna rush activate however overdrive not automatically available require specific coin unlock also logia user game logia state act overdrive unlike character luffy usopp sanji overdrive not need unlocked use coin main story mode legend log mode feature special cutscenes call treasure event trigger certain condition use certain character complete specific task defeat specific enemy etc addition main story mode also dream log mode character item reveal unlocked player progress mode semirandomized battle final island dream log complete second harder version call nightmare log unlocked game feature legend diary function overall progress indicator achieve sranks level defeat boss special kizuna attack fulfil miscellaneous objective gradually fill grid reward player coin use upgrade character stats unlock second special attack unlock overdrive one game also feature skill poster character allow player unlock various equipable skill fulfil certain condition playable character level limit order level character level game maximum level one must obtain set rare coin character set coin required break level limit game feature total playable character include character previous game character also appear nonplayable enemy newcomer series mark bold december announce one piece pirate warrior would release japan march later month announce game would come western territory point summer release schedule north america release date later announce end august north america chris gilbert senior vice president sale marketing bandai namco game america say worldwide popularity one piece continue grow due franchise fantastic action storytelling character development one piece pirate warrior magical blend hijinks humor dynasty warrior frenetic gameplay style produce truly satisfy experience one piece fan surely look forward enjoy summer interview hisashi koinuma koei tecmos general director explain game include dressrosa arc even though not yet finish original manga series state come decision rather not dressrosa arc game think fan would excite see storyline even part original game say waited end development manga could long could need work koji nakajima one game producer ask thought add redhaired shank game state restriction create shank one piece pirate warrior due shank move not fully describe manga review aggregator metacritic give game weighted average score base publish critical review give game playstation version score indicate mixed average review whereas playstation vita version receive score indicate generally favorable review game age say playstation vita version not often game embrace ludicrousness totally completely ridiculous one piece pirate warrior however port review mixed weighted average score metacritic hardcore gamer give positive review describe game playable criticise weak technical term one negative review come russian gaming website riot pixel criticise graphic port issue state boil one piece not fun beatemup game japanese game magazine famitsu give game positive rating citation need ign award game score say pirate warrior combine musou combat one piece spirit intact bogged cutscenes richard eisenbeis kotaku give game mixed review praise combat criticize lack innovation describe incredibly runofthemill dynasty warrior february one piece pirate warrior sell million unit across different platform nintendo switch version one piece pirate warrior sell copy within first week sale japan"
}