{
    "title": "en.wikipedia.org_wiki_One_Piece__Grand_Battle!",
    "url": "https://en.wikipedia.org/wiki/One_Piece:_Grand_Battle!",
    "transformers_text": "One Piece: Grand Battle is a fighting game made in Japan based on the manga series One Piece and its anime adaptation . It is the fourth and final game in One Piece's Grand Battle series and the nineteenth One Piece video game released. The game was released in Japan as One Piece: Grand Battle! Rush . [ a ] The English version uses the intro from the TV series.\n\nMuch like the manga and anime it is based on, Monkey D. Luffy wants to take Gol D. Roger's place to become King of the Pirates. Together with his crew namely, Roronoa Zoro , Nami , Usopp , Sanji , Chopper , and Nico Robin are on a quest to search for the great treasure One Piece [ b ] and also to fulfill their own dreams. The story is based on the East Blue saga up to the Foxy's Return arc.\n\nThere are four different modes in the game: Grand Battle, a one-player/two player mode that features unlocked fighters and stages; Story Mode, a mode that follows every character through the story; Training, a testing mode to test one's skill; and Tourney, a tournament mode that allows to select a character and fight in it and baseball mode.\n\nThe Sequel of One Piece: Grand Battle entitled One Piece: Grand Adventure , which in Grand Adventure, you play along with 5 captains. Luffy is Easy, Buggy is Normal, Crocodile is Hard, Chaser/Smoker is Insane and especially Usopp is Pirate Panic (from level 40-100).\n\nThe game received \"average\" reviews on both platforms according to the review aggregation website Metacritic . [ 12 ] [ 13 ] In Japan, Famitsu gave both platforms a score of three sevens and one six for a total of 27 out of 40. [ 2 ]\n\nGameSpot awarded it a score of 6.0 out of 10, saying \"Fans of the series will love One Piece's visuals but will be disappointed with just about every other aspect of the game.\" [ 14 ] IGN awarded it 7 out of 10, saying \"In the end, One Piece: Grand Battle is a fun game marred by a lack of innovation.\" [ 15 ] [ 16 ]\n\nAs of December 25, in Japan the game sold 88,058 units on the PlayStation 2 and 46,395 units on GameCube totaling 134,453 lifetime sales. [ 17 ]",
    "tf_idf_text": "one piece grand battle fight game make japan base manga series one piece anime adaptation fourth final game one piece grand battle series nineteenth one piece video game release game release japan one piece grand battle rush english version use intro series much like manga anime base monkey luffy want take gol rogers place become king pirate together crew namely roronoa zoro nami usopp sanji chopper nico robin quest search great treasure one piece also fulfill dream story base east blue saga foxys return arc four different mode game grand battle oneplayertwo player mode feature unlock fighter stage story mode mode follow every character story train test mode test one skill tourney tournament mode allow select character fight baseball mode sequel one piece grand battle entitle one piece grand adventure grand adventure play along captain luffy easy buggy normal crocodile hard chasersmoker insane especially usopp pirate panic level game receive average review platform accord review aggregation website metacritic japan famitsu give platform score three seven one six total gamespot award score say fan series love one piece visuals disappoint every aspect game ign award say end one piece grand battle fun game mar lack innovation december japan game sell unit playstation unit gamecube total lifetime sale"
}