{
    "title": "en.wikipedia.org_wiki_Kajika",
    "url": "https://en.wikipedia.org/wiki/Kajika",
    "transformers_text": "Kajika ( カジカ ) is a Japanese manga series written and illustrated by Akira Toriyama . It was originally serialized in Weekly Shōnen Jump in 1998, [ 2 ] with the twelve chapters collected into a single tankōbon volume by Shueisha . Although it has not been licensed for an English-language release, Kajika has been translated and published in several European territories.\n\nKajika is the story of the title protagonist and his quest to return to being a normal boy. As a member of the Kawa Tribe ( カワ族 , Kawazoku ) , Kajika is extremely strong and has special powers. As a child, Kajika was very evil. His greatest known evil was chasing after a defenseless fox and smashing it with a giant rock. Upon being killed, the spirit of the fox cursed Kajika and Kajika was turned into a fox-man. [ 1 ] Kajika was then kicked out of his village because of his monstrous appearance, and the only way to break the curse was to save the lives of 1,000 life forms. The spirit of the dead fox, named Gigi, decided to accompany Kajika on his journey. Upon saving 1,000 life forms, Kajika will go back to being a boy and Gigi will once again get its body back.\n\nAfter five years of saving life forms, the team only has ten more lives to save. [ 1 ] One day, Kajika runs across a girl and saves her from a gang of bad guys. After defeating the gang, Kajika then uses a special power to remove all of their evil, turning them good. [ 1 ] Kajika learns that the girl he saved is named Haya, and is told that the guys were after her because of the Dragon Egg she possesses. The Dragon egg is extremely rare and was stolen by the gang leader Gibachi from Ronron Island ( ロンロン島 ) . Haya then went to Sumakia and stole it from Gibachi. She then went on a quest to return the egg. Gibachi tries to kill Haya and recover the egg. Haya then asks Kajika to help her on her quest. [ 1 ]\n\nAs the three go to Ronron island we are told why Gibachi wants the egg so badly. There is an old saying that says if you drink the blood of a young Dragon, then you will gain incredible powers. No one is sure if this is true, but the baby dragon does have Dragomin in its blood which allows it to mature extremely fast. As the three set off, though, Haya makes up an excuse as to why she can not continue, but it is really because she fears Gibachi. So, now it is up to Kajika and Giri to return the egg, but it will not be so easy now that they are being hunted down by the world-famous assassin known as Isaza, who is also a member of the powerful Kawa tribe. Kajika is an extremely strong boy, but it is also revealed that being turned into a fox-man is holding down his true powers.\n\nWritten and illustrated by Akira Toriyama , Kajika was serialized in Weekly Shōnen Jump magazine from issue #32 to #44 of 1998. The twelve chapters were collected into one tankōbon volume that was released on January 8, 1999 by Shueisha . [ 3 ]\n\nKajika has been translated and released in foreign countries, such as in France by Glénat , [ 4 ] Spain by Planeta DeAgostini , Malaysia by Comics House , Finland by Sangatsu Manga , and in Germany, Sweden and Denmark by Carlsen Verlag . [ 5 ]\n\nAnimerica Extra columnist Patricia Duffield stated that Kajika was regularly stocked in Japanese bookstores within the United States. She described Kajika as a highly entertaining adventure story due to Toriyama's easy-to-follow writing and comic style and for possessing \"the art of a master of action\". [ 1 ]",
    "tf_idf_text": "kajika japanese manga series write illustrated akira toriyama originally serialize weekly shnen jump twelve chapter collect single tankbon volume shueisha although not license englishlanguage release kajika translate publish several european territory kajika story title protagonist quest return normal boy member kawa tribe kawazoku kajika extremely strong special power child kajika evil great know evil chasing defenseless fox smash giant rock upon kill spirit fox curse kajika kajika turn foxman kajika kick village monstrous appearance way break curse save live life form spirit dead fox name gigi decide accompany kajika journey upon save life form kajika back boy gigi get body back five year save life form team ten life save one day kajika run across girl save gang bad guy defeat gang kajika use special power remove evil turn good kajika learns girl save name haya tell guy dragon egg possess dragon egg extremely rare steal gang leader gibachi ronron island haya go sumakia stole gibachi go quest return egg gibachi try kill haya recover egg haya ask kajika help quest three ronron island tell gibachi want egg badly old say say drink blood young dragon gain incredible power one sure true baby dragon dragomin blood allow mature extremely fast three set though haya make excuse not continue really fear gibachi kajika giri return egg not easy hunt worldfamous assassin know isaza also member powerful kawa tribe kajika extremely strong boy also reveal turned foxman hold true power write illustrated akira toriyama kajika serialized weekly shnen jump magazine issue twelve chapter collect one tankbon volume release january shueisha kajika translate release foreign country france glnat spain planeta deagostini malaysia comic house finland sangatsu manga germany sweden denmark carlsen verlag animerica extra columnist patricia duffield state kajika regularly stock japanese bookstore within united state describe kajika highly entertaining adventure story due toriyamas easytofollow write comic style possess art master action"
}