{
    "title": "10 \"A Perverted Kid and Disturbances of Holy Power\"Transliteration: \"Hentai Chigo to Shinriki Sōdō\" (Japanese:変態稚児と神力騒動) Riharu Funakubo Yoriko Tomita Riharu Funakubo September 14, 2024(2024-09-14)",
    "url": "https://en.wikipedia.org/wiki/The_Elusive_Samurai",
    "transformers_text": "10 \"A Perverted Kid and Disturbances of Holy Power\"Transliteration: \"Hentai Chigo to Shinriki Sōdō\" (Japanese:変態稚児と神力騒動) Riharu Funakubo Yoriko Tomita Riharu Funakubo September 14, 2024(2024-09-14)\n\nAfter securing the village, Tokiyuki and the others return home and Yorishige requests him to make some strange errands in secret in order to restore his divination powers. The other Elusive Warriors and Yorishige's aides take note of Tokiyuki gradually getting more suspicious items and mistake him for a pervert, much to his chagrin. Finally, Yorishige asks Tokiyuki to retrieve some water from a secret holy source. As Tokiyuki doubts if divine power even exists, he meets Shizuku at the source. In the occasion, Shizuku shows him the creatures who reside in Suwa's divine territory, and Tokiyuki leaves with more questions about Yorishige and Shizuku. Meanwhile, Takauji sends his younger brotherTadayoshito reinforce the defenses of Kamakura, with a feeling that Tokiyuki intends to reconquer it. Tadayoshi complies, but he grows concerned with Takauji's strange behavior. Tokiyuki brings the holy water for Yorishige to restore his powers, but in return, forces him to clear the misunderstanding with his servants.",
    "tf_idf_text": "pervert kid disturbance holy powertransliteration hentai chigo shinriki japanese riharu funakubo yoriko tomita riharu funakubo september secure village tokiyuki others return home yorishige request make strange errand secret order restore divination power elusive warrior yorishiges aide take note tokiyuki gradually get suspicious item mistake pervert much chagrin finally yorishige asks tokiyuki retrieve water secret holy source tokiyuki doubt divine power even exist meet shizuku source occasion shizuku show creature reside suwas divine territory tokiyuki leave question yorishige shizuku meanwhile takauji sends young brothertadayoshito reinforce defense kamakura feel tokiyuki intend reconquer tadayoshi complies grows concerned takaujis strange behavior tokiyuki bring holy water yorishige restore power return force clear misunderstanding servant"
}