{
    "title": "11 \"Samurais Who Are Eager to Die and an Elusive Samurai\"Transliteration: \"Shinitagari to Nige Jōzu\" (Japanese:死にたがりと逃げ上手) Yoshihiro Hiramine Rino Yamazaki Yoshihiro Hiramine September 21, 2024(2024-09-21)",
    "url": "https://en.wikipedia.org/wiki/The_Elusive_Samurai",
    "transformers_text": "11 \"Samurais Who Are Eager to Die and an Elusive Samurai\"Transliteration: \"Shinitagari to Nige Jōzu\" (Japanese:死にたがりと逃げ上手) Yoshihiro Hiramine Rino Yamazaki Yoshihiro Hiramine September 21, 2024(2024-09-21)\n\nIt is April and the time has come for the wheat harvest. Kiyohara Shinano-no-kami, theprovincial officialof Shinano, confiscates all the grains production from the villagers, killing anyone who oppose him. In response, Hoshina Yasaburō leads a revolt against Kiyohara inKawanakajima, despite knowing that there is no chance for him and his retainers to survive. Yorishige sends Tokiyuki, Kojirō, Genba and Fubuki as messengers to convince Yasaburō to retreat, but to no avail. Certain that Yasaburō would be easier to convince after the initial skirmish with Kiyohara's forces, led by Wada Yonemaru and Sukefusa, Tokiyuki and the others assist Yasaburō's forces in battle, reducing casualties to a minimum. At night, a drunk Tokiyuki has a heated discussion with Yasaburō and finally convinces him to retreat with the women and children. However, Yasaburō's retreat plans are intercepted by Sukefusa's hearing and Kiyohara orders to give chase and eliminate them. Anticipating this, the Elusive Warriors begin their strategy to allow Yasaburō and his retainers to successfully retreat.",
    "tf_idf_text": "samurai eager die elusive samuraitransliteration shinitagari nige jzu japanese yoshihiro hiramine rino yamazaki yoshihiro hiramine september april time come wheat harvest kiyohara shinanonokami theprovincial officialof shinano confiscate grain production villager kill anyone oppose response hoshina yasabur lead revolt kiyohara inkawanakajima despite know chance retainer survive yorishige sends tokiyuki kojir genba fubuki messenger convince yasabur retreat avail certain yasabur would easier convince initial skirmish kiyoharas force lead wada yonemaru sukefusa tokiyuki others assist yasaburs force battle reduce casualty minimum night drunk tokiyuki heat discussion yasabur finally convince retreat woman child however yasaburs retreat plan intercept sukefusas hearing kiyohara order give chase eliminate anticipate elusive warrior begin strategy allow yasabur retainer successfully retreat"
}