{
    "title": "12 \"Hang in There, Tokiyuki, Until the Day You Retake Kamakura\"Transliteration: \"Ganbare Tokiyuki, Kamakura Dakkan no Sono Hi Made\" (Japanese:がんばれ時行、鎌倉奪還のその日まで) Yui Midori Rino Yamazaki Yuta Yamazaki September 28, 2024(2024-09-28)",
    "url": "https://en.wikipedia.org/wiki/The_Elusive_Samurai",
    "transformers_text": "12 \"Hang in There, Tokiyuki, Until the Day You Retake Kamakura\"Transliteration: \"Ganbare Tokiyuki, Kamakura Dakkan no Sono Hi Made\" (Japanese:がんばれ時行、鎌倉奪還のその日まで) Yui Midori Rino Yamazaki Yuta Yamazaki September 28, 2024(2024-09-28)\n\nWith the Elusive Warriors' help, Yasaburō's forces successfully allow the women and children to escape to safety but fight for their lives to contain the enemy advance headed by Yonemaru. Kojirō confronts Yonemaru and his detachment with a few Hoshina allies, who proves himself too strong for him to defeat alone, until his allies manage to grab him for Kojirō to give the final blow and kill him. In response, Kiyohara sends Sukefusa to the frontlines, ignoring his pleas, when Fubuki attacks him from a blind spot and narrowly cuts his hat off as a warning, certain that having such an incompetent commander on the enemy side will give an advantage in the future; a frightened Kiyohara is deceived into believing Yasaburō's reinforcements are arriving and orders his army to retreat, much to Sukefusa's frustration. Yasaburō thanks Tokiyuki and the others for his help and the group returns to the Suwa temple where they are welcomed by Yorishige, Shizuku and Ayako.",
    "tf_idf_text": "hang tokiyuki day retake kamakuratransliteration ganbare tokiyuki kamakura dakkan sono make japanese yui midori rino yamazaki yuta yamazaki september elusive warrior help yasaburs force successfully allow woman child escape safety fight live contain enemy advance head yonemaru kojir confronts yonemaru detachment hoshina ally prove strong defeat alone ally manage grab kojir give final blow kill response kiyohara send sukefusa frontlines ignore plea fubuki attack blind spot narrowly cut hat warn certain incompetent commander enemy side give advantage future frighten kiyohara deceive believe yasaburs reinforcement arrive order army retreat much sukefusas frustration yasabur thanks tokiyuki others help group return suwa temple welcome yorishige shizuku ayako"
}