{
    "title": "1 \"May 22nd\"Transliteration: \"Gogatsu Nijū-ni Nichi\" (Japanese:5月22日) Yuta Yamazaki Yoriko Tomita Yuta Yamazaki July 6, 2024(2024-07-06)",
    "url": "https://en.wikipedia.org/wiki/The_Elusive_Samurai",
    "transformers_text": "1 \"May 22nd\"Transliteration: \"Gogatsu Nijū-ni Nichi\" (Japanese:5月22日) Yuta Yamazaki Yoriko Tomita Yuta Yamazaki July 6, 2024(2024-07-06)\n\nIn 1333,Hōjō Tokiyukiis the reluctant heir to theregencywho partakes in mischief; he meets with Hōjō allyAshikaga Takaujias the latter departs to quell arebellionled by supporters of theEmperor. Tokiyuki is later startled at the presence of Suwa Yorishige and Shizuku, who have come to pray forKamakura'sprotection against its enemies. Yorishige shares to Tokiyuki a vision of him being hailed as a hero of a great war in the future, though Tokiyuki doubts his claims. An envoy reports to theshogunateof Takauji defecting to the Emperor's side and launching acoupagainst them, causing mass genocide and the fall of the shogunate, traumatizing Tokiyuki. Yorishige and Shizuku appear again to help him escape under the orders of his deceasedfather. As they overlook the burning town from a cliff and Tokiyuki wishes on wanting to die, Yorishige abides by pushing him off the cliff where Tokiyuki demonstrates his skills in speed and evasion, using them to his advantage in causing several samurai to unintentionally kill one another before he returns to Yorishige. Yorishige then speaks on how he can use his elusive nature for survival with Takauji hunting him and they leave to gather more allies.",
    "tf_idf_text": "may ndtransliteration gogatsu nijni nichi japanese yuta yamazaki yoriko tomita yuta yamazaki july tokiyukiis reluctant heir theregencywho partake mischief meet allyashikaga takaujias latter departs quell arebellionled supporter theemperor tokiyuki later startle presence suwa yorishige shizuku come pray forkamakurasprotection enemy yorishige share tokiyuki vision hail hero great war future though tokiyuki doubt claim envoy report theshogunateof takauji defect emperor side launch acoupagainst cause mass genocide fall shogunate traumatize tokiyuki yorishige shizuku appear help escape order deceasedfather overlook burn town cliff tokiyuki wish want die yorishige abides push cliff tokiyuki demonstrate skill speed evasion use advantage cause several samurai unintentionally kill one another return yorishige yorishige speaks use elusive nature survival takauji hunt leave gather ally"
}