{
    "title": "2 \"The Gentle Uncle\"Transliteration: \"Yasashī Ojisan\" (Japanese:やさしいおじさん) Yūsuke Kawakami Yoriko Tomita Yūsuke Kawakami July 13, 2024(2024-07-13)",
    "url": "https://en.wikipedia.org/wiki/The_Elusive_Samurai",
    "transformers_text": "2 \"The Gentle Uncle\"Transliteration: \"Yasashī Ojisan\" (Japanese:やさしいおじさん) Yūsuke Kawakami Yoriko Tomita Yūsuke Kawakami July 13, 2024(2024-07-13)\n\nA search party loyal to Takauji is dispatched to locate Tokiyuki's brotherKunitoki[ja]as he is found by their uncleGodaīn Muneshige, who points the party to his direction. Tokiyuki later learns of Muneshige's treachery and Kunitoki's capture and execution and he collapses to his knees, feeling betrayed by everyone he knew. After hearing from Yorishige on Muneshige's whereabouts and wanting to avenge his brother, Tokiyuki follows him as they observe a desperate Muneshige wanting to claim glory by capturing him. Tokiyuki meets Yorishige's allies Kojirō and Ayako, who lend their assistance to his cause. Later that evening, Tokiyuki and Muneshige meet, where Tokiyuki springs a trap that is countered by Muneshige. Tokiyuki evades Muneshige's swings, which Kojirō and Ayako exploit to give Tokiyuki an opening, taking it and killing Muneshige. A flashback to before the coup is later shown of Kunitoki telling Tokiyuki to become a hero.",
    "tf_idf_text": "gentle uncletransliteration yasash ojisan japanese ysuke kawakami yoriko tomita ysuke kawakami july search party loyal takauji dispatch locate tokiyukis brotherkunitokijaas find unclegodan muneshige point party direction tokiyuki later learn muneshiges treachery kunitokis capture execution collapse knee feel betray everyone know hear yorishige muneshiges whereabouts want avenge brother tokiyuki follow observe desperate muneshige want claim glory capture tokiyuki meet yorishiges ally kojir ayako lend assistance cause later even tokiyuki muneshige meet tokiyuki spring trap counter muneshige tokiyuki evades muneshiges swing kojir ayako exploit give tokiyuki open take kill muneshige flashback coup later show kunitoki tell tokiyuki become hero"
}