{
    "title": "4 \"Sadamune Appears!\"Transliteration: \"Sadamune Tōjō!\" (Japanese:貞宗登場!) Yūichirō Komuro Dai Masuyama Yūichirō Komuro July 27, 2024(2024-07-27)",
    "url": "https://en.wikipedia.org/wiki/The_Elusive_Samurai",
    "transformers_text": "4 \"Sadamune Appears!\"Transliteration: \"Sadamune Tōjō!\" (Japanese:貞宗登場!) Yūichirō Komuro Dai Masuyama Yūichirō Komuro July 27, 2024(2024-07-27)\n\nTakauji is commended by the Emperor for his efforts in overthrowing the shogunate and appoints his retainers in court positions. He tasks one of his appointed retainers,Ogasawara Sadamune, to find remnants of the Hōjō clan. Sadamune complies and later meets with Yorishige, threatening to use brute force as governor ofShinanoto find any survivors as he shoots a shrine maiden and grazes her ear as a warning; Tokiyuki observes this and commends his archery skills while acknowledging him as a threat. Sadamune joins a dog shooting competition, leading Yorishige to elect Tokiyuki as his opponent while teaching him to use it as an opportunity to learn from Sadamune, much to the disapproval of the Elusive Warriors. During the competition, Tokiyuki, under instruction from Yorishige, directs Sadamune's full attention to him and annoys him enough for Tokiyuki to score a point. Sadamune, noticing he used up most of his arrows to try and hit Tokiyuki, uses his last remaining arrow to land a headshot on him, giving Sadamune a massive point advantage. Tokiyuki, wounded from the arrow, begins to have fun.",
    "tf_idf_text": "sadamune appearstransliteration sadamune japanese yichir komuro dai masuyama yichir komuro july takauji commend emperor effort overthrow shogunate appoints retainer court position task one appoint retainersogasawara sadamune find remnant clan sadamune complies later meet yorishige threaten use brute force governor ofshinanoto find survivor shoot shrine maiden graz ear warn tokiyuki observe commends archery skill acknowledge threat sadamune join dog shoot competition lead yorishige elect tokiyuki opponent teaching use opportunity learn sadamune much disapproval elusive warrior competition tokiyuki instruction yorishige direct sadamunes full attention annoy enough tokiyuki score point sadamune notice use arrow try hit tokiyuki us last remain arrow land headshot give sadamune massive point advantage tokiyuki wound arrow begin fun"
}