{
    "title": "5 \"Settling the Score! A Dog-Shooting Competition and then...\"Transliteration: \"Ketchaku! Inuōmono, Soshite...\" (Japanese:決着!犬追物、そして⋯) Ayako Kurata Rino Yamazaki Ayako Kurata August 3, 2024(2024-08-03)",
    "url": "https://en.wikipedia.org/wiki/The_Elusive_Samurai",
    "transformers_text": "5 \"Settling the Score! A Dog-Shooting Competition and then...\"Transliteration: \"Ketchaku! Inuōmono, Soshite...\" (Japanese:決着!犬追物、そして⋯) Ayako Kurata Rino Yamazaki Ayako Kurata August 3, 2024(2024-08-03)\n\nAs Sadamune focuses his attention on Tokiyuki's blind spot to hinder his attempts on landing a shot, Tokiyuki exploits it through directly shooting at his neck, staggering Sadamune long enough for Tokiyuki to secure a win; Yorishige commands Sadamune to leave Suwa. Sadamune retaliates by planning to confiscate parts of Suwa under an Imperial Command, causing panic among its citizens. Yorishige tells Tokiyuki he will be meeting a thief named Kazama Genba and work with him to steal the Command. Following Yorishige's request, the Elusive Warriors head to a village Genba is rumored to be staying, where Genba introduces himself and works with Tokiyuki under the promises of earning more under him. Genba and Tokiyuki head to Sadamune's mansion to steal the Command as Genba takes issue with Tokiyuki's compassion for people. Tokiyuki later sees Genba impersonating Sadamune to lure out the guards from the warehouse housing the Command and Genba asks if he can be trusted with his skill.",
    "tf_idf_text": "settle score dogshooting competition thentransliteration ketchaku inumono soshite japanese ayako kurata rino yamazaki ayako kurata august sadamune focus attention tokiyukis blind spot hinder attempt land shot tokiyuki exploit directly shoot neck stagger sadamune long enough tokiyuki secure win yorishige command sadamune leave suwa sadamune retaliates plan confiscate part suwa imperial command cause panic among citizen yorishige tell tokiyuki meeting thief name kazama genba work steal command follow yorishiges request elusive warrior head village genba rumor stay genba introduces work tokiyuki promise earn genba tokiyuki head sadamunes mansion steal command genba take issue tokiyukis compassion people tokiyuki later see genba impersonate sadamune lure guard warehouse housing command genba ask trust skill"
}