{
    "title": "6 \"Steal the Imperial Command from Ogasawara's Residence at Night\"Transliteration: \"Nusume Rinji, Ogasawara-kan no Yoru\" (Japanese:盗め綸旨、小笠原館の夜) Yōko Kikuchi Rino Yamazaki Yōko Kikuchi August 10, 2024(2024-08-10)",
    "url": "https://en.wikipedia.org/wiki/The_Elusive_Samurai",
    "transformers_text": "6 \"Steal the Imperial Command from Ogasawara's Residence at Night\"Transliteration: \"Nusume Rinji, Ogasawara-kan no Yoru\" (Japanese:盗め綸旨、小笠原館の夜) Yōko Kikuchi Rino Yamazaki Yōko Kikuchi August 10, 2024(2024-08-10)\n\nThe mansion guards are alerted by the suspicious activity inside the warehouse, prompting Tokiyuki and Genba to escape with the Command. One of Sadamune's retainers,Ichikawa Sukefusa[ja], suspects the boys are hiding nearby and, using his hearing, attempts to find them. Genba prepares to abandon Tokiyuki, but his silent footsteps are heard by Sukefusa and he strikes him, only to be narrowly saved by Tokiyuki taking the blow. Sadamune comes to Sukefusa's aid and they track the boys, as Tokiyuki slowly loses his strength from Sukefusa's hit. Seeing this, Genba distracts Sadamune and Sukefusa long enough to escape with the Elusive Warriors, joining them afterwards and gaining newfound respect for Tokiyuki. With the Command no longer in his ownership, Sadamune is unable to confiscate Suwa, angering him. As the Elusive Warriors celebrate, Yorishige reminds them they should not underestimate Takauji as he shares of him thwartingPrince Moriyoshi's attempt on his life and be aided by the citizens ofKyotodue to his charisma. Tokiyuki thanks Yorishige on helping him rebuild his strength and promises to not give up against Takauji.",
    "tf_idf_text": "steal imperial command ogasawaras residence nighttransliteration nusume rinji ogasawarakan yoru japanese yko kikuchi rino yamazaki yko kikuchi august mansion guard alert suspicious activity inside warehouse prompt tokiyuki genba escape command one sadamunes retainersichikawa sukefusaja suspect boys hide nearby use hear attempt find genba prepares abandon tokiyuki silent footstep heard sukefusa strike narrowly save tokiyuki take blow sadamune come sukefusas aid track boys tokiyuki slowly lose strength sukefusas hit see genba distracts sadamune sukefusa long enough escape elusive warrior join afterwards gain newfound respect tokiyuki command longer ownership sadamune unable confiscate suwa anger elusive warrior celebrate yorishige remind not underestimate takauji share thwartingprince moriyoshis attempt life aid citizen ofkyotodue charisma tokiyuki thanks yorishige help rebuild strength promise not give takauji"
}