{
    "title": "8 \"A War of Hide and Seek\"Transliteration: \"Kakurenbo Sensō\" (Japanese:かくれんぼ戦争) Yūsuke Kawakami Dai Hazeyama Yūsuke Kawakami August 24, 2024(2024-08-24)",
    "url": "https://en.wikipedia.org/wiki/The_Elusive_Samurai",
    "transformers_text": "8 \"A War of Hide and Seek\"Transliteration: \"Kakurenbo Sensō\" (Japanese:かくれんぼ戦争) Yūsuke Kawakami Dai Hazeyama Yūsuke Kawakami August 24, 2024(2024-08-24)\n\nAfter finishing their preparations for the impending invasion, Tokiyuki asks Fubuki to teach him some swordsmanship. In the occasion, Fubuki decides to teach Tokiyuki a special fighting style that is appropriate for his elusive abilities and kind nature, but only works in one on one fights so that Tokiyuki can defeat the enemy general himself. Shōkan invades the village and most of his men fall by the traps set by the villagers and the Elusive Warriors. Kojirō and Ayako lead Shōkan to a small house where he is locked inside with Tokiyuki, who challenges him to a duel. Tokiyuki questions his motives on attacking the village despite having already killed its adults, and Shōkan replies taking joy with making the village's children suffer. Enraged, Tokiyuki begins the duel as the other Elusive Warriors handle Shōkan's lieutenants. Shōkan, certain that he has the advantage, attacks Tokiyuki who evades all his attacks and manages to seriously injure him which surprises Shōkan.",
    "tf_idf_text": "war hide seektransliteration kakurenbo sens japanese ysuke kawakami dai hazeyama ysuke kawakami august finish preparation impend invasion tokiyuki ask fubuki teach swordsmanship occasion fubuki decide teach tokiyuki special fight style appropriate elusive ability kind nature work one one fight tokiyuki defeat enemy general shkan invades village men fall trap set villager elusive warrior kojir ayako lead shkan small house lock inside tokiyuki challenge duel tokiyuki question motif attack village despite already kill adult shkan reply take joy making village child suffer enrage tokiyuki begin duel elusive warrior handle shkans lieutenant shkan certain advantage attack tokiyuki evades attack manage seriously injure surprise shkan"
}