{
    "title": "en.wikipedia.org_wiki_One_Piece_Movie__The_Desert_Princess_and_the_Pi_4c936521df",
    "url": "https://en.wikipedia.org/wiki/One_Piece_Movie:_The_Desert_Princess_and_the_Pirates:_Adventures_in_Alabasta",
    "transformers_text": "One Piece Movie: The Desert Princess and the Pirates: Adventures in Alabasta ( Japanese : ONE PIECE エピソードオブアラバスタ 砂漠の王女と海賊たち , Hepburn : Wan Pīsu: Episōdo Obu Arabasuta: Sabaku no Ōjo to Kaizokutachi ; lit. One Piece: Episode of Alabasta: The Desert Princess and the Pirates ) is a 2007 Japanese anime action adventure fantasy film directed by Takahiro Imamura and written by Hirohiko Kamisaka. It is the eighth film in the One Piece media franchise, adapting a story arc from the original manga by Eiichiro Oda , wherein the Straw Hat Pirates travel to the Kingdom of Alabasta to save the war-and drought-plagued country from Sir Crocodile and his secret crime syndicate Baroque Works .\n\nIn Japan, the film was released on March 3, 2007, where it was shown alongside the Dr. Slump short Dr. Mashirito and Abale-chan . It peaked at second place of the weekend box office and grossed $7,075,924. [ 2 ] [ 3 ] Worldwide, the film has grossed a total of $7,090,891. [ 1 ] The film was briefly shown at select theaters across the United States, before it was released on DVD in North America on February 19, 2008, [ 4 ] and the Blu-ray released on January 27, 2009.\n\nWhile escorting princess Nefertari Vivi to her home in the kingdom of Alabasta, the Straw Hat Pirates briefly encounter Baroque Works member Mr. 2 Bon Clay ; he demonstrates his devil fruit ability, which allows him to assume the form and voice of anyone whose face he has touched. After he leaves, Vivi explains to the Straw Hats how Baroque Works leader Crocodile , while posing at the country's hero, created an artificial drought that has lasted three years and manipulated Alabasta's rebel and royal armies into fighting each other, planning to take over the kingdom.\n\nUpon reaching Alabasta, the Straw Hats find the rebels' base deserted and decide to intercept them at Alabasta's capital city, Alubarna. Crocodile and his partner Ms. All Sunday attempt to abduct Vivi, but Luffy stays behind and distracts him, allowing the others to escape. Crocodile defeats Luffy using his power to control sand, impaling him with his hook and burying him alive. In the port town of Nanohana, the rebel army, led by Vivi's childhood friend Koza, witnesses members of Baroque Works disguised as royal army soldiers set fire to the town. The rebels decide to attack Alubarna, where Mr. 2 impersonates the king, Nefertari Cobra, and orders the royal army to engage.\n\nThe Straw Hats recch Alubarna, where the officer agents of Baroque Works are waiting for them. The Straw Hats split up to lure the agents away, allowing Vivi to reach the approaching rebels. Usopp and Chopper defeat the officer agents Mr. 4 and Miss Merry Christmas, Sanji manages to defeat Mr. 2, Nami defeats Ms. Doublefinger, and Zoro learns to cut steel by defeating the blade-bodied Mr. 1. When her attempt to stop the rebels fails, Vivi rushes to the palace and convinces the acting royal army captain, Chaka, to blow up the palace to get the armies' attention and force them to listen. However, Crocodile and Ms. All Sunday appear and foil her plan. Koza witnesses Crocodile questioning the real Cobra, who stands nailed to the wall, about his knowledge of the ancient weapon Pluton. Realizing the deception, Koza and Chaka attack Crocodile, but are quickly defeated.\n\nCrocodile engulfs the palace plaza in a sandstorm, sowing further confusion and violence among the armies. Vivi and the remaining Straw Hats learn of a bomb set by Baroque Works to wipe out both armies. The Straw Hats find the bomb in the city's clock tower, guarded by Mr. 7 and Miss Father's Day. Vivi takes out the agents, but discovers the bomb's timer has been activated. Royal guardsman Pell arrives and safely detonates the bomb in the sky, seemingly sacrificing himself.\n\nCrocodile orders Cobra to lead him and Ms. All Sunday into the royal mausoleum , where the information on Pluton is supposedly kept. Ms. All Sunday tries to hide the information, knowing Crocodile plans to betray her, but he sees through her deception and stabs her. Luffy arrives, having been saved by Ms. All Sunday, and uses the moisture in his own blood to nullify Crocodile's powers. Crocodile stabs Luffy with his poisonous hook, but Luffy breaks it and defeats him before passing out. Vivi finally gets the armies' attention, and Koza and Chaka present Crocodile as the manipulator, stopping the fighting. Rain starts to fall, which lasts for three straight days.\n\nLuffy awakens, having been given an antidote by Ms. All Sunday, and a banquet is held for the pirates. When news arrives that a marine fleet is on their way to Alabasta, the Straw Hats decide to quickly leave, with Vivi unsure whether to continue traveling with them. The next day, she appears at the coast to see them off, promising to remain their friend. In the aftermath, Alabasta is rebuilt, Pell is found alive, and peace returns to the kingdom.\n\nShueisha created two adaptations of the film: a film comic and a light novel , both titled Gekijōban One Piece: Episōdo obu Arabasuta: Sabaku no Ōjo to Kaizoku-tachi ( 劇場版One Piece エピソード オブ アラバスタ 砂漠の王女と海賊たち , lit. One Piece The Movie: Episode of Alabasta: The Desert Princess and the Pirates ) . The film comic ( ISBN 978-4-08-874236-6 ) was released on March 4 and the light novel ( ISBN 978-4-08-703178-2 ) on March 7, 2007. [ 5 ] [ 6 ]\n\nThe TV cut of the film, first aired in April of 2011 in Japan, adds a 15-minute prologue to the start of the film. The new section adapts the Whisky Peak arc in abridged form to explain how the crew met Vivi.\n\nThe score on the film's soundtrack was composed by Kōhei Tanaka , Shiro Hamaguchi , Yasunori Iwasaki, Minoru Maruo and Kazuhiko Sawaguchi. The ending theme \"Compass\" was written and performed by Ai Kawashima . For the English release, the score was used, and an English remake of \"Compass\" was created for use in the English dub, but a defect in the DVD caused the Japanese version to play instead. However, the English version was used in the theatrical release as well as the Blu-ray release.\n\nIn its first week of showing, the film entered the Japanese weekend box office on place two. [ 2 ] In its second and third week, it placed fourth and ninth, respectively, [ 7 ] [ 8 ] before falling out of the Top 10 the week after. [ 9 ] In its fifth week of showing, the film re-entered the Top 10 for a final ninth place. [ 10 ] In the Japanese market, the film's gross revenue summed up to $7,075,924. [ 3 ] Including non-North American, foreign markets, the film made at total of $7,084,304 [ 11 ] and after Funimation Entertainment's limited showing in the US, the figure rose to a worldwide total of $7,090,891. [ 1 ]\n\nFunimation Entertainment 's DVD and Blu-ray releases of the film were also the subject of several reviews by a number of publications for films and anime. Carl Kimlinger of Anime News Network described the film as \"a feature-length recap with slightly revised editing and a heavy layer of theatrical gloss\" that is \"Squeezing an enormous plot into a teeny little film like a man in mid-life crisis trying to squeeze into high-school jeans\", but noted that \"The soundtrack is a joy to listen to, rousing and fun\". [ 12 ] Bamboo Dong, another reviewer of Anime News Network, said that the film's pace is \"anything but smooth\" and that the battles are \"cobbled together\". She commented that the film is \"syrupy good fun\" for those who are fans of the series, but noted that for non-fans it will hold only \"limited appeal\". [ 13 ] Although Todd Douglass Jr. of DVD talk said that \"you really have to be affirmed in One Piece lore in order to full [ sic ] appreciate [it]\" and commented that it felt \"incomplete and unbalanced\", he still recommended the film, stating that it is \"short on story but ... a lot of fun.\" In regard to Funimation Entertainment's adaptation, he said that \"[their] team does a great job of capturing the spirit and personalities of the show's characters.\" [ 14 ]\n\nBryce Coulter of Mania Entertainment said that the film \"cannot be recommended for someone who is not familiar with the series\" but otherwise recommends it, cautiously, while commenting that it gives \"a neat perspective\" on its source material, but ultimately does not do it \"any justice\". In reference to the English adaptation he said that \"the ... voice actors ... did a great job of portraying the Japanese cast.\" [ 15 ] Davey C. Jones of Active Anime said that he liked the animation, in particular the backgrounds, and commented that the film \"takes the character designs right out of the manga and TV show and ups them with theatrical quality shine.\" [ 16 ] N.S. Davidson of IGN rated the film with 7 out of 10, stating that the animation is only \"Slightly more sophisticated ... than in the television series\" and that the film itself is \"most likely ... for One Piece fans only.\" [ 17 ] Dustin Somner of Blu-ray.com agreed on the film being primarily for fans, stating that the film's lack of context makes it \"frustrating (with a capital 'F')\" for those unfamiliar with the series. [ 18 ]",
    "tf_idf_text": "one piece movie desert princess pirate adventure alabasta japanese one piece hepburn wan psu episdo obu arabasuta sabaku kaizokutachi lit one piece episode alabasta desert princess pirate japanese anime action adventure fantasy film direct takahiro imamura write hirohiko kamisaka eighth film one piece medium franchise adapt story arc original manga eiichiro oda wherein straw hat pirate travel kingdom alabasta save warand droughtplagued country sir crocodile secret crime syndicate baroque work japan film release march show alongside slump short mashirito abalechan peak second place weekend box office gross worldwide film gross total film briefly show select theater across united state release dvd north america february bluray release january escort princess nefertari vivi home kingdom alabasta straw hat pirate briefly encounter baroque work member bon clay demonstrate devil fruit ability allow assume form voice anyone whose face touch leaf vivi explains straw hat baroque work leader crocodile pose country hero create artificial drought last three year manipulate alabastas rebel royal army fight plan take kingdom upon reach alabasta straw hat find rebels base desert decide intercept alabastas capital city alubarna crocodile partner sunday attempt abduct vivi luffy stay behind distracts allow others escape crocodile defeat luffy use power control sand impale hook bury alive port town nanohana rebel army lead vivis childhood friend koza witness member baroque work disguise royal army soldier set fire town rebel decide attack alubarna impersonate king nefertari cobra order royal army engage straw hat recch alubarna officer agent baroque work wait straw hat split lure agent away allow vivi reach approach rebel usopp chopper defeat officer agent miss merry christmas sanji manage defeat nami defeat doublefinger zoro learns cut steel defeat bladebodied attempt stop rebel fail vivi rush palace convinces act royal army captain chaka blow palace get army attention force listen however crocodile sunday appear foil plan koza witness crocodile question real cobra stand nail wall knowledge ancient weapon pluton realize deception koza chaka attack crocodile quickly defeat crocodile engulfs palace plaza sandstorm sow confusion violence among army vivi remain straw hat learn bomb set baroque work wipe army straw hat find bomb city clock tower guard miss father day vivi take agent discovers bomb timer activate royal guardsman pell arrive safely detonate bomb sky seemingly sacrifice crocodile order cobra lead sunday royal mausoleum information pluton supposedly keep sunday try hide information know crocodile plan betray see deception stab luffy arrive save sunday us moisture blood nullify crocodiles power crocodile stab luffy poisonous hook luffy break defeat pass vivi finally get army attention koza chaka present crocodile manipulator stop fight rain start fall last three straight day luffy awakens give antidote sunday banquet hold pirate news arrive marine fleet way alabasta straw hat decide quickly leave vivi unsure whether continue travel next day appear coast see promise remain friend aftermath alabasta rebuilt pell find alive peace return kingdom shueisha create two adaptation film film comic light novel title gekijban one piece episdo obu arabasuta sabaku kaizokutachi one piece light one piece movie episode alabasta desert princess pirate film comic isbn release march light novel isbn march cut film first air april japan add minute prologue start film new section adapts whisky peak arc abridge form explain crew meet vivi score film soundtrack composed khei tanaka shiro hamaguchi yasunori iwasaki minoru maruo kazuhiko sawaguchi end theme compass write perform kawashima english release score use english remake compass create use english dub defect dvd cause japanese version play instead however english version use theatrical release well bluray release first week showing film enter japanese weekend box office place two second third week place fourth ninth respectively fall top week fifth week show film reentered top final ninth place japanese market film gross revenue sum include nonnorth american foreign market film make total funimation entertainment limit show figure rise worldwide total funimation entertainment dvd bluray release film also subject several review number publication film anime carl kimlinger anime news network describe film featurelength recap slightly revise edit heavy layer theatrical gloss squeeze enormous plot teeny little film like man midlife crisis try squeeze highschool jean note soundtrack joy listen rouse fun bamboo dong another reviewer anime news network say film pace anything smooth battle cobble together comment film syrupy good fun fan series note nonfans hold limited appeal although todd douglas dvd talk say really affirm one piece lore order full sic appreciate comment felt incomplete unbalanced still recommend film state short story lot fun regard funimation entertainment adaptation say team great job capture spirit personality show character bryce coulter mania entertainment say film cannot recommend someone not familiar series otherwise recommend cautiously comment give neat perspective source material ultimately not justice reference english adaptation say voice actor great job portray japanese cast davey jones active anime say liked animation particular background comment film take character design right manga show ups theatrical quality shine davidson ign rat film state animation slightly sophisticated television series film likely one piece fan dustin somner bluraycom agree film primarily fan state film lack context make frustrating capital unfamiliar series"
}