{
    "title": "en.wikipedia.org_wiki_Diamond_Is_Unbreakable",
    "url": "https://en.wikipedia.org/wiki/Diamond_Is_Unbreakable",
    "transformers_text": "Diamond Is Unbreakable ( Japanese : ダイヤモンドは砕けない , Hepburn : Daiyamondo wa Kudakenai ; sometimes translated as Diamond Is Not Crash [ 2 ] ) is the fourth main story arc of the Japanese manga series JoJo's Bizarre Adventure , written and illustrated by Hirohiko Araki . It was serialized in Shueisha 's Weekly Shōnen Jump for a little more than 3 + 1 ⁄ 2 years, from May 4, 1992, [ 3 ] to December 4, 1995, [ 4 ] with the 174 chapters collected into eighteen tankōbon volumes. In its original publication, it was titled JoJo's Bizarre Adventure Part 4: Jōsuke Higashikata ( ジョジョの奇妙な冒険 第4部 東方仗助 , JoJo no Kimyō na Bōken Dai Yon Bu: Higashikata Jōsuke ) . It was preceded by Stardust Crusaders and followed by Golden Wind .\n\nThis part introduces the Stand Arrow, which causes anyone pierced by it to develop a Stand if they are mentally strong enough. The Arrow was retroactively revealed to be the source of Dio 's stand as well as the Joestar family's stands. The arc was adapted into an anime television series by David Production , JoJo's Bizarre Adventure: Diamond Is Unbreakable , that began in April 2016. [ 5 ] A live-action film adaptation by Toho and Warner Bros. titled JoJo's Bizarre Adventure: Diamond Is Unbreakable Chapter I was released on August 4, 2017. Viz Media released the manga in English in a nine-volume edition from 2019 to 2021. [ 6 ]\n\nIn 1999, Jotaro Kujo arrives to the town of Morioh ( 杜王町 , Moriō-chō ) in the M-Prefecture ( M県 , Emu-ken ) after learning that his grandfather Joseph Joestar has an illegitimate son while compiling a list of beneficiaries. He bumps into a freshman named Koichi Hirose before the two encounter the youth Jotaro is looking for: A highschool student named Josuke Higashikata , [ a ] whose Stand Crazy Diamond allows him to manipulate matter in ways that include repairing and healing. Fighting Josuke after inadvertently insulting his pompadour , Jotaro explains the nature of Stands and that one is being used by a death row inmate named Anjuro \"Angelo\" Katagiri, who escaped to Morioh. Josuke unknowingly makes an enemy of Angelo, who murders his grandfather before Josuke uses his power to fuse Angelo into a rock. However, Angelo uses his final moments of consciousness to reveal someone hit him with an Arrow that gave him his Stand, Jotaro learning that an actual artifact was possessed by Dio's forces. Josuke and Koichi eventually come across the culprit, Keicho Nijimura, who inflicts Koichi with the Arrow while his younger brother Okuyasu holds Josuke off. Josuke defeats Okuyasu and heals Koichi with Crazy Diamond, with Koichi developing a Stand called Echoes. After Keicho is defeated with his reason of creating Stand users to create someone able to mercy kill his father, a mutated subordinate of Dio's, Keicho is killed by Stand Red Hot Chili Pepper, which takes the Bow and Arrow. Okuyasu then joins Josuke's group to avenge his brother, encountering several other Stand users Keicho created before they eventually find and defeat Akira Otoishi, Red Hot Chili Pepper's user, as Joseph arrives in Morioh. The Bow and Arrow are taken into Jotaro's custody and all seems to be over for the moment.\n\nSoon afterward, after Josuke tries spending time with Joseph as they find a baby with an invisibility stand, the group encounters other Stand users such as eccentric manga artist Rohan Kishibe, middle schooler Shigekiyo \"Shigechi\" Yangu, and a beautician named Aya Tsuji. Koichi and Rohan later meet the ghosts of Reimi Sugimoto and her dog Arnold after stumbling into the mysterious Ghost Alley, learning of a serial killer who has been lurking in Morioh for years. The murderer is a handsome office worker named Yoshikage Kira , who seeks to satisfy his murderous hand fetish obsession while living a peaceful, quiet life by using the destructive ability of his Stand, Killer Queen, to erase any evidence of his crimes. But his prompted murder of Shigechi ends up exposing him during a brief battle with Jotaro and Koichi that left him injured as Josuke and Okuyasu arrive. Kira escapes and forces Aya to use her Stand to swap identities with a man Kosaku Kawajiri, killing them both while assuming Kosaku's life. Kira's father Yoshihiro, a ghost who uses his Stand to live on in a photo, uses a Bow and Arrow he received years ago from Enya Geil to create an army of Stand users to protect his son, including a dying cat that reincarnated as a Stand-plant hybrid named Stray Cat which Kira took as a pet.\n\nKosaku's son Hayato Kawajiri begins to suspect his father's imposter and confronts Kira, only to get murdered with Kira panicking before receiving a new ability after pierced by Yoshihiro's Arrow a second time that allows him to revive Hayato. The following morning, Hayato learns Kira inflicted him with Killer Queen's new ability Bites the Dust, which destroys whoever Hayato reveals Kira's identity to while rewinding time back an hour with the victim's fate fixed. After Rohan died in one loop and Josuke's group the next, Hayato realizes he needs to force Kira into canceling Bites the Dust before the others are killed with their deaths made permanent. Hayato exploits the knowledge he gained from the time loop to wake Josuke up early and arrange for him to overhear Kira blowing his cover. Kira is forced to use Killer Queen to defend himself, which cancels Bites the Dust just in time to save Josuke and his allies.\n\nJosuke engages Kira in a pitched battle, Okuyasu seemingly killed as Josuke and Hayato take refuge in a house when Kira combines his Stand's powers with Stray Cat to create invisible projectile bombs. Kira plants Yoshihiro's photo into Hayato's pocket to track Josuke, only to be tricked into destroying his father before Okuyasu appears in the nick of time to swipe Stray Cat and further disadvantage Kira. As Jotaro, Koichi, and Rohan arrive with emergency workers responding to the explosions, Kira attempts to activate Bites the Dust on a nearby paramedic in a last ditch attempt to avert his defeat. But he is stopped by Jotaro with assistance from Koichi, knocked into the path of an arriving ambulance that accidentally crushes his skull. Kira's ghost ends up in Ghost Alley and is confronted by Reimi, who gets him dragged off into an unknown fate by spectral hands. Her mission accomplished, Reimi gives the group her final farewells and moves on to the afterlife. The next day, Josuke bids farewell to Jotaro and Joseph, who leave Morioh as the summer of 1999 draws to a close.\n\nDiamond Is Unbreakable is set in the fictional town of Morioh located in S-City, M-Prefecture, which is modeled after a specific area in Hirohiko Araki 's hometown of Sendai , Miyagi Prefecture . [ 7 ] The author said that the suspense and fear caused by the \"unusual\" and \"mysterious\" residents there were his inspiration. [ 8 ] Although he originally intended for JoJo's Bizarre Adventure to be a \"mythical\" manga with superpowers and such, he enjoyed drawing the \"feeling of everyday life\" in Diamond Is Unbreakable . [ 8 ] Because he wanted to create a \"closed city,\" the Stands featured were not proactively attacking. [ 8 ]\n\nDuring Diamond Is Unbreakable ' s serialization, Araki received feedback from readers who felt that enemies in the manga had gotten weak. [ 9 ] Although he usually does not respond to reader opinions, he had heard similar comments from the editorial team and so made an exception by stating that \"the weaknesses inside the hearts of people\" are a thematic element of Part 4. He explained that sometimes he has a character's inner weaknesses drive them into a desperate situation, while other times he turns the weakness into something \"dreadful\" and bases a Stand off of it. Araki wrote that constantly having stronger and stronger enemies appear in a manga eventually leads you to \"trying to think of the farthest edges of the universe\", but in the real world, \"true strength is found in not doing bad things. An enemy who does bad things is a person with an inner weakness.\" [ 9 ]\n\nWith Part 4 of the series, Araki said that he moved away from \"muscle men\" as they fell out of popularity with his readers and he wanted to focus more on fashion. When designing his characters' outfits, Araki considers both everyday fashion and \"cartoonish, bizarre clothing that would be impractical in real life.\" He also forgoes using specific color schemes for his characters and gives his readers different impressions through various color combinations. [ 10 ] Araki said that while he drew several characters in Parts 1 through 3 naked to evoke Greek or Roman gods , he stopped doing it so much with Part 4 to be a \"bit closer to home.\" [ 11 ] Because he is the \"friend next door\" instead of being similar to a hero in a Greek myth like the protagonists of the previous parts, Araki cited Josuke Higashikata as his favorite character in Diamond Is Unbreakable . [ 8 ] He cited Shigekiyo Yangu's Harvest as his favorite Stand from Part 4, because, although he finds his \"flaws and trashiness adorable,\" the character picks up stuff off of the ground which is \"pretty scary.\" [ 8 ]\n\nDespite the prevalent belief that the manga artist character Rohan Kishibe is believed to be Araki's self-insert , the author revealed that he did not model Rohan after himself, but is fascinated by him. He said that unlike Rohan, he values human life more than art. [ 8 ]\n\nIn the original volumization, chapters 437–439 are collected in volume 47, listed on the Golden Wind page.\n\nIn 2000, it was announced that Otsuichi would be writing a novel based on Part 4. The novel proved difficult to complete; in Kono Mystery ga Sugoi 2004, Otsuichi claimed to have written over 2000 pages, but thrown them all out. [ 57 ] Intent on writing a novel that lived up to the manga, it took him until 2007 before The Book: JoJo's Bizarre Adventure 4th Another Day was finally released on November 26. [ 58 ] It is set after the events in the manga, and includes illustrations by Araki.\n\nIn 1997, Araki published the Weekly Shōnen Jump one-shot Thus Spoke Rohan Kishibe ~Episode 16.. Confessional~ , starring Rohan after the events of Part 4. In 1999 he wrote the three-chapter story Dead Man's Questions [ at ] in Allman magazine. Dead Man's Questions stars Yoshikage Kira, the main antagonist of Part 4. Both Thus Spoke Rohan Kishibe and Dead Man's Questions were later compiled in Araki's one-shot collection, Under Jailbreak, Under Execution , in 1999. The former launched a series starring Rohan, Thus Spoke Kishibe Rohan .\n\nThe issue of Jump Square for December 11, 2007, featured a second entry into the Thus Spoke Rohan Kishibe collection, entitled Thus Spoke Rohan Kishibe ~Mutsukabezaka~ , set seven years after the events of Part IV.\n\nIn 2009, Araki wrote the full-color story Rohan au Louvre . [ au ] The short story was displayed at the Musée du Louvre as part of their 2009 Le Louvre invite la bande dessinée exhibit. [ 59 ] The story was later republished in Ultra Jump in 2010. In 2012, Rohan au Louvre was released in English by NBM Publishing under the translated title Rohan at the Louvre .\n\nIn 2011, Araki collaborated with the renowned Italian fashion brand Gucci for the short story Rohan Kishibe Goes to Gucci [ av ] in the women's fashion magazine Spur . [ 60 ]\n\nIn 2012, Araki wrote a third Thus Spoke Rohan Kishibe one-shot for Weekly Shōnen Jump . Entitled Thus Spoke Rohan Kishibe ~Episode 5: Millionaire Village~ it was released in the October 6, 2012 issue of the magazine. [ 61 ]\n\nIn October 2015, Warner Bros. announced that Part 4 would receive an anime television adaptation that serves as a continuation of David Production 's series adaptation . [ 62 ] The series aired in 2016. [ 5 ]\n\nToho and Warner Bros. partnered to produce a live-action film based on the fourth arc of JoJo's Bizarre Adventure that was released on August 4, 2017. Takashi Miike directed the film that stars Kento Yamazaki as Josuke. Both studios planned for worldwide distribution and, with a title of JoJo's Bizarre Adventure: Diamond Is Unbreakable Chapter I , hoped to create sequels. [ 63 ] [ 64 ] However, the film under-performed at the box office, leaving the possibility of future sequels in doubt. [ 65 ]\n\nJoJo's Bizarre Adventure: Crazy Diamond's Demonic Heartbreak , a spin-off manga set in Morioh, written by Kouhei Kadono and illustrated by Tasuku Karasuma, was serialized from December 2021 to May 2023 in Shueisha's seinen manga magazine Ultra Jump , with its chapters collected in three tankōbon volumes. A light novel adaptation, also written by Kadono, was released in June 2023.\n\nThe Cheap Trick story arc was adapted into the episode From Behind of the Thus Spoke Rohan Kishibe TV series released on December 28, 2021. The Janken Boy Is Coming! story arc was adapted into the episode Rock-Paper-Scissors Boy released on December 27, 2022.\n\nIn a 2018 survey of 17,000 JoJo's Bizarre Adventure fans, Diamond Is Unbreakable was chosen as the second favorite story arc with 17.5% of the vote. [ 66 ]\n\nAnime News Network had both Rebecca Silverman and Faye Hopper review the first volume of Diamond Is Unbreakable . Silverman called the beginning slower and not as instantly engrossing as the previous parts, but felt this allowed Josuke, whom she and Hopper both described as kinder than the previous protagonists, to develop as a character. Hopper stated that Diamond Is Unbreakable is sometimes criticized for a \"lack of a strong narrative throughline\" in comparison to other parts, but argued that this is one of its greatest strengths as it allows the main characters to \"simply be, lending them an amiable humanity that none of the over-the-top archetypes in the first 3 Parts ever had.\" [ 67 ]",
    "tf_idf_text": "diamond unbreakable japanese hepburn daiyamondo kudakenai sometimes translate diamond not crash fourth main story arc japanese manga series jojos bizarre adventure write illustrated hirohiko araki serialize shueisha weekly shnen jump little year may december chapter collect eighteen tankbon volume original publication title jojos bizarre adventure part jsuke higashikata jojo kimy bken dai yon higashikata jsuke precede stardust crusader follow golden wind part introduces stand arrow cause anyone pierce develop stand mentally strong enough arrow retroactively reveal source dio stand well joestar familys stand arc adapt anime television series david production jojos bizarre adventure diamond unbreakable begin april liveaction film adaptation toho warner bros title jojos bizarre adventure diamond unbreakable chapter release august viz medium release manga english ninevolume edition jotaro kujo arrive town morioh morich mprefecture emuken learn grandfather joseph joestar illegitimate son compile list beneficiary bump freshman name koichi hirose two encounter youth jotaro look highschool student name josuke higashikata whose stand crazy diamond allows manipulate matter way include repair heal fight josuke inadvertently insult pompadour jotaro explain nature stand one use death row inmate name anjuro angelo katagiri escape morioh josuke unknowingly make enemy angelo murder grandfather josuke use power fuse angelo rock however angelo use final moment consciousness reveal someone hit arrow give stand jotaro learn actual artifact possess dios force josuke koichi eventually come across culprit keicho nijimura inflicts koichi arrow young brother okuyasu hold josuke josuke defeat okuyasu heals koichi crazy diamond koichi develop stand call echo keicho defeat reason create stand user create someone able mercy kill father mutated subordinate dios keicho kill stand red hot chili pepper take bow arrow okuyasu join josukes group avenge brother encounter several stand user keicho create eventually find defeat akira otoishi red hot chili pepper user joseph arrives morioh bow arrow take jotaros custody seem moment soon afterward josuke try spend time joseph find baby invisibility stand group encounter stand user eccentric manga artist rohan kishibe middle schooler shigekiyo shigechi yangu beautician name aya tsuji koichi rohan later meet ghost reimi sugimoto dog arnold stumble mysterious ghost alley learn serial killer lurk morioh year murderer handsome office worker name yoshikage kira seek satisfy murderous hand fetish obsession live peaceful quiet life use destructive ability stand killer queen erase evidence crime prompt murder shigechi end expose brief battle jotaro koichi leave injured josuke okuyasu arrive kira escape force aya use stand swap identity man kosaku kawajiri kill assume kosakus life kiras father yoshihiro ghost us stand live photo use bow arrow receive year ago enya geil create army stand user protect son include die cat reincarnate standplant hybrid name stray cat kira take pet kosakus son hayato kawajiri begin suspect father imposter confronts kira get murder kira panic receive new ability pierce yoshihiros arrow second time allow revive hayato follow morning hayato learn kira inflict killer queen new ability bite dust destroy whoever hayato reveals kiras identity rewinding time back hour victim fate fix rohan die one loop josukes group next hayato realize need force kira cancel bite dust others kill death make permanent hayato exploit knowledge gain time loop wake josuke early arrange overhear kira blow cover kira force use killer queen defend cancel bite dust time save josuke ally josuke engages kira pitched battle okuyasu seemingly kill josuke hayato take refuge house kira combine stand power stray cat create invisible projectile bomb kira plant yoshihiros photo hayatos pocket track josuke trick destroy father okuyasu appear nick time swipe stray cat disadvantage kira jotaro koichi rohan arrive emergency worker respond explosion kira attempt activate bite dust nearby paramedic last ditch attempt avert defeat stop jotaro assistance koichi knock path arrive ambulance accidentally crush skull kiras ghost end ghost alley confront reimi get drag unknown fate spectral hand mission accomplish reimi give group final farewells move afterlife next day josuke bid farewell jotaro joseph leave morioh summer draw close diamond unbreakable set fictional town morioh locate scity mprefecture model specific area hirohiko araki hometown sendai miyagi prefecture author say suspense fear cause unusual mysterious resident inspiration although originally intend jojos bizarre adventure mythical manga superpower enjoy draw feeling everyday life diamond unbreakable want create close city stand feature not proactively attack diamond unbreakable serialization araki receive feedback reader felt enemy manga gotten weak although usually not respond reader opinion hear similar comment editorial team make exception state weakness inside heart people thematic element part explain sometimes character inner weakness drive desperate situation time turn weakness something dreadful base stand araki write constantly strong strong enemy appear manga eventually lead try think farthest edge universe real world true strength find not bad thing enemy bad thing person inner weakness part series araki say move away muscle men fell popularity reader want focus fashion design character outfit araki considers everyday fashion cartoonish bizarre clothing would impractical real life also forgo use specific color scheme character give reader different impression various color combination araki say drew several character part naked evoke greek roman god stop much part bit closer home friend next door instead similar hero greek myth like protagonist previous part araki cite josuke higashikata favorite character diamond unbreakable cite shigekiyo yangus harvest favorite stand part although find flaws trashiness adorable character pick stuff ground pretty scary despite prevalent belief manga artist character rohan kishibe believe arakis selfinsert author reveal not model rohan fascinate say unlike rohan value human life art original volumization chapter collect volume list golden wind page announce otsuichi would write novel base part novel prove difficult complete kono mystery sugoi otsuichi claim write page thrown intent write novel live manga take book jojos bizarre adventure another day finally release november set event manga include illustration araki araki publish weekly shnen jump oneshot thus speak rohan kishibe episode confessional starring rohan event part write threechapter story dead man question allman magazine dead man question star yoshikage kira main antagonist part thus speak rohan kishibe dead man question later compile arakis oneshot collection jailbreak execution former launch series star rohan thus speak kishibe rohan issue jump square december feature second entry thus speak rohan kishibe collection entitle thus speak rohan kishibe mutsukabezaka set seven year event part araki write fullcolor story rohan louvre short story display muse louvre part louvre invite bande dessine exhibit story later republish ultra jump rohan louvre release english nbm publish translated title rohan louvre araki collaborate renowned italian fashion brand gucci short story rohan kishibe go gucci womens fashion magazine spur araki write third thus speak rohan kishibe oneshot weekly shnen jump entitle thus speak rohan kishibe episode millionaire village release october issue magazine october warner bros announce part would receive anime television adaptation serve continuation david production series adaptation series air toho warner bros partner produce liveaction film base fourth arc jojos bizarre adventure release august takashi miike direct film star kento yamazaki josuke studio plan worldwide distribution title jojos bizarre adventure diamond unbreakable chapter hop create sequel however film underperformed box office leave possibility future sequels doubt jojos bizarre adventure crazy diamonds demonic heartbreak spinoff manga set morioh write kouhei kadono illustrate tasuku karasuma serialize december may shueishas seinen manga magazine ultra jump chapter collect three tankbon volume light novel adaptation also write kadono release june cheap trick story arc adapt episode behind thus speak rohan kishibe series release december janken boy come story arc adapt episode rockpaperscissors boy release december survey jojos bizarre adventure fan diamond unbreakable choose second favorite story arc vote anime news network rebecca silverman faye hopper review first volume diamond unbreakable silverman call begin slow not instantly engross previous part felt allow josuke hopper describe kinder previous protagonist develop character hopper state diamond unbreakable sometimes criticize lack strong narrative throughline comparison part argue one great strengths allows main character simply lend amiable humanity none overthetop archetype first part ever"
}