{
    "title": "419 12 \"The Friends' Whereabouts! An Island of Giant Birds and a Pink Paradise!\"Transliteration: \"Nakama-tachi no Yukue – Kyōdori no Shima to Momoiro no Rakuen!\" (Japanese:仲間達の行方 巨鳥の島と桃色の楽園!) Yutaka Nakashima Yoshiyuki Suga September 27, 2009(2009-09-27)[21]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_12",
    "transformers_text": "419 12 \"The Friends' Whereabouts! An Island of Giant Birds and a Pink Paradise!\"Transliteration: \"Nakama-tachi no Yukue – Kyōdori no Shima to Momoiro no Rakuen!\" (Japanese:仲間達の行方 巨鳥の島と桃色の楽園!) Yutaka Nakashima Yoshiyuki Suga September 27, 2009(2009-09-27)[21]\n\nChopper lands on an island known as Birdie Kingdom, and finds himself in the nest of two large birds who play with him before accidentally dropping him into the forest below. While searching for food to regain his strength, some residents of the island capture him. When they leave to shoo away  the birds after an unsuccessful attempt at stealing their nest, Chopper escapes the pot and realizes that the birds rule the island. Sanji finds himself on Peachy Island, seemingly entirely populated by beautiful women, and someone named Elizabeth nurses him until he wakes up. He goes to Elizabeth's house to return a handkerchief, only to find that Elizabeth is actually a male cross-dresser, and begins desperately running when the island's residents attempt to get him to cross-dress.",
    "tf_idf_text": "friend whereabouts island giant bird pink paradisetransliteration nakamatachi yukue kydori shima momoiro rakuen japanese yutaka nakashima yoshiyuki suga september chopper land island know birdie kingdom find nest two large bird play accidentally drop forest search food regain strength resident island capture leave shoo away bird unsuccessful attempt steal nest chopper escape pot realize bird rule island sanji find peachy island seemingly entirely populated beautiful woman someone name elizabeth nurse wake go elizabeths house return handkerchief find elizabeth actually male crossdresser begin desperately running island resident attempt get crossdress"
}