{
    "title": "264 1 \"Landing Operations Start! Charge in, Straw Hats!\"Transliteration: \"Jōriku Sakusen Shidō! Mugiwara Ichimi Totsunyū seyo!\" (Japanese:上陸作戦始動! 麦わら一味突入せよ!) Munehisa Sakai Hirohiko Kamisaka May 21, 2006(2006-05-21)[6] July 27, 2014",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "264 1 \"Landing Operations Start! Charge in, Straw Hats!\"Transliteration: \"Jōriku Sakusen Shidō! Mugiwara Ichimi Totsunyū seyo!\" (Japanese:上陸作戦始動! 麦わら一味突入せよ!) Munehisa Sakai Hirohiko Kamisaka May 21, 2006(2006-05-21)[6] July 27, 2014\n\nAs the Straw Hats and their allies are about to reach Enies Lobby, Paulie sketches the island's terrain and explains that, to save Robin, the crew must reach her before she passes through the Gates of Justice(正義の門,Seigi no Mon). Since the Straw Hats are the only ones with any chance of matching the CP9 in combat, the Franky Family and the Galley-La foremen intend to be the first wave so the pirates can rush in on Rocketman. As Enies Lobby draws near, the gigantic Gates of Justice appears in the sky behind it. While his crewmates and allies gaze in awe,Luffyignores the plan and strides past the first of the gates. On the other side of the island, in the Tower of Law(司法の塔,Shihō no Tō),Chief Spandamand other CP9 agent await the arrival ofRob Lucci's group and their prisoners.",
    "tf_idf_text": "land operation start charge straw hatstransliteration jriku sakusen shid mugiwara ichimi totsuny seyo japanese munehisa sakai hirohiko kamisaka may july straw hat ally reach enies lobby paulie sketch islands terrain explains save robin crew must reach pass gate justiceseigi mon since straw hat one chance match combat franky family galleyla foreman intend first wave pirate rush rocketman enies lobby draw near gigantic gate justice appear sky behind crewmates ally gaze aweluffyignores plan stride past first gate side island tower lawshih tchief spandamand agent await arrival ofrob luccis group prisoner"
}