{
    "title": "274 11 \"Give us Your Answer, Robin! The Straw Hats' Outcry!\"Transliteration: \"Kotaero Robin! Mugiwara Ichimi no Sakebi!!\" (Japanese:答えろロビン! 麦わら一味の叫び!!) Yoko Ikeda Hirohiko Kamisaka August 6, 2006(2006-08-06)[20] October 12, 2014",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "274 11 \"Give us Your Answer, Robin! The Straw Hats' Outcry!\"Transliteration: \"Kotaero Robin! Mugiwara Ichimi no Sakebi!!\" (Japanese:答えろロビン! 麦わら一味の叫び!!) Yoko Ikeda Hirohiko Kamisaka August 6, 2006(2006-08-06)[20] October 12, 2014\n\nFranky cannot understand why Robin refuses to be saved after Spandam broke his promise. While Luffy yells in the background, Franky decides to make Robin face him. He uses his remaining cola to inflate his buttocks and with a giant fart, launches himself and Robin outside, onto the balcony, and into Luffy's sight, breaking his chains in the process. Luffy wants to slingshot himself over the waterfall to rescue Robin, but she tells him to stay where he is and that only she wants to die. In front of the courthouse, Yokozuna succumbs to the jurymen's attacks. The marines are about to pour in as the giants arrive and assume control of the position. Kashi throws Usopp up onto the courthouse roof where he joins the assembling Straw Hats. Gathering on the battlements, they face Robin and the CP9, while they wait for the drawbridge to be lowered.",
    "tf_idf_text": "give answer robin straw hat outcrytransliteration kotaero robin mugiwara ichimi sakebi japanese yoko ikeda hirohiko kamisaka august october franky cannot understand robin refuse save spandam break promise luffy yell background franky decides make robin face use remain cola inflate buttock giant fart launch robin outside onto balcony luffys sight break chain process luffy want slingshot waterfall rescue robin tell stay want die front courthouse yokozuna succumbs jurymens attack marine pour giant arrive assume control position kashi throw usopp onto courthouse roof join assemble straw hat gather battlement face robin wait drawbridge lower"
}