{
    "title": "276 13 \"Fated Mother and Daughter! The Mother's Name is Olvia!\"Transliteration: \"Shukumei no Oyako! Sono Haha no Na wa Orubia!\" (Japanese:宿命の母娘! その母の名はオルビア!) Directed by: Toru YamadaStoryboarded by: Eisaku Inoue Hirohiko Kamisaka September 10, 2006(2006-09-10)[22] October 26, 2014",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "276 13 Fated Mother and Daughter The Mother's Name is Ol via Transliteration Shu ku mei no Oya ko So no Hah a no Na wa Or u bia Japanese Directed by Toru Yamada Story boarded by E is aku Inoue Hiro hi ko Kami saka September 10 2006 2006 09 10 22 October 26 2014 Saul is shocked to learn that Robin is Nico Ol via's daughter and that he has been washed up on the shores of Ohara Ol via who returned to the island on a stolen navy ship hurries to the Tree of Omniscience to warn her colleagues of a coming navy fleet However she is too late The government ship that carried Span dam's father S panda in e and his men had already arrived They frighten the island's population into boarding an evacuation ship while the government soldiers arrest the scholars and search the library Professor Clover Robin's mentor urges Robin to board the evacuation ship but she refuses As it becomes clear that the scholars will not be forgiven for their forbidden research Clover asks to be allowed to speak to the heads of the government known as the Five Elder Stars",
    "tf_idf_text": "fat mother daughter mother name via transliteration shu mei oya hah bia japanese direct toru yamada story board aku inoue hiro kami saka september october saul shock learn robin nico vias daughter wash shore ohara via return island steal navy ship hurry tree omniscience warn colleague come navy fleet however late government ship carry span dam father panda men already arrive frighten island population board evacuation ship government soldier arrest scholar search library professor clover robins mentor urge robin board evacuation ship refuse becomes clear scholar not forgiven forbidden research clover ask allow speak head government know five elder star"
}