{
    "title": "277 14 \"The Tragedy of Ohara! The Terror of the Buster Call!\"Transliteration: \"Ohara no Higeki! Basutā Kōru no Kyōfu\" (Japanese:オハラの悲劇! バスターコールの恐怖) Takahiro Imamura Hirohiko Kamisaka September 24, 2006(2006-09-24)[n 7][23] November 2, 2014",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "277 14 The Tragedy of Ohara The Terror of the Buster Call Transliteration Ohara no Higeki Bas ut K ru no Ky fu Japanese Takahiro Imamura Hiro hi ko Kami saka September 24 2006 2006 09 24 n 7 23 November 2 2014 Professor Clover is allowed to speak with one of the Elder Stars and reports of their research He describes a civilization that existed hundreds of years ago and vanished at the time that the world government assumed power He considers the collective evidence which leads him to believe that the government tried to erase their former enemies from history After stating that Ohara has learned too much the Elder Star orders S panda in e to kill the professor and to give the order to destroy the island Suddenly the library is set aflame while the scholars try to save the books Robin admits to being an archeologist and unites with her mother However their reunion does not last long Around them cannon shots from the Buster Call's battleships start to hail down and Ol via sends her daughter off with Saul to flee the island while she joins the effort to save the library's knowledge",
    "tf_idf_text": "tragedy ohara terror buster call transliteration ohara higeki ba japanese takahiro imamura hiro kami saka september november professor clover allow speak one elder star report research describes civilization exist hundred year ago vanish time world government assume power considers collective evidence lead believe government try erase former enemy history state ohara learn much elder star order panda kill professor give order destroy island suddenly library set aflame scholar try save book robin admits archeologist unites mother however reunion not last long around cannon shot buster call battleship start hail via sends daughter saul flee island join effort save library knowledge"
}