{
    "title": "278 15 \"Say You Want to Live! We Are Your Friends!!\"Transliteration: \"Ikitai to Ie! Oretachi wa Nakama da!!\" (Japanese:生きたいと言え! オレ達は仲間だ!!) Yoshihiro Ueda Hirohiko Kamisaka September 24, 2006(2006-09-24)[n 7][23] November 9, 2014",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "278 15 \"Say You Want to Live! We Are Your Friends!!\"Transliteration: \"Ikitai to Ie! Oretachi wa Nakama da!!\" (Japanese:生きたいと言え! オレ達は仲間だ!!) Yoshihiro Ueda Hirohiko Kamisaka September 24, 2006(2006-09-24)[n 7][23] November 9, 2014\n\nSaul fights the battleships, attempting to allow Robin to escape. She tries to board the evacuation ship, but per Spandaine's orders and the village's disdain for her, she is denied access. Vize-Admiral Kuzan, later known asAdmiral Aokiji, enters the scene to engage in battle with Saul. While they fight, the evacuation ship is sunk by the fanatical Vice-Admiral Sakazuki, later known as Admiral Akainu. Saul, on the verge of dying, instructs Robin to flee on his raft. Persuaded by Saul's argument and Sakazuki's action, Kuzan helps Robin escape. From then on, Robin lives a life on the run, not being able to trust even the kindest of people, in a world that believes that her existence alone is a sin. In the present, Robin admits her greatest fear: to be seen as a burden by her crewmates and cast away, because being with her means having the world as their enemy. Finally knowing what kept her away, Sniper King, on Luffy's order, burns the government's flag, declaring war against the World Government itself.",
    "tf_idf_text": "say want live friendstransliteration ikitai oretachi nakama japanese yoshihiro ueda hirohiko kamisaka september november saul fight battleships attempt allow robin escape try board evacuation ship per spandaines order village disdain denied access vizeadmiral kuzan later know asadmiral aokiji enters scene engage battle saul fight evacuation ship sunk fanatical viceadmiral sakazuki later know admiral akainu saul verge die instructs robin flee raft persuade sauls argument sakazukis action kuzan help robin escape robin live life run not able trust even kind people world believe existence alone sin present robin admit great fear see burden crewmates cast away mean world enemy finally know keep away sniper king luffys order burn government flag declare war world government"
}