{
    "title": "284 21 \"I'm Not Gonna Hand Over the Blueprints! Franky's Decision!\"Transliteration: \"Sekkeizu wa Watasanai! Furankī no Ketsudan\" (Japanese:設計図は渡さない! フランキーの決断) Hiroyuki Kakudō Hirohiko Kamisaka November 5, 2006(2006-11-05)[31] January 18, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "284 21 I'm Not Gonna Hand Over the Blueprints Franky's Decision Transliteration Sek kei zu wa Wat asana i Fu rank no Ket sudan Japanese Hiroyuki Kaku d Hiro hi ko Kami saka November 5 2006 2006 11 05 31 January 18 2015 Though initially intimidated when the Straw Hat Pirates declare war on the World Government Span dam regains his composure when the bridge leading to the Tower of Law is disabled midway CP 9 are then about to take their leave for the Gates of Justice when Franky reveals the Pluto n blueprints that he hid in his body Franky proceeds to explain that he and the previous shipwrights only kept the blueprints in case a counter is needed against another ancient weapon revived by the World Government through Robin But seeing Robin not to be the monster the rumors made her out to be Franky decides to gamble the fate of the world on the Straw Hats ' resolve to save their friend and burns the blueprints But then emotionally touched to find his gang are also on Eni es Lobby to save him a distracted Franky finds himself shoved off the balcony by a furious Span dam At that time after contacting the Straw Hats via transponder snail phone to jump aboard Kok oro runs Rocket man up the half lowered drawbridge The sea train hits Franky while jumping through the waterfall and on a crash course into the Tower of Law",
    "tf_idf_text": "not gonna hand blueprint frankys decision transliteration sek kei wat asana rank ket sudan japanese hiroyuki kaku hiro kami saka november january though initially intimidate straw hat pirate declare war world government span dam regain composure bridge lead tower law disable midway take leave gate justice franky reveals pluto blueprint hide body franky proceeds explain previous shipwright keep blueprint case counter need another ancient weapon revive world government robin see robin not monster rumor make franky decides gamble fate world straw hat resolve save friend burn blueprint emotionally touch find gang also eni lobby save distract franky find shove balcony furious span dam time contact straw hat via transponder snail phone jump aboard kok oro run rocket man half lower drawbridge sea train hit franky jump waterfall crash course tower law"
}