{
    "title": "286 23 \"Devil Fruit Powers! Kaku and Jabra Transform!\"Transliteration: \"Akuma no Mi no Chikara! Kaku to Jabura Daihenshin\" (Japanese:悪魔の実の力! カクとジャブラ大変身) Yoshihiro Ueda Hirohiko Kamisaka November 19, 2006(2006-11-19)[33] February 1, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "286 23 Devil Fruit Powers Kaku and Jabr a Transform Transliteration A kuma no Mi no Chikara Kaku to Jab ura Dai he nsh in Japanese Yoshihiro Ueda Hiro hi ko Kami saka November 19 2006 2006 11 19 33 February 1 2015 As Luffy decides to make his way to the Gates of Justice to catch up to Robin and her captors Nami and Sanji have their respective encounters with Kumadori and Kali fa while Franky runs into Fuku rou While Zoro engages Kaku in an intense sword fight Us opp's attempt to steal a key from the sleeping CP 9 agent Jabr a humorously fails as the assassin wakes up and reveals himself to have the power of the Dog Dog Fruit Model Wolf At the same time Kaku reveals to Zoro his newly gained Devil Fruit power the Ox Ox Fruit Model Giraffe But after causing himself and Zoro to fall to the floor where Us opp and Jabr a are Kaku finds himself being ridiculed for his appearance by Jabr a After Us opp accidentally fires a one half of a pair of sea stone handcuffs on to Zoro he ends up provoking Kaku into using a Tempest Kick in his man beast form to vertically cut the building in half Smoke and debris fill the room as half of the building starts to fall",
    "tf_idf_text": "devil fruit power kaku jabr transform transliteration kuma chikara kaku jab ura dai nsh japanese yoshihiro ueda hiro kami saka november february luffy decides make way gate justice catch robin captor nami sanji respective encounter kumadori kali franky run fuku rou zoro engage kaku intense sword fight opps attempt steal key sleep agent jabr humorously fail assassin wake reveals power dog dog fruit model wolf time kaku reveals zoro newly gain devil fruit power fruit model giraffe cause zoro fall floor opp jabr kaku find ridiculed appearance jabr opp accidentally fire one half pair sea stone handcuff zoro end provoke kaku use tempest kick man beast form vertically cut build half smoke debris fill room half building start fall"
}