{
    "title": "286 23 \"Devil Fruit Powers! Kaku and Jabra Transform!\"Transliteration: \"Akuma no Mi no Chikara! Kaku to Jabura Daihenshin\" (Japanese:悪魔の実の力! カクとジャブラ大変身) Yoshihiro Ueda Hirohiko Kamisaka November 19, 2006(2006-11-19)[33] February 1, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "286 23 \"Devil Fruit Powers! Kaku and Jabra Transform!\"Transliteration: \"Akuma no Mi no Chikara! Kaku to Jabura Daihenshin\" (Japanese:悪魔の実の力! カクとジャブラ大変身) Yoshihiro Ueda Hirohiko Kamisaka November 19, 2006(2006-11-19)[33] February 1, 2015\n\nAs Luffy decides to make his way to the Gates of Justice to catch up to Robin and her captors, Nami and Sanji have their respective encounters withKumadoriand Kalifa while Franky runs into Fukurou. While Zoro engages Kaku in an intense sword fight, Usopp's attempt to steal a key from the sleeping CP9 agent Jabra humorously fails as the assassin wakes up and reveals himself to have the power of the Dog Dog Fruit Model: Wolf. At the same time, Kaku reveals to Zoro his newly gained Devil Fruit power: the Ox-Ox Fruit Model: Giraffe. But after causing himself and Zoro to fall to the floor where Usopp and Jabra are, Kaku finds himself being ridiculed for his appearance by Jabra. After Usopp accidentally fires a one half of a pair of sea-stone handcuffs onto Zoro, he ends up provoking Kaku into using a Tempest Kick in his man beast form to vertically cut the building in half. Smoke and debris fill the room as half of the building starts to fall.",
    "tf_idf_text": "devil fruit power kaku jabra transformtransliteration akuma chikara kaku jabura daihenshin japanese yoshihiro ueda hirohiko kamisaka november february luffy decides make way gate justice catch robin captor nami sanji respective encounter withkumadoriand kalifa franky run fukurou zoro engage kaku intense sword fight usopps attempt steal key sleep agent jabra humorously fail assassin wake reveals power dog dog fruit model wolf time kaku reveals zoro newly gain devil fruit power oxox fruit model giraffe cause zoro fall floor usopp jabra kaku find ridiculed appearance jabra usopp accidentally fire one half pair seastone handcuff onto zoro end provoke kaku use tempest kick man beast form vertically cut build half smoke debris fill room half building start fall"
}