{
    "title": "287 24 \"I Won't Kick Even If It Costs Me My Life! Sanji's Chivalry!\"Transliteration: \"Shin demo Keran! Sanji Otoko no Kishidō\" (Japanese:死んでも蹴らん! サンジ男の騎士道!) Hiroaki Miyamoto Yoshiyuki Suga November 26, 2006(2006-11-26)[34] February 8, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "287 24 I Won't Kick Even If It Costs Me My Life Sanji's Chivalry Transliteration Shin demo Keran Sanji O toko no Kishi d Japanese Hiroaki Miyamoto Yoshiyuki Suga November 26 2006 2006 11 26 34 February 8 2015 As the smoke clears from Kaku's man beast enhanced Tempest Kick Zoro and Us opp find they have been handcuffed together Zoro and Us opp learn that each of the keys are numbered but as neither Kaku nor Jab ura have the key needed to free their prey from their sea stone handcuffs the two CP 9 members are forced to resume the fight Chopper arrives and is then sent off to obtain the Number 2 key from one of the other assassins Chopper comes across Nami as she attempted to flee Kumadori after stealing the Number 3 key knocking the CP 9 operative out Soon after Nami and Chopper find a round and glossy Sanji hitting the ground from a few floors up After Nami realizes his opponent was Kali fa Sanji admits to have done his best in trying to get her key but could not bring himself to harm a woman Despite scolding him for being too easy Nami decides to take over and fight Kali fa while leaving Sanji in Chopper's care",
    "tf_idf_text": "wont kick even cost life sanjis chivalry transliteration shin demo keran sanji toko kishi japanese hiroaki miyamoto yoshiyuki suga november february smoke clear kakus man beast enhance tempest kick zoro opp find handcuffed together zoro opp learn key number neither kaku nor jab ura key need free prey sea stone handcuff two member force resume fight chopper arrive send obtain number key one assassins chopper come across nami attempt flee kumadori steal number key knock operative soon nami chopper find round glossy sanji hit ground floor nami realizes opponent kali sanji admit do best try get key could not bring harm woman despite scold easy nami decides take fight kali leave sanji chopper care"
}