{
    "title": "288 25 \"Fukurou's Miscalculation! My Cola is the Water of Life!\"Transliteration: \"Fukurō no Gosan! Ore no Kōra wa Inochi no Mizu\" (Japanese:フクロウの誤算! 俺のコーラは命の水) Yoko Ikeda Koga Naoki December 3, 2006(2006-12-03)[35] February 15, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "288 25 Fuku rou's Miscalculation My Cola is the Water of Life Transliteration Fuku r no Go san Ore no K ra wa In och i no Miz u Japanese Yoko Ikeda Koga Naoki December 3 2006 2006 12 03 35 February 15 2015 As Nami reaches Kali fa while Chopper holds Kumadori at bay Luffy is saved from drowning by Chimney and Gon be as they show him to the underground passage leading to the Gates of Justice Not having access to the key Luffy activates a most newest technique the Third Gear to break through the gate leading to the passage Meanwhile low on reserves as he is down to the last drop of cola Franky gets into a fist fight with Fu kuro as their scuffle takes them to the kitchen At the same time with his Rumble Ball boost already run out Chopper is knocked into the room by Kumadori whom he manages to lock in the giant fridge to Franky's annoyance After a momentary spat between them before watching the cyborg get pummeled by Fu kuro followed a few misfires with other beverages Chopper manages to give Franky the three cola bottles he needs to turn the tide as the cyborg knocks Fu kuro out of the tower",
    "tf_idf_text": "fuku rous miscalculation cola water life transliteration fuku san ore och miz japanese yoko ikeda koga naoki december february nami reach kali chopper hold kumadori bay luffy save drown chimney gon show underground passage lead gate justice not access key luffy activate new technique third gear break gate leading passage meanwhile low reserve last drop cola franky get fist fight kuro scuffle take kitchen time rumble ball boost already run chopper knock room kumadori manage lock giant fridge frankys annoyance momentary spat watch cyborg get pummel kuro follow misfire beverage chopper manages give franky three cola bottle need turn tide cyborg knock kuro tower"
}