{
    "title": "293 30 \"Bubble Master Kalifa! The Soap Trap Closes in on Nami!\"Transliteration: \"Awatsukai Karifa! Nami ni Hakaru Sekken no Wana\" (Japanese:泡使いカリファ! ナミに迫る石鹸の罠) Hiroaki Miyamoto Yoshiyuki Suga January 14, 2007(2007-01-14)[40] March 22, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "293 30 Bubble Master Kali fa The Soap Trap Closes in on Nami Transliteration Awa tsukai Kar if a Nami ni Ha karu Sek ken no Wana Japanese Hiroaki Miyamoto Yoshiyuki Suga January 14 2007 2007 01 14 40 March 22 2015 Having taken three Rumble Balls Chopper transforms into his berserk Monster Point form and easily defeats Kumadori despite his attempts to subdue the instinct driven beast Seeing the unconscious Kumadori being thrown towards Courthouse Plaza after getting Fu kuro's number four key deducing Kali fa has the key needed to free Zoro and Us opp Franky finds himself being knocked off the tower by Chopper Chopper then begins to climb up the outer wall Meanwhile after being momentarily weakened while Kali fa has a bath before she gets herself dressed Nami realizes the essence of Kali fa's Devil Fruit power to be soap related Kali fa explains her ingestion of the Bubble Bubble Fruit allowed her to produce foam from her body that cleans her opponent's body of any strength using her touch to make Nami's legs glossy and smooth to render her unable to walk At the same time covering for Span dam so he can get Robin to the Gates of Justice Lucci waits for Luffy as the pirate eventually reaches his location",
    "tf_idf_text": "bubble master kali soap trap close nami transliteration awa tsukai kar nami karu sek ken wana japanese hiroaki miyamoto yoshiyuki suga january march take three rumble ball chopper transforms berserk monster point form easily defeat kumadori despite attempt subdue instinct drive beast see unconscious kumadori throw towards courthouse plaza get kuros number four key deduce kali key need free zoro opp franky find knock tower chopper chopper begin climb outer wall meanwhile momentarily weaken kali bath get dress nami realize essence kali fas devil fruit power soap relate kali explain ingestion bubble bubble fruit allow produce foam body clean opponent body strength use touch make namis legs glossy smooth render unable walk time cover span dam get robin gate justice lucci wait luffy pirate eventually reach location"
}