{
    "title": "294 31 \"Resounding Bad News! Buster Call Invoked!\"Transliteration: \"Hibikiwataru Kyōhō! Hatsudō Basutā Kōru!\" (Japanese:響き渡る凶報! 発動バスターコール!) Hiroyuki Kakudō Koga Naoki January 21, 2007(2007-01-21)[41] March 29, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "294 31 \"Resounding Bad News! Buster Call Invoked!\"Transliteration: \"Hibikiwataru Kyōhō! Hatsudō Basutā Kōru!\" (Japanese:響き渡る凶報! 発動バスターコール!) Hiroyuki Kakudō Koga Naoki January 21, 2007(2007-01-21)[41] March 29, 2015\n\nAt the Courthouse Plaza, the marines defeat Oimo and Kāshī and capture the Straw Hats' allies in the courthouse. Almost on the Bridge of Hesitation, which leads through the Gates of Justice, Spandam tries to contact the CP9 members at the tower to know what is going on with the pirates. But he learns too late that he accidentally invoked the Buster Call, causing ten battleships and five vice-admirals to be dispatched to Enies Lobby from the nearby navy headquarters. As Robin attempts to reason with him of what will happen to Enies Lobby once the Buster Call is invoked, Spandam makes another mistake by informing the whole island of the coming threat while admitting that he does not care if the 10,000 navy soldiers under him are obliterated in process. This causes the navy soldiers to leave their prisoners and flee to the coast. With the Buster Call underway, the CP9 operatives decide to end their respective matches quickly while Luffy begins his fight against Lucci.",
    "tf_idf_text": "resound bad news buster call invokedtransliteration hibikiwataru kyh hatsud basut kru japanese hiroyuki kakud koga naoki january march courthouse plaza marine defeat oimo ksh capture straw hat ally courthouse almost bridge hesitation lead gate justice spandam try contact member tower know go pirate learns late accidentally invoked buster call cause ten battleship five viceadmirals dispatch enies lobby nearby navy headquarters robin attempt reason happen enies lobby buster call invoke spandam make another mistake inform whole island come threat admit not care navy soldier obliterate process cause navy soldier leave prisoner flee coast buster call underway operative decide end respective match quickly luffy begin fight lucci"
}