{
    "title": "295 32 \"Five Namis? Nami Strikes Back With Mirages!\"Transliteration: \"Gonin no Nami? Hangeki wa Shinkirō to Tomo ni!\" (Japanese:5人のナミ? 反撃は蜃気楼とともに!) Yoshihiro Ueda Yoshiyuki Suga January 28, 2007(2007-01-28)[42] April 5, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "295 32 Five Nam is Nami Strikes Back With Mirages Transliteration Gon in no Nami Han geki wa Shin kir to Tomo ni Japanese 5 Yoshihiro Ueda Yoshiyuki Suga January 28 2007 2007 01 28 42 April 5 2015 Lucci and Luffy begin their mutually anticipated duel while Kali fa manages to subject Nami to her Golden Time attack to completely smooth her into a weakling But before Kai lf a could deliver the death blow Nami uses her Mirage Tempo to distract her before Chopper crashes through the wall After attacking both the CP 9 operative and an astonished Nami due to his inability to tell friend from foe in his Monster Point form Chopper proceeds to rip Kali fa's bathtub out of its foundation and throws it down stairs where Sanji is While Nami is deeply worried about Chopper she realizes she needs to focus on Kali fa while learning her opponent's effects can be washed off with water Kali fa attempts to stop Nami from reaching the torn up water pipes only for Nami to use her Rain Tempo to restore herself Now having scouted out Kali fa's abilities Nami takes their fight to its climax by creating four illusion ary doubles of herself",
    "tf_idf_text": "five nam nami strike back mirages transliteration gon nami han geki shin kir tomo japanese yoshihiro ueda yoshiyuki suga january april lucci luffy begin mutually anticipate duel kali manages subject nami golden time attack completely smooth weakling kai could deliver death blow nami use mirage tempo distract chopper crash wall attack operative astonish nami due inability tell friend foe monster point form chopper proceeds rip kali fa bathtub foundation throw stair sanji nami deeply worried chopper realize need focus kali learn opponent effect wash water kali attempt stop nami reach torn water pipe nami use rain tempo restore scout kali fas ability nami take fight climax create four illusion ary double"
}