{
    "title": "295 32 \"Five Namis? Nami Strikes Back With Mirages!\"Transliteration: \"Gonin no Nami? Hangeki wa Shinkirō to Tomo ni!\" (Japanese:5人のナミ? 反撃は蜃気楼とともに!) Yoshihiro Ueda Yoshiyuki Suga January 28, 2007(2007-01-28)[42] April 5, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "295 32 \"Five Namis? Nami Strikes Back With Mirages!\"Transliteration: \"Gonin no Nami? Hangeki wa Shinkirō to Tomo ni!\" (Japanese:5人のナミ? 反撃は蜃気楼とともに!) Yoshihiro Ueda Yoshiyuki Suga January 28, 2007(2007-01-28)[42] April 5, 2015\n\nLucci and Luffy begin their mutually anticipated duel while Kalifa manages to subject Nami to her Golden Time attack to completely smooth her into a weakling. But before Kailfa could deliver the death blow, Nami uses her Mirage Tempo to distract her before Chopper crashes through the wall. After attacking both the CP9 operative and an astonished Nami due to his inability to tell friend from foe in his Monster Point form, Chopper proceeds to rip Kalifa's bathtub out of its foundation and throws it down stairs where Sanji is. While Nami is deeply worried about Chopper, she realizes she needs to focus on Kalifa while learning her opponent's effects can be washed off with water. Kalifa attempts to stop Nami from reaching the torn up water pipes, only for Nami to use her Rain Tempo to restore herself. Now having scouted out Kalifa's abilities, Nami takes their fight to its climax by creating four illusionary doubles of herself.",
    "tf_idf_text": "five namis nami strike back miragestransliteration gonin nami hangeki shinkir tomo japanese yoshihiro ueda yoshiyuki suga january april lucci luffy begin mutually anticipate duel kalifa manages subject nami golden time attack completely smooth weakling kailfa could deliver death blow nami use mirage tempo distract chopper crash wall attack operative astonish nami due inability tell friend foe monster point form chopper proceeds rip kalifas bathtub foundation throw stair sanji nami deeply worried chopper realize need focus kalifa learn opponent effect wash water kalifa attempt stop nami reach torn water pipe nami use rain tempo restore scout kalifas ability nami take fight climax create four illusionary double"
}