{
    "title": "296 33 \"Nami's Decision! Fire at the Out-Of-Control Chopper!\"Transliteration: \"Nami no Ketsudan! Bōsō Choppā o Ute!\" (Japanese:ナミの決断! 暴走チョッパーを撃て!) Masahiro Hosoda Koga Naoki February 4, 2007(2007-02-04)[43] April 12, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "296 33 \"Nami's Decision! Fire at the Out-Of-Control Chopper!\"Transliteration: \"Nami no Ketsudan! Bōsō Choppā o Ute!\" (Japanese:ナミの決断! 暴走チョッパーを撃て!) Masahiro Hosoda Koga Naoki February 4, 2007(2007-02-04)[43] April 12, 2015\n\nThe fight between Nami and Kalifa climaxes when the former unveils her Fata Morgana ability and the latter makes a final attempt to take Nami and her illusion clones out by sweeping the room with a tidal wave of bubbles. But Nami's victory has been ensured as Kalifa is struck by a horizontal lightning bolt. Franky, who had followed Chopper in climbing up the walls of the Tower of Law, arrives as Nami is about to retrieve the Number Two key from Kalifa's person. After discussing Chopper's Monster Point form, they conceive a plan to save Chopper as they find him in the room where the still handcuffed Zoro and Usopp are holding their own against Kaku and Jabra. After Franky uses his air pressure cannon to blast Chopper outside into the seawater, Nami uses Kalifa's key to free Zoro and Usopp from their shackles.",
    "tf_idf_text": "namis decision fire outofcontrol choppertransliteration nami ketsudan chopp ute japanese masahiro hosoda koga naoki february april fight nami kalifa climax former unveils fata morgana ability latter make final attempt take nami illusion clone sweep room tidal wave bubble namis victory ensure kalifa struck horizontal lightning bolt franky follow chopper climb wall tower law arrive nami retrieve number two key kalifas person discuss chopper monster point form conceive plan save chopper find room still handcuff zoro usopp hold kaku jabra franky use air pressure cannon blast chopper outside seawater nami use kalifas key free zoro usopp shackle"
}