{
    "title": "297 34 \"Hunter Sanji Makes An Entrance? Elegy for a Lying Wolf!\"Transliteration: \"Garibito Sanji Tōjō? Usotsuki Ōkami ni Okuru Banka\" (Japanese:狩人サンジ登場!? 嘘つき狼に贈る挽歌) Katsumi Tokoro Yoshiyuki Suga February 11, 2007(2007-02-11)[44] April 19, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "297 34 \"Hunter Sanji Makes An Entrance? Elegy for a Lying Wolf!\"Transliteration: \"Garibito Sanji Tōjō? Usotsuki Ōkami ni Okuru Banka\" (Japanese:狩人サンジ登場!? 嘘つき狼に贈る挽歌) Katsumi Tokoro Yoshiyuki Suga February 11, 2007(2007-02-11)[44] April 19, 2015\n\nAfter pulling the unconscious Chopper out of the sea once he returned to his usual form, making his peace with the reindeer, Franky ponders on how he can cross the wild waters to reach the Bridge of Hesitation. Chimney and Gonbe appear outside the secret passage and lead him to Kokoro and the tunnel. Past the room where Luffy is fighting Lucci, Spandam uses Funkfreed to stop Robin's attempted escape and proceeds to drag her by her hair towards the Gates of Justice. In the last remaining fight in the Tower of Law, Zoro and Kaku exchange heavy blows while Jabra overwhelms Usopp and Nami and is about to kill the former. Having been restored to normal after being exposed to the water in Kalifa's bathtub, Sanji steps in to deal with Jabra while telling Usopp to go find and save Robin.",
    "tf_idf_text": "hunter sanji make entrance elegy lie wolftransliteration garibito sanji usotsuki kami okuru banka japanese katsumi tokoro yoshiyuki suga february april pull unconscious chopper sea return usual form make peace reindeer franky ponders cross wild water reach bridge hesitation chimney gonbe appear outside secret passage lead kokoro tunnel past room luffy fight lucci spandam us funkfreed stop robin attempt escape proceeds drag hair towards gate justice last remain fight tower law zoro kaku exchange heavy blow jabra overwhelms usopp nami kill former restore normal exposed water kalifas bathtub sanji step deal jabra tell usopp find save robin"
}