{
    "title": "298 35 \"Fiery Kicks! Sanji's Full Course of Foot Techniques!\"Transliteration: \"Shakunetsu no Keri! Sanji Ashiwaza no Furukōsu\" (Japanese:灼熱の蹴り! サンジ足技のフルコース) Hiroyuki Kakudō Koga Naoki February 25, 2007(2007-02-25)[45] April 26, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "298 35 \"Fiery Kicks! Sanji's Full Course of Foot Techniques!\"Transliteration: \"Shakunetsu no Keri! Sanji Ashiwaza no Furukōsu\" (Japanese:灼熱の蹴り! サンジ足技のフルコース) Hiroyuki Kakudō Koga Naoki February 25, 2007(2007-02-25)[45] April 26, 2015\n\nAs Sanji takes over fighting Jabra, Nami drags Usopp from the fight to go after Robin. But while Nami intended to go down stairs, Usopp has a better idea. Meanwhile, Sanji starts exchanging blows with Jabra, who sends him flying into the hallway. Continuing their fight there, Jabra attempts to trick Sanji into lowering his guard by offering him his key with a made-up story of being Robin's long-lost brother. Sanji sees through the real trick and kicks Jabra but before getting the key he gets overwhelmed by Jabra going all out by revealing he is the only CP9 operative who can move after using the Iron Body skill. Sanji responds by making his foot red hot, unveiling his newest technique: Diable Jambe, whose intense heat bypasses Jabra's defenses and leads to his defeat in a fierce mid-air final clash.",
    "tf_idf_text": "fiery kick sanjis full course foot techniquestransliteration shakunetsu keri sanji ashiwaza furuksu japanese hiroyuki kakud koga naoki february april sanji take fight jabra nami drag usopp fight robin nami intend stair usopp good idea meanwhile sanji start exchange blow jabra send fly hallway continue fight jabra attempt trick sanji lower guard offering key madeup story robins longlost brother sanji see real trick kick jabra get key get overwhelmed jabra go reveal operative move use iron body skill sanji responds make foot red hot unveil new technique diable jambe whose intense heat bypass jabras defense lead defeat fierce midair final clash"
}