{
    "title": "298 35 \"Fiery Kicks! Sanji's Full Course of Foot Techniques!\"Transliteration: \"Shakunetsu no Keri! Sanji Ashiwaza no Furukōsu\" (Japanese:灼熱の蹴り! サンジ足技のフルコース) Hiroyuki Kakudō Koga Naoki February 25, 2007(2007-02-25)[45] April 26, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "298 35 Fiery Kicks Sanji's Full Course of Foot Techniques Transliteration Shaku nets u no Keri Sanji A shi waz a no Fur uk su Japanese Hiroyuki Kaku d Koga Naoki February 25 2007 2007 02 25 45 April 26 2015 As Sanji takes over fighting Jabr a Nami drags Us opp from the fight to go after Robin But while Nami intended to go down stairs Us opp has a better idea Meanwhile Sanji starts exchanging blows with Jabr a who sends him flying into the hallway Continuing their fight there Jabr a attempts to trick Sanji into lowering his guard by offering him his key with a made up story of being Robin's long lost brother Sanji sees through the real trick and kicks Jabr a but before getting the key he gets overwhelmed by Jabr a going all out by revealing he is the only CP 9 operative who can move after using the Iron Body skill Sanji responds by making his foot red hot unveiling his newest technique Diable Jam be whose intense heat bypasses Jabr a's defenses and leads to his defeat in a fierce mid air final clash",
    "tf_idf_text": "fiery kick sanjis full course foot technique transliteration shaku net keri sanji shi waz fur japanese hiroyuki kaku koga naoki february april sanji take fight jabr nami drag opp fight robin nami intend stair opp good idea meanwhile sanji start exchange blow jabr send fly hallway continue fight jabr attempt trick sanji lower guard offering key make story robin long lose brother sanji see real trick kick jabr get key get overwhelmed jabr go reveal operative move use iron body skill sanji responds make foot red hot unveil new technique diable jam whose intense heat bypass jabr defense lead defeat fierce mid air final clash"
}