{
    "title": "300 37 \"Demon God Zoro! An Incarnation of Asura Born From Fighting Spirit!\"Transliteration: \"Kishin Zoro! Kihaku ga Miseta Ashura no Keshin\" (Japanese:鬼神ゾロ! 気迫が見せた阿修羅の化身) Yoko Ikeda Koga Naoki March 11, 2007(2007-03-11)[47] May 10, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "300 37 Demon God Zoro An Incarnation of Asura Born From Fighting Spirit Transliteration Kish in Zoro Ki haku ga Mi set a A shura no Kesh in Japanese Yoko Ikeda Koga Naoki March 11 2007 2007 03 11 47 May 10 2015 After being relentlessly attacked while hearing Kaku insulting Robin Zoro's resulting rage manifested itself in a dark aura that Kaku thought to be a demon Both swordsmen decide to finish the fight with Zoro the victor as he unveils his new sword style Demon Aura Nine Sword Style Asura After giving Kaku the message from Pauli e that he and the other CP 9 agents are fired Zoro takes the Number Five key as Sanji arrives Meanwhile as a fearful Robin makes a final attempt to keep herself from dragged across the Bridge of Hesitation by biting into the bridge's rim Luffy attempts to hold Lucci long enough for Franky to make his way towards Robin Luffy activates Second Gear while Lucci takes on his Man Beast form Despite this Luffy is able to give Franky the opening needed to escape as he and the CP 9 agent face each other",
    "tf_idf_text": "demon god zoro incarnation asura bear fight spirit transliteration kish zoro haku set shura kesh japanese yoko ikeda koga naoki march may relentlessly attack hear kaku insulting robin zoros result rage manifest dark aura kaku think demon swordsman decide finish fight zoro victor unveils new sword style demon aura nine sword style asura give kaku message pauli agent fire zoro take number five key sanji arrives meanwhile fearful robin make final attempt keep drag across bridge hesitation bite bridge rim luffy attempt hold lucci long enough franky make way towards robin luffy activate second gear lucci take man beast form despite luffy able give franky opening need escape agent face"
}