{
    "title": "301 38 \"Spandam Frightened! The Hero on the Tower of Law!\"Transliteration: \"Spandamu Kyōgaku! Shihō no Tō ni Tatsu Eiyū\" (Japanese:スパンダム驚愕! 司法の塔に立つ英雄) Yoshihiro Ueda Yoshiyuki Suga March 18, 2007(2007-03-18)[48] May 17, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "301 38 \"Spandam Frightened! The Hero on the Tower of Law!\"Transliteration: \"Spandamu Kyōgaku! Shihō no Tō ni Tatsu Eiyū\" (Japanese:スパンダム驚愕! 司法の塔に立つ英雄) Yoshihiro Ueda Yoshiyuki Suga March 18, 2007(2007-03-18)[48] May 17, 2015\n\nAfter the Gates of Justice has completely opened, having managed to loosen Robin's tooth grip on the bridge's rim, Spandam ties a rope around her waist and drags her towards the marines awaiting them. In the process, Spandam proudly reveals to Robin that he is the son of Spandaine, the previous CP9 head who was responsible for the Buster Call at Ohara. This causes Robin to be utterly livid yet powerless as stream of tears runs down her cheeks as all seems hopeless after Franky was seemingly taken out by a mine Spandam placed at the entrance to the Bridge of Hesitation. But at the last second, an explosive projectile hits the back of Spandam's head. A stream of projectiles falls on the marines gathered around him. The culprit is revealed to be Usopp, standing atop Tower of Law far from the marines' firing range. Robin attempts to run towards the other side the bridge before Franky saves her from being shot by the marines. After receiving the keys by Usopp, Franky frees Robin from the sea stone handcuffs, where she proceeds to vent her rage out on Spandam by slapping him repeatedly with her powers. As Usopp leaves to regroup with the others, he hears something before an explosion occurs.",
    "tf_idf_text": "spandam frighten hero tower lawtransliteration spandamu kygaku shih tatsu eiy japanese yoshihiro ueda yoshiyuki suga march may gate justice completely open manage loosen robins tooth grip bridge rim spandam tie rope around waist drag towards marine await process spandam proudly reveal robin son spandaine previous head responsible buster call ohara cause robin utterly livid yet powerless stream tear run cheek seem hopeless franky seemingly take mine spandam place entrance bridge hesitation last second explosive projectile hit back spandams head stream projectile fall marine gather around culprit reveal usopp stand atop tower law far marines fire range robin attempt run towards side bridge franky save shot marine receive key usopp franky free robin sea stone handcuff proceeds vent rage spandam slap repeatedly power usopp leaf regroup others hears something explosion occurs"
}