{
    "title": "301 38 \"Spandam Frightened! The Hero on the Tower of Law!\"Transliteration: \"Spandamu Kyōgaku! Shihō no Tō ni Tatsu Eiyū\" (Japanese:スパンダム驚愕! 司法の塔に立つ英雄) Yoshihiro Ueda Yoshiyuki Suga March 18, 2007(2007-03-18)[48] May 17, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "301 38 Span dam Frightened The Hero on the Tower of Law Transliteration Sp and amu Ky gaku Shih no T ni Tatsu E iy Japanese Yoshihiro Ueda Yoshiyuki Suga March 18 2007 2007 03 18 48 May 17 2015 After the Gates of Justice has completely opened having managed to loosen Robin's tooth grip on the bridge's rim Span dam ties a rope around her waist and drags her towards the marines awaiting them In the process Span dam proudly reveals to Robin that he is the son of S panda in e the previous CP 9 head who was responsible for the Buster Call at Ohara This causes Robin to be utterly livid yet powerless as stream of tears runs down her cheeks as all seems hopeless after Franky was seemingly taken out by a mine Span dam placed at the entrance to the Bridge of Hesitation But at the last second an explosive projectile hits the back of Span dam's head A stream of projectiles falls on the marines gathered around him The culprit is revealed to be Us opp standing a top Tower of Law far from the marines ' firing range Robin attempts to run towards the other side the bridge before Franky saves her from being shot by the marines After receiving the keys by Us opp Franky frees Robin from the sea stone handcuffs where she proceeds to vent her rage out on Span dam by slapping him repeatedly with her powers As Us opp leaves to regroup with the others he hears something before an explosion occurs",
    "tf_idf_text": "span dam frighten hero tower law transliteration amu gaku shih tatsu japanese yoshihiro ueda yoshiyuki suga march may gate justice completely open manage loosen robins tooth grip bridge rim span dam tie rope around waist drag towards marine await process span dam proudly reveal robin son panda previous head responsible buster call ohara cause robin utterly livid yet powerless stream tear run cheek seem hopeless franky seemingly take mine span dam place entrance bridge hesitation last second explosive projectile hit back span dam head stream projectile fall marine gather around culprit reveal opp stand top tower law far marines fire range robin attempt run towards side bridge franky save shot marine receive key opp franky free robin sea stone handcuff proceeds vent rage span dam slap repeatedly power opp leaf regroup others hears something explosion occurs"
}