{
    "title": "302 39 \"Robin Freed! Luffy vs. Lucci, Showdown Between Leaders!\"Transliteration: \"Robin Kaihō! Rufi Tai Rutchi Chōjō Kessen\" (Japanese:ロビン解放! ルフィ対ルッチ頂上決戦) Directed by: Akira ShimizuStoryboarded by: Seiji Okuda Koga Naoki March 25, 2007(2007-03-25)[49] May 31, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "302 39 \"Robin Freed! Luffy vs. Lucci, Showdown Between Leaders!\"Transliteration: \"Robin Kaihō! Rufi Tai Rutchi Chōjō Kessen\" (Japanese:ロビン解放! ルフィ対ルッチ頂上決戦) Directed by: Akira ShimizuStoryboarded by: Seiji Okuda Koga Naoki March 25, 2007(2007-03-25)[49] May 31, 2015\n\nAs one of the naval ships blasts the top floors of the Tower of Law down, which takes out the drawbridge and falls into the waterfall, Robin and Franky goes ahead of the others to capture the ship Spandam had intended to use to bring the former to navy headquarters. Spandam has all men attempt to subdue the two by any means which fails comically. Meanwhile, Lucci figures out the double-edged nature of Luffy's Second Gear as he tells the youth that the Buster Call is about to begin. Anticipating that the other Straw Hats would take the underground passage, Lucci tears a hole into a wall of the underwater chamber to flood the passageway. The Fleet arrives and the Buster Call on Enies Lobby commences.",
    "tf_idf_text": "robin free luffy lucci showdown leaderstransliteration robin kaih rufi tai rutchi chj kessen japanese direct akira shimizustoryboarded seiji okuda koga naoki march may one naval ship blast top floor tower law take drawbridge fall waterfall robin franky go ahead others capture ship spandam intend use bring former navy headquarters spandam men attempt subdue two mean fail comically meanwhile lucci figure doubleedged nature luffys second gear tell youth buster call begin anticipate straw hat would take underground passage lucci tear hole wall underwater chamber flood passageway fleet arrive buster call enies lobby commences"
}