{
    "title": "304 41 \"I Can't Protect Anyone Unless I Win! Third Gear Activated!\"Transliteration: \"Katenakya Dare mo Mamorenai! Gia Sado Shidō\" (Japanese:勝てなきゃ誰も守れない! ギア3始動) Directed by: Makoto SonodaStoryboarded by: Naotoshi Shida Yoshiyuki Suga April 8, 2007(2007-04-08)[51] June 14, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "304 41 \"I Can't Protect Anyone Unless I Win! Third Gear Activated!\"Transliteration: \"Katenakya Dare mo Mamorenai! Gia Sado Shidō\" (Japanese:勝てなきゃ誰も守れない! ギア3始動) Directed by: Makoto SonodaStoryboarded by: Naotoshi Shida Yoshiyuki Suga April 8, 2007(2007-04-08)[51] June 14, 2015\n\nThe Buster Call ships have reached Enies Lobby, passing the Bridge of Hesitation to spare Robin as they still want to capture her. Robin is traumatized by the onslaught as she is forced to witness the destruction for a second time in her life. At the same time, as Zoro and Sanji carry a wounded Usopp through the underground passage, Nami, Kokoro, Chimney, and Gonbe are ahead of them before they are forced to turn back as a consequence of the flooding caused by Lucci. Luffy and Lucci take their fight to the next floor above the sea level to resume their fight with the latter having the greater advantage after Luffy's Second Gear ended. Though Lucci offers Luffy a chance to run away and save his friends, the pirate knows not to trust the CP9 agent as he reveals his other trump card: Third Gear. Luffy blows air into his arm to have it grow before using it to hit Lucci as the Buster Call ships witness a giant fist punching out of the pillar.",
    "tf_idf_text": "cant protect anyone unless win third gear activatedtransliteration katenakya dare mamorenai gia sado shid japanese direct makoto sonodastoryboarded naotoshi shida yoshiyuki suga april june buster call ship reach enies lobby pass bridge hesitation spare robin still want capture robin traumatize onslaught force witness destruction second time life time zoro sanji carry wound usopp underground passage nami kokoro chimney gonbe ahead force turn back consequence flooding cause lucci luffy lucci take fight next floor sea level resume fight latter great advantage luffys second gear end though lucci offer luffy chance run away save friend pirate know not trust agent reveals trump card third gear luffy blow air arm grow use hit lucci buster call ship witness giant fist punching pillar"
}