{
    "title": "305 42 \"Shivering Past! Dark Justice and Rob Lucci!\"Transliteration: \"Senritsu no Kako! Yami no Seigi to Robu Rutchi\" (Japanese:戦慄の過去! 闇の正義とロブ·ルッチ) Katsumi Tokoro Koga Naoki April 15, 2007(2007-04-15)[52] June 21, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "305 42 \"Shivering Past! Dark Justice and Rob Lucci!\"Transliteration: \"Senritsu no Kako! Yami no Seigi to Robu Rutchi\" (Japanese:戦慄の過去! 闇の正義とロブ·ルッチ) Katsumi Tokoro Koga Naoki April 15, 2007(2007-04-15)[52] June 21, 2015\n\nAfter Rob Lucci is knocked onto his ship by Luffy's enlarged fist, Vice Admiral Doberman orders his men to stand down when they failed to recognize the CP9 Agent. Doberman proceeds to reveal to his men that fifteen years ago, a 13-year-old Rob Lucci is sent as an emissary of the world government to help a country at war with pirates. Prior to his arrival, five hundred of the country's soldiers were taken hostage with the pirates' captain using them to take the king's throne. Allowing himself to be captured, Lucci murdered all five hundred hostages before executing the pirate's captain to resolve the matter. Though Doberman's crew were shocked by Lucci's actions, the Vice Admiral voices that is the reason why he is not taking actions in securing Robin as Lucci is suitable for the task. By that time, Luffy makes it to Doberman's ship and proceeds to fight Lucci as Vice Admiral Onigumo orders the ships to redirect their cannons to the gradually damaged vessel. In the underwater passageway, Zoro, Sanji and Usopp catch up to Nami and the others. The water flooding the passage behind them washes them back down the tunnel.",
    "tf_idf_text": "shiver past dark justice rob luccitransliteration senritsu kako yami seigi robu rutchi japanese katsumi tokoro koga naoki april june rob lucci knock onto ship luffys enlarge fist vice admiral doberman order men stand fail recognize agent doberman proceeds reveal men fifteen year ago yearold rob lucci send emissary world government help country war pirate prior arrival five hundred country soldier take hostage pirate captain use take king throne allow capture lucci murder five hundred hostage execute pirate captain resolve matter though doberman crew shocked luccis action vice admiral voice reason not take action secure robin lucci suitable task time luffy make doberman ship proceeds fight lucci vice admiral onigumo order ship redirect cannon gradually damage vessel underwater passageway zoro sanji usopp catch nami others water flood passage behind wash back tunnel"
}