{
    "title": "306 43 \"A Mysterious Mermaid Appears? As Consciousness Fades Away...\"Transliteration: \"Maboroshi no Ningyo Awareru? Usure Yuku Ishiki no Naka de\" (Japanese:幻の人魚現る? 薄れゆく意識のなかで) Directed by: Keisuke ŌnishiStoryboarded by: Yoshihiro Ueda Yoshiyuki Suga April 22, 2007(2007-04-22)[53] June 28, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "306 43 \"A Mysterious Mermaid Appears? As Consciousness Fades Away...\"Transliteration: \"Maboroshi no Ningyo Awareru? Usure Yuku Ishiki no Naka de\" (Japanese:幻の人魚現る? 薄れゆく意識のなかで) Directed by: Keisuke ŌnishiStoryboarded by: Yoshihiro Ueda Yoshiyuki Suga April 22, 2007(2007-04-22)[53] June 28, 2015\n\nAfter fighting Lucci in Third Gear for a minute, barely escaping cannon fire in time, Luffy is left to cope with the technique's side effect of his body shrinking to a fraction of its original size for around the same time. Luffy attempts to hide from Lucci to no avail as Lucci finds and pins him into the wall and prepares to kill him. Luckily, the damage from Luffy's initial punch while in Third Gear takes its toll on Lucci's legs with the agent stopping in his tracks as Luffy regains his usual size. At the other end of the Bridge of Hesitation, Spandam makes an attempt on Robin's life with Funkfreed, only for Franky to stop the blade and force him to assume his elephant form. After explaining his reasons to support the Straw Hats, Franky crushes Spandam under Funkfreed's weight before he and Robin, who has managed to regain her composure, decide to take the escort ship. Meanwhile, having reached the entry point of Enies Lobby, the Galley-La foremen, the Franky Family, Yokozuna and the giants are forced to watch the fleeing marines allowed onto three of the Buster Call's battleships that soon drift out into position. In the underground passage, the drowning group of Nami, Zoro, Usopp, Sanji, Chopper, Chimney, and Gonbe are about to lose hope when they are saved by a mermaid: revealed to be Kokoro, to everyone's exasperated shock.",
    "tf_idf_text": "mysterious mermaid appear consciousness fade awaytransliteration maboroshi ningyo awareru usure yuku ishiki naka japanese direct keisuke nishistoryboarded yoshihiro ueda yoshiyuki suga april june fight lucci third gear minute barely escape cannon fire time luffy leave cope technique side effect body shrink fraction original size around time luffy attempt hide lucci avail lucci find pin wall prepares kill luckily damage luffys initial punch third gear take toll luccis legs agent stop track luffy regains usual size end bridge hesitation spandam make attempt robin life funkfreed franky stop blade force assume elephant form explain reason support straw hat franky crush spandam funkfreeds weight robin manage regain composure decide take escort ship meanwhile reach entry point enies lobby galleyla foreman franky family yokozuna giant force watch flee marine allow onto three buster call battleship soon drift position underground passage drown group nami zoro usopp sanji chopper chimney gonbe lose hope save mermaid reveal kokoro everyones exasperate shock"
}