{
    "title": "307 44 \"Cannon Fire Sinks the Island! Franky's Lamentation!\"Transliteration: \"Hōka ni Shizumu Shima! Furankī Munen no Sakebi\" (Japanese:砲火に沈む島! フランキー無念の叫び) Hiroyuki Kakudō Koga Naoki April 29, 2007(2007-04-29)[54] July 12, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "307 44 Cannon Fire Sinks the Island Franky's Lamentation Transliteration H ka ni Shi zum u Shima Fu rank Mun en no Sake bi Japanese Hiroyuki Kaku d Koga Naoki April 29 2007 2007 04 29 54 July 12 2015 Franky and Robin finish throwing the last remaining marines off of their commandeered convoy ship when Kok oro in mermaid form jumps aboard with the rest of the Straw Hats Chimney and Gon be managing to survive their brush with a watery grave due to the shock of their rescuer's appearance Kok oro explains that mermaids like her are able to walk on land after thirty years ' time before everyone is happy to see Robin The joyous reunion does not last long as Zoro Us opp and Franky see the inferno that was Eni es Lobby Zoro notes that they should remain in case the navy focuses on them while waiting for Luffy As Sanji joins the group one of the ships announces that the Straw Hats ' accomplices has been wiped out along with the main gate This breaks Franky's heart to hear his gang have been slaughtered as he yells for Luffy that he better not get himself killed As the fleet turns its attention toward the Bridge of Hesitation having managed to wound Lucci in the legs Luffy decides to finish the fight in his Second Gear",
    "tf_idf_text": "cannon fire sink island frankys lamentation transliteration shi zum shima rank mun sake japanese hiroyuki kaku koga naoki april july franky robin finish throw last remaining marine commandeer convoy ship kok oro mermaid form jump aboard rest straw hat chimney gon manage survive brush watery grave due shock rescuer appearance kok oro explain mermaid like able walk land thirty year time everyone happy see robin joyous reunion not last long zoro opp franky see inferno eni lobby zoro note remain case navy focus wait luffy sanji join group one ship announces straw hat accomplice wipe along main gate break frankys heart hear gang slaughter yell luffy well not get kill fleet turn attention toward bridge hesitation manage wound lucci legs luffy decides finish fight second gear"
}