{
    "title": "308 45 \"Wait for Luffy! Mortal Combat on the Bridge of Hesitation!\"Transliteration: \"Rufi o Mate! Tamerai no Hashi no Shitō!\" (Japanese:ルフィを待て! ためらいの橋の死闘!) Directed by: Hiroyuki SatōStoryboarded by: Akiko Fujisawa Yoshiyuki Suga May 6, 2007(2007-05-06)[55] July 19, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "308 45 \"Wait for Luffy! Mortal Combat on the Bridge of Hesitation!\"Transliteration: \"Rufi o Mate! Tamerai no Hashi no Shitō!\" (Japanese:ルフィを待て! ためらいの橋の死闘!) Directed by: Hiroyuki SatōStoryboarded by: Akiko Fujisawa Yoshiyuki Suga May 6, 2007(2007-05-06)[55] July 19, 2015\n\nThe fight between Luffy and Lucci reaches its climax as the CP9 assassin makes use of his most powerful technique: the Six King Pistol. The Bridge of Hesitation is surrounded by battleships that use their cannon fire to sever the bridge's first pillar, where Luffy is fighting, from the rest. Having cut off the Straw Hats' captain's retreat, the marines send their two hundred captains and commanders to recapture Robin while killing off the Straw Hats. During the fight, with Chopper still unable to move and Sanji nowhere to be seen, Robin joins her friends in fighting the Marine's strongest fighters. Meanwhile, after enduring punishing blows from Lucci, Luffy is at his limit and falls to the ground with Usopp standing on the bridge above looking down, horrified by the sight.",
    "tf_idf_text": "wait luffy mortal combat bridge hesitationtransliteration rufi mate tamerai hashi shit japanese directed hiroyuki satstoryboarded akiko fujisawa yoshiyuki suga may july fight luffy lucci reach climax assassin make use powerful technique six king pistol bridge hesitation surround battleship use cannon fire sever bridge first pillar luffy fight rest cut straw hat captain retreat marine send two hundred captain commander recapture robin kill straw hat fight chopper still unable move sanji nowhere see robin join friend fight marine strong fighter meanwhile endure punish blow lucci luffy limit fall ground usopp stand bridge look horrify sight"
}