{
    "title": "309 46 \"Fists Full of Emotion! Luffy Unleashes Gatling with All His Might!\"Transliteration: \"Kobushi ni Kometa Omoi! Rufi Konshin no Gātoringu\" (Japanese:拳に込めた想い! ルフィ渾身の銃乱打) Makoto Sonoda Koga Naoki May 13, 2007(2007-05-13)[56] July 26, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "309 46 \"Fists Full of Emotion! Luffy Unleashes Gatling with All His Might!\"Transliteration: \"Kobushi ni Kometa Omoi! Rufi Konshin no Gātoringu\" (Japanese:拳に込めた想い! ルフィ渾身の銃乱打) Makoto Sonoda Koga Naoki May 13, 2007(2007-05-13)[56] July 26, 2015\n\nWhile the Straw Hats struggle to hold their own against those among Buster Call's fighting elite who have Devil Fruit powers, an unmasked Usopp sees Luffy collapsed on the ground in front of Lucci. Usopp cries out to him, telling him to get back up. But when Luffy is unable to move, Usopp resorts to provoking Lucci to face him. Presuming Luffy to be defeated, Lucci decides to take Usopp's suggestion with the intention of slaughtering the entire Straw Hat crew before returning to finish Luffy off. But Luffy, spurred by Usopp's words, gets back to his feet with a promise not to fall again until he wins. Luffy then engages Lucci in a final fist fight. Though Lucci hits him with his Six Kings Gun, Luffy manages to stay on his feet to Lucci's disbelief. Mustering all the strength he has left, Luffy delivers a barrage of blows strong enough to break through Lucci's Iron Body technique. Lucci's defeat is soon made public with a grinning Luffy collapsing to the floor.",
    "tf_idf_text": "fist full emotion luffy unleashes gatling mighttransliteration kobushi kometa omoi rufi konshin gtoringu japanese makoto sonoda koga naoki may july straw hat struggle hold among buster call fight elite devil fruit power unmask usopp see luffy collapse ground front lucci usopp cry tell get back luffy unable move usopp resort provoke lucci face presume luffy defeat lucci decides take usopps suggestion intention slaughter entire straw hat crew return finish luffy luffy spur usopps word get back foot promise not fall win luffy engage lucci final fist fight though lucci hit six king gun luffy manages stay foot luccis disbelief muster strength leave luffy delivers barrage blow strong enough break luccis iron body technique luccis defeat soon make public grinning luffy collapse floor"
}