{
    "title": "310 47 \"From the Sea, a Friend Arrives! The Straw Hats Share the Strongest Bond!\"Transliteration: \"Tomo, Umi Yori Kuru! Mugiwara Ichimi Saikyō no Kizuna\" (Japanese:友, 海より来る! 麦わら一味最強の絆) Yoshihiro Ueda Yoshiyuki Suga May 20, 2007(2007-05-20)[57] August 2, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "310 47 \"From the Sea, a Friend Arrives! The Straw Hats Share the Strongest Bond!\"Transliteration: \"Tomo, Umi Yori Kuru! Mugiwara Ichimi Saikyō no Kizuna\" (Japanese:友, 海より来る! 麦わら一味最強の絆) Yoshihiro Ueda Yoshiyuki Suga May 20, 2007(2007-05-20)[57] August 2, 2015\n\nWhile everyone is in awe of Luffy defeating Rob Lucci, it is revealed by Transponder Snail loudspeakers that the Franky Family and Galley-La foremen faked their deaths while having found a means of escape. The Straw Hats are not so fortunate as the Marine admirals' forces renew their attack as their battleships destroy the stolen convoy ship. Sanji reappears to save Chopper, Kokoro, Chimney, and Gonbe. The Buster Call ships then destroy what remained of the Bridge of Hesitation to force the pirates onto the middle pillar before redirecting fire at the pillar where Luffy is to blast him to bits while he is unable to move. Things seem hopeless until Usopp once more hears a voice calling out for him and the rest of the Straw Hats to jump into the ocean. Despite many thinking Usopp had gone mad, the others start to hear it too with Robin using her Devil Fruit powers to toss Luffy out of the pillar as everyone jumps to the source of the mysterious voice: theGoing Merry.",
    "tf_idf_text": "sea friend arrive straw hat share strong bondtransliteration tomo umi yori kuru mugiwara ichimi saiky kizuna japanese yoshihiro ueda yoshiyuki suga may august everyone awe luffy defeat rob lucci reveal transponder snail loudspeaker franky family galleyla foreman fake death find mean escape straw hat not fortunate marine admiral force renew attack battleship destroy steal convoy ship sanji reappears save chopper kokoro chimney gonbe buster call ship destroy remain bridge hesitation force pirate onto middle pillar redirect fire pillar luffy blast bit unable move thing seem hopeless usopp hears voice call rest straw hat jump ocean despite many think usopp go mad others start hear robin use devil fruit power toss luffy pillar everyone jump source mysterious voice thegoing merry"
}