{
    "title": "311 48 \"Everyone Makes a Great Escape! The Road to Victory is for the Pirates!\"Transliteration: \"Zen'in Dai Dasshutsu! Shōsha no Michi wa Kaizoku no Tame ni\" (Japanese:全員大脱出! 勝者の道は海賊のために) Directed by: Hiroyuki SatōStoryboarded by: Eisaku Inoue Koga Naoki May 27, 2007(2007-05-27)[58] August 9, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "311 48 Everyone Makes a Great Escape The Road to Victory is for the Pirates Transliteration Zen ' in Dai Das shuts u Sh sha no M ichi wa Kai z oku no Tame ni Japanese Directed by Hiroyuki S at Story boarded by E is aku Inoue Koga Naoki May 27 2007 2007 05 27 58 August 9 2015 Despite appearing to have sunk at Water 7 the Going Merry somehow made it to Eni es Lobby with the Straw Hats have little time to speculate how their ship arrived as a livid Span dam revealed to have survived being crushed by Funk freed orders the Buster Call battleships to destroy Robin and the Straw Hats Though the battleships have already taken aim at the tiny ship that has snuck in between them at a near point blank range it turned out Sanji had snuck away to the control room for the Gates of Justice and closed it to restore the whirlpools This results in the battleships ' aim and mano eu vr ability being severely hindered The Straw Hats go on the defensive while Nami plans their escape route After Robin uses her Devil Fruit powers to break Span dam's spine as revenge the Straw Hats succeed with their escape with the Buster Call fleet utterly defeated",
    "tf_idf_text": "everyone make great escape road victory pirate transliteration zen dai da shut sha ichi kai oku tame japanese direct hiroyuki story board aku inoue koga naoki may august despite appear sunk water go merry somehow make eni lobby straw hat little time speculate ship arrive livid span dam reveal survive crushed funk free order buster call battleship destroy robin straw hat though battleship already take aim tiny ship snuck near point blank range turn sanji snuck away control room gate justice close restore whirlpool result battleship aim mano ability severely hinder straw hat defensive nami plan escape route robin use devil fruit power break span dam spine revenge straw hat succeed escape buster call fleet utterly defeat"
}