{
    "title": "311 48 \"Everyone Makes a Great Escape! The Road to Victory is for the Pirates!\"Transliteration: \"Zen'in Dai Dasshutsu! Shōsha no Michi wa Kaizoku no Tame ni\" (Japanese:全員大脱出! 勝者の道は海賊のために) Directed by: Hiroyuki SatōStoryboarded by: Eisaku Inoue Koga Naoki May 27, 2007(2007-05-27)[58] August 9, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "311 48 \"Everyone Makes a Great Escape! The Road to Victory is for the Pirates!\"Transliteration: \"Zen'in Dai Dasshutsu! Shōsha no Michi wa Kaizoku no Tame ni\" (Japanese:全員大脱出! 勝者の道は海賊のために) Directed by: Hiroyuki SatōStoryboarded by: Eisaku Inoue Koga Naoki May 27, 2007(2007-05-27)[58] August 9, 2015\n\nDespite appearing to have sunk at Water 7, theGoing Merrysomehow made it to Enies Lobby with the Straw Hats have little time to speculate how their ship arrived as a livid Spandam, revealed to have survived being crushed by Funkfreed, orders the Buster Call battleships to destroy Robin and the Straw Hats. Though the battleships have already taken aim at the tiny ship that has snuck in between them at a near point-blank range, it turned out Sanji had snuck away to the control room for the Gates of Justice and closed it to restore the whirlpools. This results in the battleships' aim and manoeuvrability being severely hindered. The Straw Hats go on the defensive while Nami plans their escape route. After Robin uses her Devil Fruit powers to break Spandam's spine as revenge, the Straw Hats succeed with their escape with the Buster Call fleet utterly defeated.",
    "tf_idf_text": "everyone make great escape road victory piratestransliteration zenin dai dasshutsu shsha michi kaizoku tame japanese direct hiroyuki satstoryboarded eisaku inoue koga naoki may august despite appear sunk water thegoing merrysomehow make enies lobby straw hat little time speculate ship arrive livid spandam reveal survive crushed funkfreed order buster call battleship destroy robin straw hat though battleship already take aim tiny ship snuck near pointblank range turn sanji snuck away control room gate justice close restore whirlpool result battleship aim manoeuvrability severely hinder straw hat defensive nami plan escape route robin use devil fruit power break spandams spine revenge straw hat succeed escape buster call fleet utterly defeat"
}