{
    "title": "313 50 \"Peace Interrupted! A Navy Vice Admiral with a Fist of Love!\"Transliteration: \"Yaburareta Ansoku! Ai no Kobushi o Motsu Kaigun Chūjō\" (Japanese:破られた安息! 愛の拳を持つ海軍中将) Hiroaki Miyamoto Koga Naoki June 10, 2007(2007-06-10)[60] August 23, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "313 50 \"Peace Interrupted! A Navy Vice Admiral with a Fist of Love!\"Transliteration: \"Yaburareta Ansoku! Ai no Kobushi o Motsu Kaigun Chūjō\" (Japanese:破られた安息! 愛の拳を持つ海軍中将) Hiroaki Miyamoto Koga Naoki June 10, 2007(2007-06-10)[60] August 23, 2015\n\nTwo days later, after returning to Water 7, Franky learns of Iceberg's plan to turn the city into a ship in response to Aqua Laguna's increasing intensity before learning that \"the item\" he ordered has arrived. At the temporary housing that Gallery-La arranged for the Straw Hats, Zoro is out while Kokoro, Chimney, and Gonbe come to a visit to see Luffy sleep-eating while Nami is in a slump. But Nami's outlook changes for the better when her tangerine trees and the Straw Hats' other possessions are returned to them. Franky then arrives and explains to the Straw Hats that he used the money he stole from them to buy a highly valuable piece of bark from the indestructible \"Treasure Tree Adam\". Franky continues to explain that he bought the fragment of Adam to create a \"dream ship\" and decided to give his creation to the Straw Hats for their use. The joyful moment is short lived when a marine platoon underVice-Admiral Garparrives at Water 7. Everyone is in shock as Garp breaks into the Straw Hats' quarters and manages to hurt Luffy when he wakes him up with a punch to the head. Luffy then further shocks everyone when he calls Garp his grandfather.",
    "tf_idf_text": "peace interrupt navy vice admiral fist lovetransliteration yaburareta ansoku kobushi motsu kaigun chj japanese hiroaki miyamoto koga naoki june august two day later return water franky learn icebergs plan turn city ship response aqua laguna increase intensity learn item order arrived temporary housing galleryla arrange straw hat zoro kokoro chimney gonbe come visit see luffy sleepeating nami slump namis outlook change good tangerine tree straw hat possession return franky arrives explain straw hat use money stole buy highly valuable piece bark indestructible treasure tree adam franky continue explain bought fragment adam create dream ship decide give creation straw hat use joyful moment short live marine platoon underviceadmiral garparrives water everyone shock garp break straw hat quarter manages hurt luffy wake punch head luffy shock everyone call garp grandfather"
}