{
    "title": "314 51 \"The Strongest Family? Luffy's Father Revealed!\"Transliteration: \"Saikyō no Kakei? Akasareta Rufi no Chichi!\" (Japanese:最強の家系? 明かされたルフィの父!) Hiroyuki Kakudō Yoshiyuki Suga June 17, 2007(2007-06-17)[61] August 30, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "314 51 \"The Strongest Family? Luffy's Father Revealed!\"Transliteration: \"Saikyō no Kakei? Akasareta Rufi no Chichi!\" (Japanese:最強の家系? 明かされたルフィの父!) Hiroyuki Kakudō Yoshiyuki Suga June 17, 2007(2007-06-17)[61] August 30, 2015\n\nGarp is revealed to be Luffy's grandfather. His harsh upbringing methods explains Luffy's endurance. While Garp criticizes his grandson's choice to become a pirate, Zoro attempts to attack the navy soldiers until he and Luffy end up facing Garp's two personal attendants who are revealed to be old acquaintances they have met at the start of their journey: Koby who has achieved his dream and former captain Morgan's son Helmeppo. While he and his soldiers proceed to repair the wall he destroyed, Garp shocks everyone even more by revealing that Luffy's father isMonkey D. Dragon. Who save Luffy fromSmokerin Lougetown, Although Luffy does not know of him and everyone else is too dumbfounded by this mind-blowing revelation that Dragon had a son, Garp asks everyone to forget what he said. Robin explains to Luffy that Dragon is the leader of the Revolutionary Army, usurping the World Government and is among the government's most wanted criminals.",
    "tf_idf_text": "strong family luffys father revealedtransliteration saiky kakei akasareta rufi chichi japanese hiroyuki kakud yoshiyuki suga june august garp reveal luffys grandfather harsh upbringing method explain luffys endurance garp criticizes grandson choice become pirate zoro attempt attack navy soldier luffy end face garps two personal attendant reveal old acquaintance meet start journey koby achieve dream former captain morgan son helmeppo soldier proceed repair wall destroy garp shock everyone even reveal luffys father ismonkey dragon save luffy fromsmokerin lougetown although luffy not know everyone else dumbfound mindblowing revelation dragon son garp ask everyone forget say robin explains luffy dragon leader revolutionary army usurping world government among government want criminal"
}