{
    "title": "314 51 \"The Strongest Family? Luffy's Father Revealed!\"Transliteration: \"Saikyō no Kakei? Akasareta Rufi no Chichi!\" (Japanese:最強の家系? 明かされたルフィの父!) Hiroyuki Kakudō Yoshiyuki Suga June 17, 2007(2007-06-17)[61] August 30, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "314 51 The Strongest Family Luffy's Father Revealed Transliteration Sai ky no Kake i Aka s are ta Ru fi no Chichi Japanese Hiroyuki Kaku d Yoshiyuki Suga June 17 2007 2007 06 17 61 August 30 2015 Gar p is revealed to be Luffy's grandfather His harsh upbringing methods explains Luffy's endurance While Gar p criticizes his grandson's choice to become a pirate Zoro attempts to attack the navy soldiers until he and Luffy end up facing Gar p's two personal attendants who are revealed to be old acquaintances they have met at the start of their journey Ko by who has achieved his dream and former captain Morgan's son Helm ep po While he and his soldiers proceed to repair the wall he destroyed Gar p shocks everyone even more by revealing that Luffy's father is Monkey D Dragon Who save Luffy from Smoker in Lou get own Although Luffy does not know of him and everyone else is too dumbfounded by this mind blowing revelation that Dragon had a son Gar p asks everyone to forget what he said Robin explains to Luffy that Dragon is the leader of the Revolutionary Army usurping the World Government and is among the government's most wanted criminals",
    "tf_idf_text": "strong family luffys father reveal transliteration sai kake aka chichi japanese hiroyuki kaku yoshiyuki suga june august gar reveal luffys grandfather harsh upbringing method explain luffys endurance gar criticize grandson choice become pirate zoro attempt attack navy soldier luffy end face gar two personal attendant reveal old acquaintance meet start journey achieve dream former captain morgan son helm soldier proceed repair wall destroy gar shock everyone even reveal luffys father monkey dragon save luffy smoker lou get although luffy not know everyone else dumbfound mind blow revelation dragon son gar ask everyone forget say robin explains luffy dragon leader revolutionary army usurping world government among government want criminal"
}