{
    "title": "315 52 \"Its Name Is The New World! The Fate of the Grand Line!\"Transliteration: \"Sono Na wa Shin Sekai! Gurando Rain no Yukue\" (Japanese:その名は新世界! 偉大なる航路の行方) Yoko Ikeda Koga Naoki June 24, 2007(2007-06-24)[62] September 13, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "315 52 \"Its Name Is The New World! The Fate of the Grand Line!\"Transliteration: \"Sono Na wa Shin Sekai! Gurando Rain no Yukue\" (Japanese:その名は新世界! 偉大なる航路の行方) Yoko Ikeda Koga Naoki June 24, 2007(2007-06-24)[62] September 13, 2015\n\nAfter fixing the damage he caused, advised by his men to claim that the Straw Hats eluded him for the record, Garp returns to his ship while allowing Koby and Helmeppo to spend time with Luffy. During that time, prior to swimming in the Galley-La pool, Nami learns of the Navy's means to travel safety through Sea-King infested waters and of the Naval scientist, Vegapunk. Afterwards, after he and others encourage him to get strong enough to capture them, Koby takes his leave while telling Luffy that he will meet him again in the New World. Later, as the Straw Hats start a party at the Galley-La's company pool with the Franky Family and the giants invited, Robin is approached by Aokiji who speaks to her through a wall. He explains while he was forced as a naval officer to kill Saul, his best friend, he also let her escape to honor him so she can find a place to belong. While he admitted that he decided to kill Robin when she was unable to find a place she would belong, Aokiji expresses relief that she found her place within the Straw Hats before taking his leave to see what will come from it.",
    "tf_idf_text": "name new world fate grand linetransliteration sono shin sekai gurando rain yukue japanese yoko ikeda koga naoki june september fix damage cause advised men claim straw hat elude record garp return ship allow koby helmeppo spend time luffy time prior swim galleyla pool nami learn navys mean travel safety seaking infested water naval scientist vegapunk afterwards others encourage get strong enough capture koby take leave tell luffy meet new world later straw hat start party galleylas company pool franky family giant invite robin approach aokiji speak wall explains force naval officer kill saul best friend also let escape honor find place belong admit decide kill robin unable find place would belong aokiji express relief find place within straw hat take leave see come"
}