{
    "title": "316 53 \"Shanks Makes a Move! The Linchpin to the Reckless Era!\"Transliteration: \"Shankusu Ugoku! Bōsōsuru Jidai e no Kusabi\" (Japanese:シャンクス動く! 暴走する時代への楔) Takahiro Imamura Hirohiko Kamisaka July 1, 2007(2007-07-01)[63] September 20, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "316 53 \"Shanks Makes a Move! The Linchpin to the Reckless Era!\"Transliteration: \"Shankusu Ugoku! Bōsōsuru Jidai e no Kusabi\" (Japanese:シャンクス動く! 暴走する時代への楔) Takahiro Imamura Hirohiko Kamisaka July 1, 2007(2007-07-01)[63] September 20, 2015\n\nA fleet of navy ships failed to prevent\"Red-Haired\" Shanksfrom meeting with Whitebeard, putting the World Government on high alert over two pirate Emperors crossing paths. After the least experienced crew members under Whitebeard are knocked out by Shanks's Haki, he offers Whitebeard a large bottle of sake as a peace offering. While they drink, they reminisce about old times and wounds with Shanks explaining that he bet his lost arm on the new age. Shanks then explains his reason to see Whitebeard is to make a request for him to stopPortgas D. Acechasing afterBlackbeard. Laughing his request off, Whitebeard explains he intends to make Blackbeard pay for the crew member he killed. Their differences in opinion over the matter causes a clash between them that causes the heavens above to part. Back at Water 7, as the Franky Family are relieved to find no mention of them and the Straw Hats' allies in a report on the events at Enies Lobby, Iceberg and the Galley-La Company arrive to help Franky to build the Straw Hats' new ship. The Straw Hats plan to head out into the city to gather supplies despite Luffy having spent almost all their remaining money on the party.",
    "tf_idf_text": "shank make move linchpin reckless eratransliteration shankusu ugoku bssuru jidai kusabi japanese takahiro imamura hirohiko kamisaka july september fleet navy ship fail preventredhaired shanksfrom meeting whitebeard put world government high alert two pirate emperor cross path least experienced crew member whitebeard knock shankss haki offer whitebeard large bottle sake peace offering drink reminisce old time wound shank explain bet lose arm new age shank explain reason see whitebeard make request stopportgas acechasing afterblackbeard laugh request whitebeard explain intend make blackbeard pay crew member kill difference opinion matter cause clash cause heaven part back water franky family relieve find mention straw hat ally report event enies lobby iceberg galleyla company arrive help franky build straw hat new ship straw hat plan head city gather supply despite luffy spent almost remain money party"
}