{
    "title": "317 54 \"The Girl in Search of Her Yagara! Great Search in the City of Water!\"Transliteration: \"Yagara o Sagasu Shōjo! Mizu no Miyako Daisōsasen!\" (Japanese:ヤガラを探す少女! 水の都大捜査線!) Yoshihiro Ueda Hirohiko Kamisaka July 8, 2007(2007-07-08)[64] September 27, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "317 54 The Girl in Search of Her Ya gara Great Search in the City of Water Transliteration Ya gara o Sagas u Sh jo Miz u no Miya ko Dais s as en Japanese Yoshihiro Ueda Hiro hi ko Kami saka July 8 2007 2007 07 08 64 September 27 2015 While searching for supplies Luffy and Chopper are approached by a girl named Abi to search for her lost ya gara bull Bluefin who had appeared to her in a dream During Aqua Laguna Abi's family had left their 100 year old ya gara bull at home and they find him gone when their came back With the exception of Abi everyone believes that Bluefin is dead Though Robin used her Devil Fruit powers to help them the search all over the city with no success The group come across a ya gara who as Chopper translated heard Bluefin coming to someone's aid during Aqua Laguna After finding a piece of his scarf they track him into the underwater passages of the city But it turned out that Bluefin had died during the storm and reached out to Abi to find peace while she cares for the newborn ya gara he gave his life to save",
    "tf_idf_text": "girl search gara great search city water transliteration gara saga miz miya dais japanese yoshihiro ueda hiro kami saka july september search supply luffy chopper approach girl name abi search lose gara bull bluefin appear dream aqua laguna abis family leave year old gara bull home find go come back exception abi everyone believe bluefin dead though robin use devil fruit power help search city success group come across gara chopper translate heard bluefin come someone aid aqua laguna find piece scarf track underwater passage city turn bluefin died storm reach abi find peace care newborn gara give life save"
}