{
    "title": "318 55 \"Mothers are Strong! Zoro's Hectic Household Chores!\"Transliteration: \"Haha wa Tsuyoshi! Zoro no Dotabata Kaji Tetsudai\" (Japanese:母は強し! ゾロのドタバタ家事手伝い) Directed by: Keisuke ŌnishiStoryboarded by: Naotoshi Shida Koga Naoki July 15, 2007(2007-07-15)[65] October 4, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "318 55 Mothers are Strong Zoro's Hectic Household Chores Transliteration Hah a wa Tsuyoshi Zoro no Do tabata Kaj i Tetsu dai Japanese Directed by Keisuke n is hiStory boarded by Naoto shi S hida Koga Naoki July 15 2007 2007 07 15 65 October 4 2015 As the others look for supplies Zoro strolls the city in search of a replacement katana despite lacking money to afford a new sword There he is picked up by Michael and Hoi cha el two idle boys from the backstreet s he met while Gar p was in Water 7 The two attempt to help him find a sword shop while calling him their big brother to his dismay before meeting their foster mother who takes him to their home to help in the chores Eventually after forced to wear a tight fitting shirt Zoro manages to escape but attempts to hide from his crew out of pride Eventually Zoro is found by Hoi cha el and learns that the foster mother and her children have been abducted by a loan shark he saw attempting to collect interest from a fulfilled debt After Zoro rescues the family the foster mother allows him to return to his family before chasing after him to give him back his shirt",
    "tf_idf_text": "mother strong zoros hectic household chore transliteration hah tsuyoshi zoro tabata kaj tetsu dai japanese directed keisuke history board naoto shi hida koga naoki july october others look supply zoro stroll city search replacement katana despite lack money afford new sword pick michael hoi cha two idle boy backstreet meet gar water two attempt help find sword shop call big brother dismay meeting foster mother take home help chore eventually force wear tight fit shirt zoro manage escape attempt hide crew pride eventually zoro find hoi cha learns foster mother child abduct loan shark saw attempt collect interest fulfil debt zoro rescue family foster mother allow return family chase give back shirt"
}