{
    "title": "319 56 \"Sanji's Shock! Mysterious Old Man and His Super Yummy Cooking!\"Transliteration: \"Sanji Shōgeki! Nazo no Jii-san to Hageuma Ryōri\" (Japanese:サンジ衝撃! 謎の爺さんと激ウマ料理) Makoto Sonoda Yoshiyuki Suga July 22, 2007(2007-07-22)[66] October 11, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "319 56 \"Sanji's Shock! Mysterious Old Man and His Super Yummy Cooking!\"Transliteration: \"Sanji Shōgeki! Nazo no Jii-san to Hageuma Ryōri\" (Japanese:サンジ衝撃! 謎の爺さんと激ウマ料理) Makoto Sonoda Yoshiyuki Suga July 22, 2007(2007-07-22)[66] October 11, 2015\n\nWhile Chimney and Gonbe accompany him to gather groceries, Sanji is forced by the pair to take them to a small floating restaurant owned by a drunken old man for lunch. Sanji notices the man to be deep asleep and decides to prepare something himself. While he is cooking, the old man wakes up and immediately recognizes Sanji's way of handling the carving knife and reveals himself as a friend of Sanji's mentor \"Red-Leg\" Zeff. He insists that Sanji taste some of his cooking. Sanji, though worried by the old man's cooking style is amazed by the flavor. Curious to know the secret of the old man's secret ingredient, Sanji leaves Chimney and Gonbe with the old man as he searches around the city for seasonings that might have been used. When Sanji gets to eat anonigirimade by the old man, he realizes the ingredient is a special salt. The old man reveals that the waters of Aqua Laguna carries salt from the All Blue and litters the rooftops of the lower parts of the city. As Sanji heads back after stocking up on ingredients, he spots Usopp on the beach practicing ways to return to the crew. Chimney and Gonbe meet up with Kokoro as she observes Franky and Iceberg building the Straw Hats' new ship with the Galley-La foremen.",
    "tf_idf_text": "sanjis shock mysterious old man super yummy cookingtransliteration sanji shgeki nazo jiisan hageuma ryri japanese makoto sonoda yoshiyuki suga july october chimney gonbe accompany gather grocery sanji force pair take small float restaurant own drunken old man lunch sanji notice man deep asleep decides prepare something cook old man wake immediately recognizes sanjis way handle carve knife reveals friend sanjis mentor redleg zeff insist sanji taste cooking sanji though worried old man cook style amaze flavor curious know secret old man secret ingredient sanji leave chimney gonbe old man search around city seasoning might use sanji get eat anonigirimade old man realize ingredient special salt old man reveal water aqua laguna carry salt blue litter rooftops low part city sanji head back stock ingredient spots usopp beach practice way return crew chimney gonbe meet kokoro observe franky iceberg building straw hat new ship galleyla foreman"
}