{
    "title": "320 57 \"Everyone Finally Has A Bounty! A Pirate Group Worth Over Six Hundred Million!\"Transliteration: \"Tsui ni Zen'in Shōkinkubi! Rokuoku Koe no Ichimi!\" (Japanese:ついに全員賞金首! 6億超えの一味!) Hiroyuki Kakudō Yoshiyuki Suga August 19, 2007(2007-08-19)[67] October 18, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "320 57 Everyone Finally Has A Bounty A Pirate Group Worth Over Six Hundred Million Transliteration Tsui ni Zen ' in Sh kink ub i Roku oku Ko e no Ichi mi Japanese 6 Hiroyuki Kaku d Yoshiyuki Suga August 19 2007 2007 08 19 67 October 18 2015 While the Galley La foremen Ice burg and Franky take a break after the Franky Family brings everyone a meal Ice burg suggests to Franky that he joins the Straw Hats when they leave with the ship Franky and Ice burg continue working through the night while the foremen pass out unable to keep up Meanwhile Us opp's first attempt to rejoin the Straw Hats fails The next day the Straw Hats find out from Kok oro that their Log Pose is pointing under the sea to Fish man Island and on the way they will have to pass through the Florian Triangle where many ships have disappeared Chimney Gon be Kiwi and Moz u arrive with good news their ship has been completed The Franky Family suddenly show up with the bad news Every Straw Hat as well as Us opp as Sniper King and Franky now have bounties on each of their heads The Franky Family fear their leader might end up getting captured again so they plea with Luffy to take Franky with him by any means",
    "tf_idf_text": "everyone finally bounty pirate group worth six hundred million transliteration tsui zen kink roku oku ichi japanese hiroyuki kaku yoshiyuki suga august october galley foreman ice burg franky take break franky family bring everyone meal ice burg suggest franky join straw hat leave ship franky ice burg continue work night foreman pass unable keep meanwhile opps first attempt rejoin straw hat fail next day straw hat find kok oro log pose point sea fish man island way pas florian triangle many ship disappear chimney gon kiwi moz arrive good news ship complete franky family suddenly show bad news every straw hat well opp sniper king franky bounty head franky family fear leader might end get capture plea luffy take franky mean"
}