{
    "title": "321 58 \"The King of Animals that Overlooks the Sea! The Dream Ship Magnificently Completed!\"Transliteration: \"Umi o Nozomu Hyakujū no Ō! Yume no Fune Dōdō Kansei!\" (Japanese:海を臨む百獣の王! 夢の船堂々完成!) Naoyuki Itō Hirohiko Kamisaka August 26, 2007(2007-08-26)[68] October 25, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "321 58 \"The King of Animals that Overlooks the Sea! The Dream Ship Magnificently Completed!\"Transliteration: \"Umi o Nozomu Hyakujū no Ō! Yume no Fune Dōdō Kansei!\" (Japanese:海を臨む百獣の王! 夢の船堂々完成!) Naoyuki Itō Hirohiko Kamisaka August 26, 2007(2007-08-26)[68] October 25, 2015\n\nWhen the Straw Hats arrive at the coast, Iceburg unveils the ship while Franky is nowhere to be seen. Iceburg gives his opinion that Franky is hiding because if he were asked face to face to join the crew, he would not be able to refuse; he wants to go but believes staying in Water 7 is his responsibility. Iceberg proceeds to tell the Straw Hats that they might have to make him join the crew by force. At the Franky House, when Franky refuses to leave, Franky's men take matters into their own hands: they steal Franky's beloved jammer-style briefs and start luring him to the Straw Hats by playing keep-away with the briefs with Franky in tow. Amid the town, while the populace are horrified by the streaking Franky chasing after them, Luffy and Chopper show up to assist in the keep-away before Sanji and Zoro seize Franky and shove him into the Franky Family's shoot-anything-cannon, and have him shot in front of the new ship. Luffy aboard the ship, has the briefs and offers to return them to Franky only if he agrees to join the crew.",
    "tf_idf_text": "king animal overlook sea dream ship magnificently completedtransliteration umi nozomu hyakuj yume fune kansei japanese naoyuki hirohiko kamisaka august october straw hat arrive coast iceburg unveils ship franky nowhere see iceburg give opinion franky hide ask face face join crew would not able refuse want believe stay water responsibility iceberg proceeds tell straw hat might make join crew force franky house franky refuse leave frankys men take matter hand steal frankys beloved jammerstyle brief start lure straw hat play keepaway briefs franky tow amid town populace horrify streak franky chase luffy chopper show assist keepaway sanji zoro seize franky shove franky family shootanythingcannon shot front new ship luffy aboard ship briefs offer return franky agrees join crew"
}