{
    "title": "322 59 \"Goodbye My Dear Underlings! Franky Departs!\"Transliteration: \"Saraba Itoshiki Kobun-tachi! Furankī Tatsu\" (Japanese:さらば愛しき子分達! フランキー発つ) Yoshihiro Ueda Yoshiyuki Suga September 2, 2007(2007-09-02)[69] November 8, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "322 59 Goodbye My Dear Underlings Franky Departs Transliteration S araba I to shiki Ko bun tachi Fu rank Tatsu Japanese Yoshihiro Ueda Yoshiyuki Suga September 2 2007 2007 09 02 69 November 8 2015 Despite Luffy offer to return his briefs if he agrees to join his crew as the town populace continue to denounce his nudity Franky still refuses to the point of being unashamed of being bottomless Taking Iceberg's advice to heart Robin uses her Devil Fruit powers to grab Franky by the testicles and threatens to crush them if he continues to refuse As Franky tries to brave through the agonising torture Ice burg confronts Franky and explains that the real reason he wants to stay is out of guilt Ice burg tells him that he needs to forgive himself as he and Tom had already forgiven him for his past mistakes Ice burg believe he needs to go with the Straw Hats and see his dream through Franky's men arrive with Franky's luggage thanking Franky for everything and telling him they wanted him to go and be happy Franky starts crying while pretending to still be in pain Robin revealing she had stopped after the first time Sanji and Zoro suddenly arrive in a hurry revealing that Gar p has returned and is on his way to capture them Luffy returns the briefs to Franky who regains his usual gusto and subsequently agrees to join the crew",
    "tf_idf_text": "goodbye dear underling franky departs transliteration araba shiki bun tachi rank tatsu japanese yoshihiro ueda yoshiyuki suga september november despite luffy offer return brief agree join crew town populace continue denounce nudity franky still refuse point unashamed bottomless take icebergs advice heart robin use devil fruit power grab franky testicle threaten crush continue refuse franky try brave agonise torture ice burg confronts franky explains real reason want stay guilt ice burg tell need forgive tom already forgiven past mistake ice burg believe need straw hat see dream frankys men arrive frankys luggage thank franky everything tell want happy franky start cry pretend still pain robin revealing stop first time sanji zoro suddenly arrive hurry reveal gar return way capture luffy return brief franky regains usual gusto subsequently agree join crew"
}