{
    "title": "323 60 \"Departing the City of Water! Usopp Mans Up and Brings Closure to the Duel!\"Transliteration: \"Shukkō Mizu no Miyako! Otoko Usoppu Kettō no Kejime\" (Japanese:出港水の都! 男ウソップ決闘のケジメ) Katsumi Tokoro Yoshiyuki Suga September 9, 2007(2007-09-09)[70] November 15, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "323 60 \"Departing the City of Water! Usopp Mans Up and Brings Closure to the Duel!\"Transliteration: \"Shukkō Mizu no Miyako! Otoko Usoppu Kettō no Kejime\" (Japanese:出港水の都! 男ウソップ決闘のケジメ) Katsumi Tokoro Yoshiyuki Suga September 9, 2007(2007-09-09)[70] November 15, 2015\n\nWith Franky now a member of the Straw Hats, the crew sets sail to evade Garp as he returned to Water 7 with direct orders from Fleet-Admiral Sengoku. When Franky notices that Usopp has not yet returned to them, Luffy explains to Franky that Sanji saw Usopp practicing ways to return to the group a few days prior. Luffy is then convinced by Zoro, who threatens to leave the crew, that the only way they can welcome back Usopp is if his first words are an apology. Unfortunately as Usopp runs to the dock, his window of opportunity is closing quickly as the Straw Hats attempt to fend off the onslaught of cannonballs thrown by Garp. When Usopp arrives, he attempts to rejoin the crew as if nothing happened with his words falling on deaf ears. It is only after Usopp realizes his faults and begs for forgiveness in sadness that a tearful Luffy reaches out and pulls him aboard.",
    "tf_idf_text": "depart city water usopp man bring closure dueltransliteration shukk mizu miyako otoko usoppu kett kejime japanese katsumi tokoro yoshiyuki suga september november franky member straw hat crew set sail evade garp return water direct order fleetadmiral sengoku franky notice usopp not yet return luffy explain franky sanji saw usopp practice way return group day prior luffy convince zoro threatens leave crew way welcome back usopp first word apology unfortunately usopp run dock window opportunity closing quickly straw hat attempt fend onslaught cannonball thrown garp usopp arrives attempt rejoin crew nothing happen word fall deaf ear usopp realizes fault begs forgiveness sadness tearful luffy reach pull aboard"
}