{
    "title": "323 60 \"Departing the City of Water! Usopp Mans Up and Brings Closure to the Duel!\"Transliteration: \"Shukkō Mizu no Miyako! Otoko Usoppu Kettō no Kejime\" (Japanese:出港水の都! 男ウソップ決闘のケジメ) Katsumi Tokoro Yoshiyuki Suga September 9, 2007(2007-09-09)[70] November 15, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "323 60 Departing the City of Water Us opp Mans Up and Brings Closure to the Duel Transliteration Shu kk Miz u no Miya ko O toko Us opp u Kett no Ke jim e Japanese Katsumi To koro Yoshiyuki Suga September 9 2007 2007 09 09 70 November 15 2015 With Franky now a member of the Straw Hats the crew sets sail to evade Gar p as he returned to Water 7 with direct orders from Fleet Admiral Sengoku When Franky notices that Us opp has not yet returned to them Luffy explains to Franky that Sanji saw Us opp practicing ways to return to the group a few days prior Luffy is then convinced by Zoro who threatens to leave the crew that the only way they can welcome back Us opp is if his first words are an apology Unfortunately as Us opp runs to the dock his window of opportunity is closing quickly as the Straw Hats attempt to fend off the onslaught of cannonballs thrown by Gar p When Us opp arrives he attempts to rejoin the crew as if nothing happened with his words falling on deaf ears It is only after Us opp realizes his faults and begs for forgiveness in sadness that a tearful Luffy reaches out and pulls him aboard",
    "tf_idf_text": "depart city water opp man brings closure duel transliteration shu miz miya toko opp kett jim japanese katsumi koro yoshiyuki suga september november franky member straw hat crew set sail evade gar return water direct order fleet admiral sengoku franky notice opp not yet return luffy explain franky sanji saw opp practice way return group day prior luffy convince zoro threatens leave crew way welcome back opp first word apology unfortunately opp run dock window opportunity closing quickly straw hat attempt fend onslaught cannonball thrown gar opp arrive attempt rejoin crew nothing happen word fall deaf ear opp realize fault begs forgiveness sadness tearful luffy reach pull aboard"
}