{
    "title": "324 61 \"Wanted Posters Make It Around the World! Celebrations in Their Hometowns as the Ship Moves Forward!\" Transliteration: \" Meguru Tehaisho! Kokyō wa Odoru Fune wa Susumu! \" ( Japanese : めぐる手配書! 故郷は踊る 船は進む! ) Tetsuya Endō Koga Naoki September 16, 2007 ( 2007-09-16 ) [ 71 ] November 22, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "324 61 \"Wanted Posters Make It Around the World! Celebrations in Their Hometowns as the Ship Moves Forward!\" Transliteration: \" Meguru Tehaisho! Kokyō wa Odoru Fune wa Susumu! \" ( Japanese : めぐる手配書! 故郷は踊る 船は進む! ) Tetsuya Endō Koga Naoki September 16, 2007 ( 2007-09-16 ) [ 71 ] November 22, 2015 With the crew back together, the Straw Hats focus their efforts on escaping while agreeing to use the name that Iceberg suggested: the Thousand Sunny . Franky goes to the engine room to activate one of its special abilities while Luffy says goodbyes to his grandfather, Koby, and everyone on Water 7. Nervious and enraged by his grandson's audacity, Garp takes out his gigantic iron ball and chain to sink the Straw Hats. Luckily, the Sunny's emergency acceleration device activates and blasts the ship a kilometer away beyond Garp's reach. Some time later, life resumes on Water 7 as Kokoro returns to her station while Iceberg offers the Franky Family a job at Galley-La. Meanwhile, as the crew celebrate while preparing to head towards Fishman Island, their wanted posters circulate around the world. Everyone in their hometowns, Baratie, Alabasta, and Smoker have heard about the crew's deeds at Enies Lobby. The posters even reach the Revolutionary Army with their leader Dragon impressed and confident he and Luffy will cross paths in the future as father and son.",
    "tf_idf_text": "wanted poster make around world celebration hometowns ship move forward transliteration meguru tehaisho koky odoru fune susumu japanese tetsuya end koga naoki september november crew back together straw hat focus effort escape agree use name iceberg suggest thousand sunny franky go engine room activate one special ability luffy say goodbyes grandfather koby everyone water nervious enrage grandson audacity garp take gigantic iron ball chain sink straw hat luckily sunnys emergency acceleration device activate blast ship kilometer away beyond garps reach time late life resume water kokoro return station iceberg offer franky family job galleyla meanwhile crew celebrate prepare head towards fishman island want poster circulate around world everyone hometowns baratie alabasta smoker hear crew deed enies lobby poster even reach revolutionary army leader dragon impress confident luffy cross path future father son"
}