{
    "title": "325 62 \"The Most Heinous Power! Blackbeard's Darkness Attacks Ace!\"Transliteration: \"Saikyō no Nōryoku! Ēsu o Osou Kurohige no Yami\" (Japanese:最凶の能力! エースを襲う黒ひげの闇) Yoko Ikeda Hirohiko Kamisaka September 23, 2007(2007-09-23)[72] December 6, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "325 62 The Most Heinous Power Blackbeard's Darkness Attacks Ace Transliteration Sai ky no N ryo ku su o Oso u Kuro hig e no Yami Japanese Yoko Ikeda Hiro hi ko Kami saka September 23 2007 2007 09 23 72 December 6 2015 Three days before the Thousand Sunny's maiden voyage on Ban aro Island an island near Water 7 Blackbeard receives the news of the Straw Hats ' devastation of Eni es Lobby and decides to pursue them However his plans are interrupted by Ace who has come to avenge a crew mate that was murdered by Blackbeard Ordering his men back after failing to convince Ace to join his crew Blackbeard justifies his actions because his crew mate was in possession of a Devil Fruit he long sought after Blackbeard then reveals the power of the Dark Dark Fruit by destroying the entire town Blackbeard then overwhelms Ace making him another offer to join his crew Ace still refuses and the two unleash their strongest attacks on each other The fight between these two pirates will later be known as the trigger for a massive incident that happens in the future",
    "tf_idf_text": "heinous power blackbeard darkness attack ace transliteration sai ryo oso kuro hig yami japanese yoko ikeda hiro kami saka september december three day thousand sunnys maiden voyage ban aro island island near water blackbeard receive news straw hat devastation eni lobby decides pursue however plan interrupted ace come avenge crew mate murder blackbeard order men back fail convince ace join crew blackbeard justifies action crew mate possession devil fruit long seek blackbeard reveals power dark dark fruit destroy entire town blackbeard overwhelms ace make another offer join crew ace still refuse two unleash strong attack fight two pirate later know trigger massive incident happen future"
}