{
    "title": "326 63 \"The Mysterious Band of Pirates! Sunny and the Dangerous Trap!\"Transliteration: \"Nazo no Kaizoku Go Ichigyō! Sanī-gō to Kikken na Wana\" (Japanese:謎の海賊ご一行!サニー号と危険な罠) Munehisa Sakai Hirohiko Kamisaka October 14, 2007(2007-10-14)[73] December 13, 2015",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "326 63 \"The Mysterious Band of Pirates! Sunny and the Dangerous Trap!\"Transliteration: \"Nazo no Kaizoku Go Ichigyō! Sanī-gō to Kikken na Wana\" (Japanese:謎の海賊ご一行!サニー号と危険な罠) Munehisa Sakai Hirohiko Kamisaka October 14, 2007(2007-10-14)[73] December 13, 2015\n\nAfter departing Water 7, the Straw Hat crew are all enjoying the features their brand new ship has to offer. Nami takes a bath, Chopper in his office and Luffy catches a shark while Usopp encourages him to put it in their aquarium. They hurry down to see it along with the rest of the fishes only to find the Shark had eaten the other fish already which Sanji yells at them for. Meanwhile, Franky tells them about the ship's greatest feature: the \"Soldier Dock System\". The bottom of the Ship is equipped with 5 Docking Stations, numbered 0-4 where each one has something unique so no matter what trouble they are in, they have a solution. As it begins to snow, the Straw Hats find a ship drifting with hungry and sick fishermen. Luffy lets them onboard the Sunny and Chopper heals them one by one before Sanji feeds everyone. Eventually, the cabin boy Jiro touches his own left arm and remembers something that makes him beg for Chopper's help with someone onboard their own ship. Chopper follows him to a hidden room where a man with serious wounds is lying in bed, who cannot be moved in his condition. Chopper says he must be operated on right there and then. After the fisherman surprise everyone with a barrel of wine and Luffy offers to tow them back home, everyone is suddenly asleep around the ship. As the fishermen debate whether to go through with their original plans for the crew and ship, Sanji, Robin, and Franky surprise them having not fallen for the drugged wine while Zoro stays indoors.",
    "tf_idf_text": "mysterious band pirate sunny dangerous traptransliteration nazo kaizoku ichigy sing kikken wana japanese munehisa sakai hirohiko kamisaka october december departing water straw hat crew enjoy feature brand new ship offer nami take bath chopper office luffy catch shark usopp encourages put aquarium hurry see along rest fish find shark eaten fish already sanji yell meanwhile franky tell ship great feature soldier dock system bottom ship equip dock station number one something unique matter trouble solution begin snow straw hat find ship drift hungry sick fisherman luffy let onboard sunny chopper heals one one sanji feed everyone eventually cabin boy jiro touch leave arm remembers something make beg chopper help someone onboard ship chopper follow hidden room man serious wound lie bed cannot move condition chopper say must operate right fisherman surprise everyone barrel wine luffy offer tow back home everyone suddenly asleep around ship fisherman debate whether original plan crew ship sanji robin franky surprise not fall drug wine zoro stay indoors"
}