{
    "title": "327 64 \"Sunny in a Pinch! Roar, Secret Superspeed Mecha!\"Transliteration: \"Sanī-gō Pinchi! Unare Chōsoku no Himitsu Meka\" (Japanese:サニー号ピンチ!唸れ超速の秘密メカ) Hiroaki Miyamoto Yoshiyuki Suga October 21, 2007(2007-10-21)[74] January 3, 2016",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "327 64 \"Sunny in a Pinch! Roar, Secret Superspeed Mecha!\"Transliteration: \"Sanī-gō Pinchi! Unare Chōsoku no Himitsu Meka\" (Japanese:サニー号ピンチ!唸れ超速の秘密メカ) Hiroaki Miyamoto Yoshiyuki Suga October 21, 2007(2007-10-21)[74] January 3, 2016\n\nThough the fishermen attempt to retreat, the Straw Hats refuse to let them escape after they assume that they have kidnapped Chopper. The Straw Hats suddenly find themselves surrounded by a fleet of Marine ships, unaware that they are optical illusions and use the Soldier Dock System to escape with the fisherman in tow into a glacial field. Once clear they board the fisherman's ship looking for Chopper. Chopper assures everyone that he was fine and was tending to a patient Jiro took him to. Jiro explains that the fishermen are actually the Phoenix Pirates, the patient is their Captain, Puzzle and that their ship ended up in its current state after an encounter in the New World. Later after hearing that the Straw Hats have entered the glacial field as planned, the Accino family begin to move forward with their plans to collect the bounty on the Straw Hats in honor of their leader Don Accino for his birthday.",
    "tf_idf_text": "sunny pinch roar secret superspeed mechatransliteration sing pinchi unare chsoku himitsu meka japanese hiroaki miyamoto yoshiyuki suga october january though fisherman attempt retreat straw hat refuse let escape assume kidnap chopper straw hat suddenly find surrounded fleet marine ship unaware optical illusion use soldier dock system escape fisherman tow glacial field clear board fishermans ship look chopper chopper assure everyone fine tend patient jiro take jiro explains fishermen actually phoenix pirate patient captain puzzle ship end current state encounter new world later hear straw hat enter glacial field plan accino family begin move forward plan collect bounty straw hat honor leader accino birthday"
}