{
    "title": "328 65 \"The Dream Sinking in the New World! The Disillusioned Pirate, Puzzle!\"Transliteration: \"Shinsekai ni Shizumu Yume! Shitsui no Kaizoku Pazūru\" (Japanese:新世界に沈む夢!失意の海賊パズール) Takahiro Imamura Koga Naoki October 28, 2007(2007-10-28)[75] January 10, 2016",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_9",
    "transformers_text": "328 65 \"The Dream Sinking in the New World! The Disillusioned Pirate, Puzzle!\"Transliteration: \"Shinsekai ni Shizumu Yume! Shitsui no Kaizoku Pazūru\" (Japanese:新世界に沈む夢!失意の海賊パズール) Takahiro Imamura Koga Naoki October 28, 2007(2007-10-28)[75] January 10, 2016\n\nTrapped by moving icebergs, the Straw Hats try to figure a way out while avoiding being crushed. Puzzle awakes after Chopper's treatment only to reveal some harsh realities on the awaiting crew as he considers his dream to become king of the pirates over. Later, Zoro ends up lost as he cuts an iceberg blocking their way. An iceberg attack strands Luffy and Chopper on the Phoenix Pirates' ship while the Thousand Sunny is trapped by ice as it is found by Arbell, Salchow, Hockera, and Lil of the Accino family. Though they expected an easy catch, the Accino family members are shocked to see the Thousand Sunny using its Coup de Burst to escape. But Arbell convinces Lil to use her flying fish to snatch the Straw Hats' jolly roger to keep them from fully escaping out of pride.",
    "tf_idf_text": "dream sink new world disillusion pirate puzzletransliteration shinsekai shizumu yume shitsui kaizoku pazru japanese takahiro imamura koga naoki october january trap move icebergs straw hat try figure way avoid crush puzzle awake chopper treatment reveal harsh reality await crew considers dream become king pirate later zoro end lose cut iceberg block way iceberg attack strand luffy chopper phoenix pirate ship thousand sunny trap ice find arbell salchow hockera lil accino family though expect easy catch accino family member shock see thousand sunny use coup burst escape arbell convinces lil use fly fish snatch straw hat jolly roger keep fully escape pride"
}