{
    "title": "338 2 \"The Joy of Seeing People! The Gentleman Skeleton’s True Identity!\"Transliteration: \"Hito ni Aeta Yorokobi! Gaikotsu Shinshi no Shōtai\" (Japanese:人に逢えた喜び! ガイコツ紳士の正体) Directed by: Hiroyuki SatōStoryboarded by: Naotoshi Shida Tsuyoshi Sakurai January 13, 2008(2008-01-13)[4] March 20, 2016",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_10",
    "transformers_text": "338 2 The Joy of Seeing People The Gentleman Skeleton s True Identity Transliteration Hito ni A eta Yo rok obi G aiko tsu Shin shi no Sh tai Japanese Directed by Hiroyuki S at Story boarded by Naoto shi S hida Tsuyoshi Sakurai January 13 2008 2008 01 13 4 March 20 2016 On board the Thousand Sunny with everyone save Luffy unnerved by his appearance as an undead creature Brook reveals that he is actually a human with Devil Fruit powers Brook explains that he was a pirate musician before being killed alongside his shipmates when they were attacked Though the Revive Revive fruit he ate prior brought him back to life it took his disembodied soul a year to find his body which has decayed within that period of time When everyone notices Brook's lack of a reflection the skeleton reveals that his shadow stolen and cannot enter sunlight without being destroyed For that reason admitting his joy to be around others after a very long time of solitude Brook turns down Luffy's offer to both join his crew and offers to play for the Straw Hats while he is able to enjoy their company But a ghost suddenly appears in the galley and the Straw Hats find out from a frightened Brook that the barrel they found prior was a trap as they find themselves targeted and on the ghost isle Thriller Bark",
    "tf_idf_text": "joy see people gentleman skeleton true identity transliteration hito eta rok obi aiko tsu shin shi tai japanese direct hiroyuki story board naoto shi hida tsuyoshi sakurai january march board thousand sunny everyone save luffy unnerve appearance undead creature brook reveals actually human devil fruit power brook explain pirate musician kill alongside shipmates attacked though revive revive fruit ate prior bring back life take disembodied soul year find body decay within period time everyone notice brook lack reflection skeleton reveals shadow steal cannot enter sunlight without destroyed reason admit joy around others long time solitude brook turn luffys offer join crew offer play straw hat able enjoy company ghost suddenly appear galley straw hat find frightened brook barrel find prior trap find targeted ghost isle thriller bark"
}