{
    "title": "341 5 \"Nami’s in a Major Pinch! The Zombie Mansion and the Invisible Man!\"Transliteration: \"Nami Daipinchi! Zonbi Yashiki to Tōmei Ningen\" (Japanese:ナミ大ピンチ! ゾンビ屋敷と透明人間) Tetsuya Endō Isao Murayama February 3, 2008(2008-02-03)[7] April 10, 2016",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_10",
    "transformers_text": "341 5 Nami s in a Major Pinch The Zombie Mansion and the Invisible Man Transliteration Nami Dai pinch i Zon bi Ya shiki to T mei Ning en Japanese Tetsuya End Isao Mura yama February 3 2008 2008 02 03 7 April 10 2016 After the meeting with Hog back who frightens Chopper by insisting that no one is allowed in his laboratory Nami takes a shower with Us opp and Chopper outside while musing her thoughts on their situation But Nami finds herself restrained by an invisible man in the shower the figure fleeing when Us opp and Chopper manage to drive him off The invisible man meets with Hog back and the ghost referred as Peron a to discuss what to do with the Straw Hats As the rest of the crew set foot on Thriller Bark Luffy taming the cerberus as the group encounter more zombie creatures Nami Us opp and Chopper attempt to leave the manor But the trio instead find themselves surrounded by the Surprise Zombies zombies that strike from paintings taxi der mie d heads and even floor rugs",
    "tf_idf_text": "nami major pinch zombie mansion invisible man transliteration nami dai pinch zon shiki mei ning japanese tetsuya end isao mura yama february april meeting hog back frighten chopper insist one allow laboratory nami take shower opp chopper outside muse thought situation nami find restrained invisible man shower figure flee opp chopper manage drive invisible man meet hog back ghost refer peron discus straw hat rest crew set foot thriller bark luffy tame cerberus group encounter zombie creature nami opp chopper attempt leave manor trio instead find surrounded surprise zombie zombies strike painting taxi der mie head even floor rug"
}