{
    "title": "343 7 \"His Name is Moria! The Great Shadow-Seizing Pirate's Trap!\"Transliteration: \"Sono Na wa Moria! Kage o Nigiru Daikaizoku no Wana\" (Japanese:その名はモリア! 影を握る大海賊の罠) Yoshihiro Ueda Koga Naoki February 17, 2008(2008-02-17)[9] April 24, 2016",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_10",
    "transformers_text": "343 7 His Name is Moria The Great Shadow Seizing Pirate's Trap Transliteration So no Na wa Moria K age o Nig iru D aik aiz oku no Wana Japanese Yoshihiro Ueda Koga Naoki February 17 2008 2008 02 17 9 April 24 2016 After beating the zombies planting them into the ground upon learning they ambushed Nami Us opp and Chopper Luffy's group encounter an old man who pleas for their help in regaining his stolen shadow The old man reveals his shadow and those of his fellow castaways was stolen by Gecko Moria whom Robin explained to be one of the Seven Warlords of the Sea Luffy agrees to help as he and his group reach the manor learning that Thriller Bark is actually a giant pirate ship Inside the manor though furious to find Nami Us opp and Chopper in his lab after they were knocked in by the General Zombie R yuma Hog back sees no point in being upset as it is almost midnight As midnight draws near Ab salom rallies the zombies together while the negativity inducing ghosts converge into their master a Gothic Lolita style Ghost Princess named Peron a Gecko Moria a massive giant like man is awoken and informed of the Straw Hats ' arrival before declaring the start of the Night Hunt",
    "tf_idf_text": "name moria great shadow seize pirate trap transliteration moria age nig iru aik aiz oku wana japanese yoshihiro ueda koga naoki february april beat zombie plant ground upon learn ambush nami opp chopper luffys group encounter old man pleas help regain steal shadow old man reveal shadow fellow castaway steal gecko moria robin explain one seven warlord sea luffy agree help group reach manor learn thriller bark actually giant pirate ship inside manor though furious find nami opp chopper lab knock general zombie yuma hog back see point upset almost midnight midnight draw near salom rally zombies together negativity induce ghost converge master gothic lolita style ghost princess name peron gecko moria massive giant like man awoken informed straw hat arrival declare start night hunt"
}