{
    "title": "348 12 \"Appearing from the Sky! That Man Is the Humming Swordsman!\"Transliteration: \"Sora kara Sanjō! Kenkyō Hanauta wa Ano Otoko!\" (Japanese:空から参上! 剣狭ハナウタはあの男!) Directed by: Hiroyuki SatōStoryboarded by: Munehisa Sakai Isao Murayama March 23, 2008(2008-03-23)[14] June 5, 2016",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_10",
    "transformers_text": "348 12 Appearing from the Sky That Man Is the Humming Swordsman Transliteration Sora kara Sanj K enky Hanau ta wa A no O toko Japanese Directed by Hiroyuki S at Story boarded by M une his a Sakai Isao Mura yama March 23 2008 2008 03 23 14 June 5 2016 When Us opp and Chopper are unable to halt Lola Nami manages to quell the warthog's blood lust by claiming to be a male cross dresser while encouraging her to take more violent steps in getting Ab salom's affections But when Ab salom manages to evade Lola Nami Us opp and Chopper hide inside Peron a's servant Ku macy who is unable to reveal the pirates ' location as they overhear Ab salom and Peron a talking about being summoned by Moria as he obtained an ideal shadow for his ultimate Special Zombie Luffy Meanwhile after their enemy used his webs to reach them Franky gets the upper hand against Tar alan until Robin is immobilized by the Spider Mice the ones behind the abductions of Sanji and Zoro Luckily Brook jumped up to help the two pirates promising to tell them the full story while easily defeating Tar alan",
    "tf_idf_text": "appear sky man hum swordsman transliteration sora kara sanj enky hanau toko japanese direct hiroyuki story board une sakai isao mura yama march june opp chopper unable halt lola nami manages quell warthog blood lust claim male cross dresser encourage take violent step get saloms affection salom manages evade lola nami opp chopper hide inside peron servant macy unable reveal pirate location overhear salom peron talk summon moria obtain ideal shadow ultimate special zombie luffy meanwhile enemy use webs reach franky get upper hand tar alan robin immobilize spider mouse one behind abduction sanji zoro luckily brook jump help two pirate promise tell full story easily defeat tar alan"
}