{
    "title": "381 45 \"A New Crewmate! The Musician, Humming Brook!\"Transliteration: \"Aratana Nakama! Ongakuka – Hanauta no Burukku\" (Japanese:新たな仲間! 音楽家·鼻唄のブルック) Directed by: Yutaka NakashimaStoryboarded by: Tetsuya Endō Koga Naoki December 14, 2008(2008-12-14)[48][49] February 26, 2017",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_10",
    "transformers_text": "381 45 A New Crew mate The Musician Humming Brook Transliteration Arat an a Na kama On gaku ka Hanau ta no B uruk ku Japanese Directed by Yutaka Na kashima Story boarded by Tetsuya End Koga Naoki December 14 2008 2008 12 14 48 49 February 26 2017 Brook tells Luffy that he is glad to be alive and asks if he can join the crew which Luffy approves of All the Straw Hats are shocked and Nami gets horrified by this except for Zoro who is sleeping and Robin who laughs knowing Luffy would accept him no matter what They all nevertheless welcome him to the crew Two days later Us opp and Franky make a grave for the dead Rumba r Pirates and Zoro lays the broken Yu bashir i at the grave Nami gets a Viv re Card from Lola which points the way to Lola's mother a pirate in the New World Luffy takes out the piece of paper he received from Ace which is also a Viv re Card and learns that as it is burning and shrinking Ace's life is in danger Believing that Ace can get out of trouble on his own Luffy decides to head onward rather than go to rescue him and the Straw Hats sail away from Thriller Bark As Luffy and his crew sail away three enormous and mysterious figures appear in the fog looking over Thriller Bark",
    "tf_idf_text": "new crew mate musician hum brook transliteration arat kama gaku hanau uruk japanese direct yutaka kashima story board tetsuya end koga naoki december february brook tell luffy glad alive asks join crew luffy approves straw hat shock nami get horrify except zoro sleep robin laugh know luffy would accept matter nevertheless welcome crew two day later opp franky make grave dead rumba pirate zoro lay break bashir grave nami get viv card lola point way lolas mother pirate new world luffy take piece paper receive ace also viv card learns burn shrink ace life danger believe ace get trouble luffy decide head onward rather rescue straw hat sail away thriller bark luffy crew sail away three enormous mysterious figure appear fog look thriller bark"
}