{
    "title": "en.wikipedia.org_wiki_List_of_aquatic_humanoids",
    "url": "https://en.wikipedia.org/wiki/List_of_aquatic_humanoids",
    "transformers_text": "Aquatic humanoids appear in legend and fiction. [ 1 ] \"Water-dwelling people with fully human, fish-tailed or other compound physiques feature in the mythologies and folklore of maritime, lacustrine and riverine societies across the planet.\" [ 2 ] : 6\n\n\"Ancient sea deities\" have been regarded as the \"earliest version of a human-fish hybrid\". [ 3 ] Creatures with a human torso and the tail of a fish appear in the myths of cultures around the world and persist in contemporary popular culture. [ 2 ] : 6 [ 3 ] [ 4 ]\n\nWater-dwelling humanoids in legend and fiction have frequently been depicted with characteristics of fish. [ 5 ]\n\nHumanoid-amphibian characters have \"been noted across ancient mythologies and, [...] in medieval cryptozoology\", as well as fiction of the Western canon and popular culture. The combination invokes notions of humans' animalistic past, and the tension between the two attributes is used to \"conceive monstrous and horrifying\" and absurd creatures. [ 14 ]\n\nSome water-dwelling humanoids in fiction and legend have been assigned characteristics of species other than amphibians or fish, [ 5 ] or have been presented as \"fully human formed aquatic humanoids\". [ 57 ]",
    "tf_idf_text": "aquatic humanoid appear legend fiction waterdwelling people fully human fishtail compound physique feature mythology folklore maritime lacustrine riverine society across planet ancient sea deity regard early version humanfish hybrid creature human torso tail fish appear myths culture around world persist contemporary popular culture waterdwelling humanoid legend fiction frequently depict characteristic fish humanoidamphibian character note across ancient mythology medieval cryptozoology well fiction western canon popular culture combination invokes notion human animalistic past tension two attribute use conceive monstrous horrify absurd creature waterdwelling humanoid fiction legend assign characteristic specie amphibian fish present fully human form aquatic humanoid"
}