{
    "title": "en.wikipedia.org_wiki_September_2025_Philippine_protests",
    "url": "https://en.wikipedia.org/wiki/September_2025_Philippine_protests",
    "transformers_text": "Anti-Marcos/Anti-Duterte opposition\n\nDutertist opposition\n\nPro-Marcos counterprotesters\n\nNeutrals\n\nOn September 4, 2025, a series of widespread demonstrations began in the Philippines , with the largest protests occurring on September 21 at Rizal Park and Liwasang Bonifacio in Manila and at the People Power Monument , Camp Aguinaldo Gate 4, and EDSA Shrine along EDSA in Quezon City , both within Metro Manila . [ 16 ] They involve several anti-corruption protests stemming from the ongoing flood control projects controversy that largely involved the Department of Public Works and Highways (DPWH) and the legislative branch of the Philippine government. Several cities and municipalities across different provinces also held local demonstrations.\n\nThe September 21 protest in Rizal Park (\" Baha sa Luneta \") was organized by various sectorial groups, including activists and students, while the simultaneous protest at the People Power Monument and EDSA Shrine is known as the \" Trillion Peso March \", organized mainly by religious sectors and civic groups. [ 17 ] [ 18 ] Although protests were characterized as peaceful throughout the country, an isolated riot by masked demonstrators occurred along streets near Malacañang Palace in Manila, injuring several protesters, bystanders and policemen, and resulting in two casualties, one from a stabbing attack and another from a stray bullet.\n\nProtests by militant groups, Diehard Duterte Supporters, and counter-protesters have continued to December combined.\n\nReports of anomalies in flood control projects , including incomplete or substandard work and alleged ghost projects , prompted widespread criticism of the government. Public discontent grew amid calls for transparency and accountability in infrastructure spending. [ 19 ]\n\nProtesters converged at the headquarters of Curlee and Sarah Discaya 's St. Gerrard Construction General Contractor and Development Corporation in Pasig . The protesters vandalized the headquarter's gate. [ 20 ] According to Jonila Castro , one of the protesters, “We chose to come here to one of the companies of the so-called ‘Flood Control Queen and King,’ the Discayas, to show and bring the people’s anger against thieves.” [ 21 ]\n\nIn front of the DPWH main office along Bonifacio Drive , protesters, including those from youth group Anakbayan threw rotten vegetables and smelly water at the gate, which the Manila Police District Philippine National Police (PNP) tried to defend using their shields. [ 21 ]\n\nIn Cebu, regional leaders from AMA Sugbu Kilusang Mayo Uno (KMU), Bayan Muna Cebu, and Bagong Alyansang Makabayan (Bayan) Central Visayas threw rotten tomatoes at the office of DPWH Region VII office in Cebu City decrying corruption. [ 22 ]\n\nA Takbo Laban sa Korapsyon (Run Against Corruption) fun run was done at the University of the Philippines Diliman (UP Diliman) as a protest against corruption where more than 1,000 people participated. They condemned President Bongbong Marcos as the original nepo baby . Organized by the UP Diliman University Student Council (UPD USC), Chairperson Joaquin \"Waks\" Buenaflor said that they organized the event to unite the people against corruption especially amidst the flood control projects controversy. [ 23 ]\n\nA \"Black Friday\" walkout was held by thousands of faculty, students and staff of the University of the Philippines , particularly in the UP Diliman and in the University of the Philippines Manila . Over 3,000 from UP Diliman students, faculty, staff and community joined the protests, making it the largest mass gathering action since the COVID-19 pandemic in the university. [ 24 ] [ 25 ] Series of walkouts were staged by student governments and national-democratic mass organizations such as League of Filipino Students (LFS) also among various campuses. [ 26 ]\n\nOn September 13, several groups marched from the EDSA Shrine in Ortigas Center up to the People Power Monument on EDSA to protest the alleged corruption in nationwide flood control projects. [ 27 ]\n\nOver 500 people took part in the Marikina City leg of Takbo Laban sa Korapsyon to protest corruption in government infrastructure projects. Sarah Elago of Gabriela Women's Party joined the run. On the same day, 150 cyclists from Youth Advocates for Climate Action Philippines and other groups joined the #KontrakTOUR Bike Protest Against Corruption from Quezon City Hall to Luneta Park in Manila. [ 28 ]\n\nStudents from Bulacan State University staged a campus \"walkout\" on September 18 to protest alleged corruption in government projects. [ 29 ] The activity was joined by around 300 participants, including students, faculty members, youth organizations, and representatives from marginalized sections. [ 30 ]\n\nTransport group Pagkakaisa ng mga Samahan ng Tsuper at Operator Nationwide ( Piston ) staged a nationwide strike to protest corruption, explaining how floods result in a loss of livelihood and additional expenses for jeepney drivers and their families. [ 31 ]\n\nOver 7,000 students joined in the UP Los Baños walkout on September 19. [ 32 ] This was considered as the biggest protest inside the university in history. Before the protest, local colleges held their separate protests before merging. UP Student Regent Dexter Clemente joined the protest. [ 33 ]\n\nLocal residents of Hagonoy, Bulacan , held a protest on 3.9-foot-high (1.2 m) high tide water that engulfed many areas in the town and in the towns plaza to protest the failed flood control projects in the town. [ 34 ]\n\nIn Baguio City , a city-wide walkout was staged by students of Saint Louis University where it was participated by local chapters of Anakbayan, Bahaghari , Innabuyog- Gabriela Youth , Kabataan Partylist , and National Union of Students of the Philippines (NUSP). Students wore black and chanted \" Marcos singilin, Duterte panagutin! \" (Charge Marcos, hold Duterte accountable!). They said that “accountability must extend to President Ferdinand Marcos Jr., as he himself signed the budget that enabled these corrupt schemes; he bears primary responsibility.” The protest was staged as a build-up for the September 21 protests. [ 35 ]\n\nA series of mass demonstrations around the country were held on Sunday, September 21. The date of the rally, September 21, coincides with the anniversary of the imposition of martial law by President Ferdinand Marcos Sr. in 1972, a symbolic choice for groups emphasizing democratic rights and government accountability. [ 36 ] [ 37 ] [ 38 ]\n\nThe largest protests were held in Metro Manila : the Baha sa Luneta in Rizal Park , and the Trillion Peso March in the EDSA Shrine . Organizers described the two rallies as complementary and encouraged participation in either or both protests. [ 39 ] Both events have avoided calling for the removal of President Bongbong Marcos and Vice President Sara Duterte , welcoming all groups opposed to corruption regardless of political affiliation. [ 40 ] [ 41 ] Bayan chairperson Teodoro Casiño warned against \"vested interests\" calling for the removal of Marcos and Duterte, while Akbayan representative Perci Cendaña noted that Marcos' resignation may benefit Duterte. [ 42 ] [ 43 ] In response, Anakbayan National Chairperson Mhing Gomez said that there must be no compromises—more than the removal of both Marcos and Duterte, it is the system that must be changed. [ 44 ]\n\nSeveral government officials have expressed support for the protests. President Marcos has addressed the public's concerns by expressing his support for the protests, stating that he understands their anger and would likely join them if he were not president. [ 18 ] DPWH Secretary Vince Dizon expressed his full support for rallies that condemn government corruption, responding to ongoing anti-corruption demonstrations. [ 45 ] Vice President Duterte, who flew to visit OFW communities in Japan , also voiced her support for the protests, calling on the government to listen. [ 46 ]\n\nDuring the rallies, Duterte supporters who were gathered near Gate 4 of Camp Aguinaldo had a brief scuffle with other protesters attending the Trillion Peso March. [ 47 ] [ 48 ] They had been calling for president Marcos' resignation in addition to their pronouncements against corruption. [ 47 ] Among those who attended the anti-Marcos rally were retired military officers led by Romeo Poquiz , a former general in the Air Force . [ 48 ] In later weeks, Armed Forces Chief of Staff Romeo Brawner Jr. admitted to being visited by Poquiz and seven other retired military officers at Camp Aguinaldo in the evening before September 21, with them calling for the military's withdrawal of support for president Marcos and initiating a \"soft coup\" in order to solve corruption. [ 48 ] [ 49 ] Brawner denied their proposal, citing the military's allegiance to the constitution. [ 48 ] [ 49 ] The administration has since deemed their actions seditious and treasonous, although president Marcos was noted to have been unbothered by the retired generals' actions. [ 48 ]\n\nRizal Park became one of the primary venues for the September 21 mass demonstrations. The activities around Luneta were collectively referred to as \"Baha sa Luneta\" ( transl. \"Flood in Luneta\" ). [ 50 ]\n\nProtesters gathered at the Luneta Park on Sunday in a program lead by the group Taumbayan Ayaw sa Magnanakaw at Abusado Network Alliance ( transl. \"People Against Thieves and Abusers Network Alliance\" ), or TAMA NA. [ 51 ] Students from the University of the Philippines Manila marched to the Luneta rally. [ 52 ] [ 53 ] [ 54 ]\n\nAbout 49,000 people were in the park by 10 a.m., according to Manila Public Information Office. [ 55 ] The number of protesters swelled to about 100,000. [ 56 ]\n\nLed by Tindig Pilipinas, Catholic Educational Association of the Philippines, Clergy for Good Governance, and other religious groups, protesters gathered at the EDSA Shrine to conduct the Trillion Peso March demonstration. [ 57 ] [ 58 ] The number of protesters were about 70,000. [ 56 ]\n\nThe September Twenty-One People’s Movement Against Corruption, a coalition of pro-administration civic and reform-oriented groups gathered at Morayta at 4:00 PM, calling for Marcos and the Independent Commission for Infrastructure to end corruption. [ 59 ]\n\nPlanned demonstrations were reported at Plaza Independencia in Cebu City and a march from Jaro Plaza to the provincial capitol in Iloilo City . A rally was also scheduled at the public plaza in Bacolod. [ 60 ] [ 61 ]\n\nIn Cebu City, dozens of protesters, primarily students and youth, gathered at Fuente Osmeña Circle at 8:30 a.m. PST before marching along Osmeña Boulevard . The rally lasted for about two hours. [ 62 ] A separate rally was held by pro-Duterte protesters at Plaza Independencia , calling for President Marcos' resignation. [ 63 ]\n\nIn Davao City , pro-Duterte groups roasted 100 cows as an \"offering to the heavens\" against corruption in a prayer rally organized by Vice President Duterte. [ 64 ] The sacrificial slaughtering was condemned by the Philippine Animal Welfare Society . [ 65 ]\n\nSimilar protests were also held in Legazpi , [ 66 ] Laoag , Tuguegarao , San Fernando , Olongapo , Baguio , Pangasinan , Dumaguete , Cagayan de Oro , [ 67 ] and Butuan . [ 68 ]\n\nIn Baguio City, more than 5,000 protested composed of youth, church, and workers' groups. Those who spoke included Joanna Cariño of the Cordillera People's Alliance and public health worker Beth Solang who called out the government amidst unfinished healthcare facilities, understaffed healthcare systems, and underpaid healthcare workers. [ 69 ]\n\nWhile protests nationwide were relatively peaceful, rioting occurred along Mendiola Street and Recto Avenue in Manila . [ 70 ] Police reported that protesters in Mendiola threw improvised incendiary devices, including Molotov cocktails , which injured at least 39 officers. [ 71 ] Alongside these confrontations, media also reported scattered incidents of property damage such as burning tires and barricades during face-offs between security forces and demonstrators. [ 37 ] Rioters engaged in violent confrontations with police and ignited a trailer truck on Ayala Bridge in Manila. [ 72 ] A group of protesters in masks rioted along Recto Avenue by setting fires in the middle of the street, hurling stones, human waste, and objects at police officers, and attacking several nearby establishments including ransacking a Sogo Hotel branch. [ 73 ] Reports vary on testimonies regarding small explosions heard during confrontations between the authorities and rallyists in Mendiola, with some claiming to have heard at least one gunshot. [ 74 ] [ 75 ] None of the initial police officers assigned to crowd control held firearms, [ 76 ] while a SWAT team later arrived carrying firearms and was seen using tear gas by eyewitnesses. [ 77 ] [ 78 ]\n\nSupporters of Rodrigo Duterte were reported to have attempted a march from their protest venue in Liwasang Bonifacio to Mendiola, intending to move their rally to nearby Malacañang Palace and call for President Marcos' resignation, but halted their march due to the rioters along Recto. [ 79 ] [ 80 ] [ 81 ]\n\nSeventeen individuals were arrested for throwing rocks at riot police and igniting barricade tires, as reported by local authorities. Less than an hour later, police deployed a water cannon against another group of masked protesters. Some officers retaliated by throwing rocks back at the demonstrators. Manila Mayor Isko Moreno stated that police officers were injured during the confrontations and are currently receiving medical care. [ 37 ] Photojournalists who documented the event also reported beatings and harassment of rioters and bystanders committed by the police. [ 78 ]\n\nMark Chustin Serbo, a 15-year-old protester from Taguig who participated in the riots, was fatally stabbed by a 52-year-old watch technician after attempting to set fire to a police motorcycle near the latter's shop; he was initially reported to have been the lone casualty during the incident, having been declared dead on arrival upon being brought to the Jose R. Reyes Memorial Medical Center (JRRMMC). [ 82 ] [ 83 ] [ 84 ] Serbo's parents had no prior knowledge of his participation in the Manila rally, only being told by Serbo that he was going out for a Sunday afternoon with friends. [ 83 ] The technician later surrendered to Manila police and apologized, claiming to have panicked and blanked out in committing the attack amidst the violence. [ 82 ]\n\nEric Q. Saber, a 35-year-old construction worker from Paracale , Camarines Norte , was going home from work in Pasay when he was fatally shot during the riots. [ 13 ] [ 84 ] According to Bulatlat and AlterMidya , he had been crossing Recto Avenue to ride a jeepney when SWAT officers fired shots in his direction, resulting in a stray bullet hitting his neck; [ 13 ] [ 84 ] a spinal injury caused by the bullet wound was later confirmed by forensic pathologist Raquel Fortun . [ 85 ] Saber was soon brought to the JRRMMC, but reportedly died two days later from pneumonia as a result of his gunshot wound. [ 84 ] [ 85 ]\n\nAccording to the police, 224 individuals were arrested during a protest against corruption, which resulted in 131 police officers getting injured. [ 86 ] The MPD reported arrests at various locations: 51 at Ayala Bridge (38 adults, 13 minors), 21 at Mendiola (14 adults, 7 minors), and 41 at Recto (13 adults, 28 minors). Among the injured police, eight had lacerations, with nine hospitalized for observation and one possibly needing admission for a nasal fracture, according to police. [ 87 ] [ 15 ] According to the National Union of People's Lawyers (NUPL), police tortured detainees at the police tent at Mendiola and at the MPD headquarters. [ 88 ] The NUPL also said that police made several detainees beat up other detainees, while some detainees were being forced to give false confessions. [ 89 ]\n\nJournalist Manuel Mogato remarked that the violence along the areas was an isolated incident among the peaceful nationwide demonstrations, noting that both protesters and police authorities were markedly more restrained than during the dictatorial presidency of Ferdinand Marcos in the 1970s and 1980s. [ 76 ] University of the Philippines Diliman journalism professor Danilo Arao did not just consider the Sep 21 rallies as culminating activities but also a time for all citizens, not just journalists, to carry out their patriotic duty to \"fact check everything.\" [ 90 ]\n\nThe riots were estimated to have resulted in ₱ 10.4 million ( US$ 211,167.51) in damage to both public infrastructure and private property. [ 91 ] The International Coalition for Human Rights in the Philippines described the mass arrests and violent dispersal as human rights violations. [ 92 ]\n\nKarapatan stated on September 22 that detainees were not given food and water, with many of them injured and had no place to lie down. Police allegedly took bites out of hamburgers that lawyers brought for the children in detention. Karapatan said that police officers could be held liable under the Philippine Anti-Torture Act. [ 89 ] Some people were detained without charges for longer than the 36 hours that Philippine laws allow for arrests without warrants. [ 93 ]\n\nA report by human rights group Amnesty International stated that police used \"unnecessary and excessive force\" and are guilty of torture and other human rights violations. A 20-year old protester testified that he was assaulted by plainclothes officers and later punched, kicked and beaten by police with truncheons until he passed out. He was again beaten in an ambulance until reporters arrived. Three teenage brothers who did not take part in the protest were beaten by police with truncheons and then accused of assaulting police. [ 94 ] [ 93 ]\n\nThe police subsequently issued subpoenas to student leaders as part of its investigation on the Mendiola protests, where police used sonic weapons, tear gas, and water cannons against protesters and passersby. Student council leaders and university officials condemned the police for issuing subpoenas and harassing students. [ 95 ] The NUPL said the subpoenas aim to threaten people to prevent them from exercising their right to free expression, peaceful assembly and redress of grievances\". [ 96 ]\n\nSmaller gatherings were also held in cities outside the Philippines in solidarity with the September 21 protests including in Sydney and Melbourne , Australia . [ 97 ] Overseas chapters of Anakbayan, Bayan, Migrante , and Gabriela lead and participated in protests and other activities of overseas Filipinos and foreigners in solidarity in cities in Australia, United States, Europe, HongKong, Japan, Canada, New Zealand, and the Middle East on various dates. [ 98 ] [ 99 ] [ 100 ]\n\nOn September 22, it was reported that schools were closed and a curfew was declared for minors. [ 86 ] Samahan ng Progresibong Kabataan (SPARK) staged a protest at Camp Crame , headquarters of the Philippine National Police, for the alleged police brutality following the arrest of the rioters on September 21. [ 101 ] The Communist Party of the Philippines released a statement supporting the protests, and connected the political unrest to recent protests in Indonesia, Nepal, and Kenya. [ 102 ]\n\nLoved ones and members of progressive groups such as Kalikasan launched a protest in front of the MPD Headquarters in order to condemn police response on September 21, for the release of the detained, and to continuously condemn corruption. [ 103 ]\n\nHundreds of students walked out at the Ateneo de Davao University in protest against corruption. University president Fr. Karel San Juan spoked at the mobilization. [ 104 ]\n\nBlack Friday protests were held by the Concerned Artists of the Philippines along the MRT Station, Cubao, Quezon City [ 105 ] and by the students of the Notre Dame of Marbel University from Alunan Avenue to South Cotabato Sports Complex, Koronadal City . [ 106 ]\n\nThe civil society group Tindig Paombong organized a protest in Paombong , Bulacan, to raise concerns over alleged corruption and the quality of flood control projects in the town, which residents claimed had contributed worsening flood in their communities. Issues related to Paombong's water supply largely provided by PrimeWater , a company that has faced criticism for service deficiencies, were also highlighted. The protest concluded in front of the municipal hall of Paombong where students, local leaders, and representatives of various organizations delivered speeches. The event was estimated have drawn around 500 participants from different parts of Bulacan. [ 107 ]\n\nStudents from the University of Santo Tomas (UST) and Far Eastern University (FEU) staged walkouts in Manila, both lead by student councils and university chapters of chapters of Kabataan Partylist, Anakbayan, and LFS. At FEU, the demonstration titled \"Tamaraws, Unite! Walkout For Our Rights!\" took place along Nicanor Reyes Street and was organized by student councils and youth groups. Participants raised their concerns over blended learning setup , rising tuition fees, and called for greater transparency in school policies. The protests also addressed broader issues including corruption, police brutality, and democratic rights in the Philippines. Student leaders condemned the denial of other media and government authorities of the police brutality in response to the September 21 riots. [ 108 ] [ 109 ] [ 110 ]\n\nKMU and other groups rallied outside the headquarters of the Philippine National Police in condemnation of police violence during the September 21 anti-corruption demonstrations in Manila. [ 111 ]\n\nOn September 30, students from Bulacan State University held the protest \"Kick Back Kontra Korap\" ( transl. Kick Back Anti-Corrupt ). The march began at their main campus and passed by the Bulacan Capitol and Malolos City Hall but was cut short before reaching the office of First District Representative Danilo Domingo . The students called on Governor Daniel Fernando and Mayor Christian Natividad to support demands for justice for flood victims, pointing to alleged irregularities in flood control projects linked to DPWH. Nearly one thousand students joined the rally. [ 112 ]\n\nThousands of teachers staged a classroom walkout to protest the corruption in government infrastructure projects. Protesters criticized the militarization of school campuses, low wages for teachers, and the government leaving classrooms and flood control projects unfinished. The Alliance of Concerned Teachers called for an increase in teachers' salaries, raising the budget for education, and the prosecution of corrupt government officials. [ 113 ] . Attendees of TWICE 's This Is For concert at the Philippine Arena in Bulacan were also chanting \"Ikulong na yan mga kurakot\" before the concert proper [ 114 ] .\n\nOn October 6, students from De La Salle University staged a walkout in front of St. La Salle Hall where more than 1,500 participated. Organizers included the University Student Government, Lasallians Against Corruption, and the university chapter of Anakbayan. Teddy Casiño became one of the speakers of the mobilization. [ 115 ]\n\nOn October 8, students from the University of the East conducted a walkout where UE student and social media personality Awra Briguela participated and echoed the anti-corruption sentiments of the students. [ 116 ]\n\nOn October 9, Our Lady of Fatima University Quezon City campus students staged a walkout. [ 117 ] [ better source needed ]\n\nOn October 10, Students from the Polytechnic University of the Philippines launched a system-wide walkout where more than 15,000 students participated, according to the Office of the Student Regent. They staged a walkout in order to seriously condemn anomalous flood control projects and the lack of government accountability. Students condemned the effects of corruption on their university, like budget cuts and the long-unfinished DPWH-project North Wing building. Unions of sanitation workers and teachers also joined the students during the protest action.\n\nAt the end of the program, student leader John Paul “JP” Azusano, on behalf of SAMASA PUP, together with chapters of Anakbayan , League of Filipino Students (LFS) , Panday Sining , Kabataan Partylist , and other mass organizations, called for genuine systemic change and the removal of President Ferdinand “Bongbong” Marcos Jr., Vice President Sara Duterte, and all corrupt politicians. In his speech, Azusano criticized the government for the university’s budget deficit, as well as for state attacks and the illegal detention of student leaders during the September 21 anti-corruption protest, while noting that corrupt politicians remain free and unaccountable. He concluded his address with a call for the ouster of President Marcos Jr., which coincided with the burning of an effigy representing the President. [ 118 ]\n\nOn October 12–13, Representative Kiko Barzaga ( Cavite–4th ) led a protest outside Forbes Park in Makati from the evening of October 12 and ended early morning of the next day. The demonstration was attended by 300 people. [ 119 ] The protesters demanded President Marcos Jr. to resign. [ 120 ]\n\nProtest leaders questioned the actions of Barzaga, saying that his actions were just mere antics and that it is hypocritical for the likes of Barzaga to be anti-corruption for supporting other corrupt officials and being part of a political dynasty that sports a lavish life. Anakbayan Chairperson Mhing Gomez said that he is just diverting the anger of the people, for he did not criticize the 2026 budget that contains unprogrammed appropriations. [ 121 ]\n\nOn October 17, a National Day of Action against Corruption was spearheaded by groups such as Anakbayan, UP Act Against Corruption Network (UP ACTION), NUSP, and Kabataan Partylist, [ 122 ] [ 123 ] where more than 5,000 youth and students from many schools and universities of the National Capital Region participated in a mass mobilization in Mendiola. Congresswoman Renee Co of Kabataan Partylist said that President Marcos Jr. cannot escape accuntability since more than 9,000 flood control projects were done since 2022 where more than 4,000 were approved under unprogrammed appropriations. Simultaneous youth actions were launched by Anakbayan chapters in different cities outside Manila, such as the mobilization at the Central Luzon State University. [ 124 ] Calls included the removal of both President Marcos Jr. and Vice President Duterte and the change of system .\n\nA Black Friday Protest was launched in Cebu City against corruption and against 'weaponization' of law against those who protested at Region VII DPWH office on September 4, 2025. A subpoena violating Batas Pambansa 880 was previously issued against regional Cebuano leaders because of 'damage' done by their throwing of tomatoes towards the office. The protesters held a banner \"Prosecute the corrupt bureaucrat-capitalists , not the protesters.” [ 22 ]\n\nOn October 19, during a UAAP basketball game between La Salle and UP at the Araneta Coliseum , the DLSU Animo Squad and the UP Pep Squad had a joint performance calling for the corrupt to be jailed. [ 125 ]\n\nPeasant organization Kilusang Magbubukid ng Pilipinas (KMP), together with more than 40 organizations, launched a protest at Mendiola against Marcos Jr., on October 21 against his policies that show that there is no genuine land reform in the country, and that peasant issues have been exacerbated by the worsening corruption in the government. Peasants have been camping out by the gates of the Department of Agrarian Reform for a week. Speakers of the mobilization, former Gabriela Women's Party Representative Liza Maza and KMP Chairperson Danilo Ramos , said that farmers are affected by 'ghost projects' such as corrupted flood control and farm-to-market road projects. KMP Secretary-General Ronnie Manalo denounced the involvement of government officials on corruption while there is a need for farmers in the Philippines for post-disaster relief and compensation as well as facilities like post-harvest machines, dryers, irrigation, and rice mills. He also denounced how government funds are being embezzled, being used for the luxury of government officials. Farmers from as far as Negros , Southern Tagalog , and Central Luzon have condemned at Mendiola issues such as corruption and rampant land conversion . Protesters destroyed an effigy of President Marcos Jr. portrayed as a rat pest . [ 126 ] [ 127 ] [ 128 ]\n\nUP Diliman student leaders lead by UPD USC Chairperson Joaquin \"Waks\" Buenaflor and Mattheo Wovi Villanueva of the Student Christian Movement of the Philippines (SCMP) held a press conference and a subsequent protest against subpoena by the PNP on Buenaflor in relation to the September 21 protest. The students condemned how the PNP has been quick against student activists, but cannot go after corrupt officials. [ 129 ] [ 130 ] Buenaflor said that those charged should be the contractors and corrupt officials. [ 131 ]\n\nVarious groups launched 'Black Friday Protests' as part of continued condemnation of corruption under the Marcos Jr. administration on October 24, 2025. Members of People’s Surge and KMP barged to the gates of the Department of Energy compound, Bonifacio Global City, Taguig City, where the Independent Commission for Infrastructure headquarters was located. Protesters attempted to open the gate of the compound. [ 132 ] Ka Mimi Doringo , condemned the lack of accountability for two months, that urban poor remain homeless and vulnerable. [ 133 ]\n\nLater that day, students protested along UP Diliman and Commonwealth Avenue against the subpoena on UPD USC Chairperson Buenaflor while continuously condemning corruption. Protesters presented a 'counter-subpoena' against President Marcos Jr. Buenaflor said that they were \"not afraid of a simple subpoena from the Marcos-Duterte regime; instead, we are becoming bolder, and we will even uphold our stand to fight and hold all the corrupt accountable.\" Students from the Rizal Technological University also staged a walk-out. [ 132 ]\n\nVarious schools, churches, and multi-sectoral groups in San Miguel, Bulacan held a protest program at Patio Mayor San Miguel Arcangel. The protester sang \" Magkaisa \" by Vina Morales , composed by Tito Sotto , as part of the event. Students from La Consolacion University Philippines also joined the demonstration in Malolos, which began with a holy mass at the Malolos Cathedral before the march. [ 134 ]\n\nYouth leaders trooped to the gate of Camp Crame, against subpoenas of the PNP on student leaders for their involvement in the September 21 protest. The protesters continued to decry corruption and their claim of political intimidation and repression of those participating in the protests. The students said that those under investigation must be the corrupt officials. A speaker of the program said that government funds must be allocated to education and not corruption and political suppression. PUP Sentral na Konseho ng mga Mag-aaral (Central Student Council) President Tiffany Faith Brillante, one of those who received subpoenas and was called to show up to the police on that date opted to join and speak at the protest action. In an act of defiance, protesters tore up and burned copies of the subpoena. [ 135 ] [ 136 ]\n\nHealth workers from the Alliance of Health Workers staged a protest in front of the Philippine Heart Center condemning corruption and its effects on the deplorable conditions of health workers in the country. The group also condemned unfinished 'super health centers', as well as expired medicines that are being investigated for corruption. [ 137 ] [ 138 ]\n\nA candle-lighting protest condemning corrupt politicians and ghost projects was conducted by student journalists in Catarman , Northern Samar spearheaded by University of Eastern Philippines (UEP) student publication The Pillar with the College Editors Guild of the Philippines and Altermidya . [ 139 ]\n\nOne the eve of All Souls' Day , BAYAN mobilized at Mendiola in a Halloween -themed protest, calling Malacañang a 'house of horror'. BAYAN Secretary-General Raymond \"Mong\" Palatino said that those who truly kill Filipinos are the corrupt politicians. The protest featured demonic and monstrous descriptions of politicians like President Marcos Sr. and Vice President Sara Duterte. [ 140 ]\n\nClergy people from the Iglesia Filipina Independiente and Promotion of Church People's Response launched a anti-corruption Black Friday Protest in Cagayan de Oro City . [ 141 ]\n\nVarious groups affiliated with BAYAN launched multiple protests for November 7 Black Friday Protests.\n\nIn the morning, groups such as KMP, as well as disaster survivors, clashed with the police at the Office of the Ombudsman in Quezon City. The groups urged the Ombudsman to urgently investigate President Marcos Jr. for his said role in “institutionalizing corruption”. They urged the office to probe flood control projects and other infrastructure that exacerbated floods in Cebu during Typhoon Tino approved during the Duterte and Marcos Jr. administrations. [ 142 ] In a separate statement, Gabriela Women's Party Congresswoman Sarah Elago called for an independent investigation of infrastructure projects in Cebu as well. [ 143 ]\n\nGroups such as BAYAN National Capital Region marched from Liwasang Bonifacio to Mendiola in protest against corruption called Lakbayan ng Mamamayan Kontra Korapsyon (Journey of the People Against Corruption). A significant of the protest was cultural, containing street theater and musical performances, also paying homage to the October Revolution and the Great Proletarian Cultural Revolution . [ 144 ]\n\nUrban poor groups and members from Bayan Muna and Kadamay protested along Gregorio Araneta Avenue , Quezon City where there has been a flood-control project priced at ₱48 million, but they said did not work for residents of Brgy. Tatalon and was only painted red. [ 145 ]\n\nTeachers from the Alliance of Concerned Teachers (ACT) held a Black Friday Protest among their places of work against corruption. According to ACT Chairperson Ruby Bernardo, teachers are not asking for luxury, but their rights as teachers for just pay. ACT hit President Marcos Jr. for his lavish lifestyle and travels amidst corruption, calling him as the principal architect of corruption. They announced a national sit-down strike on November 28. [ 146 ]\n\nTeachers, students, and employees launched a protest inside UP Diliman denouncing the fact that 44% of UP Diliman employees are contractual workers while there is massive corruption. [ 147 ]\n\nDuring dusk, BAYAN held a Black Friday Protest at Katipunan Avenue denouncing corruption. They also denounced the massive budget of National Task Force to End Local Communist Armed Conflict where red-tagging has been used to stifle dissent. [ 148 ] [ 146 ]\n\nWorkers of unions under the leadership of trade union center KMU, Pambato Cargo Forwarder, Wyeth Philippines , and Daiwa Seiko, went out from their places of work to forward anti-corruption calls while also calling for higher wages and better working conditions. [ 149 ]\n\nStudents of Mapúa University Makati staged a walkout against corruption. [ 150 ]\n\nBAYAN and affiliated groups launched multiple decentralized protests for November 14 Black Friday Protests.\n\nKMP held a protest outside the Senate as the Blue Ribbon Committee probe on flood control corruption was ongoing. [ 151 ]\n\nUrban poor group Kadamay led a Hukuman ng Maralita (Court of the Poor), condemning the National Housing Authority , Department of Human Settlements and Urban Development , and President Marcos Jr. for corruption of officials and contractors amidst housing crisis in the country. [ 152 ]\n\nBayan Muna launched protests in Tatalon, Quezon City and Blumentritt , Sampaloc , Manila. [ 153 ] [ 154 ]\n\nVarious unions under KMU held protests at their work places. These include Nexperia Philippines Inc. Workers Union, Wyeth Philippines Progressive Workers Union - WPPWU, Vanson Paper Industrial Workers Union, and Gabay ng Unyon sa Telekomuniksyon ng mga Superbisor (GUTS- PLDT ). [ 155 ] [ 156 ] [ 157 ] [ 158 ] Workers from First Cavite Industrial Estate, Cavite (headed by Progressive Workers Union Local 47-IBM KMU); Centro Mall Cabuyao, Laguna; and Canlubang Industrial Estate, Laguna also held similar anti-corruption and pro-worker protests. [ 159 ]\n\nUST chapters of Anakbayan, Panday Sining, and Kabataan Partylist marched from España to Central Market and conducted an anti-corruption at the market to highlight the plight of the vendors amidst large-scale corruption. [ 160 ]\n\nAt Mendiola, youth groups and labor groups such as KMU staged a protest against corruption. The protesters called for accountability for all those involved in corruption, including President Marcos Jr. The Manila Police placed barbed wires as barricades at the entrance of the road, in front of the Mendiola Peace Arch. [ 161 ]\n\nStudents and teachers from UP Diliman College of Engineering and College of Science dissolved faces of President Marcos Jr. and Vice President Sara Duterte printed on paper as part of protests against corruption. They denounced how money should have been put into facilities like laboratories. [ 162 ] STEM students from PUP, UP Manila, and Philippine Normal University led by Agham Youth also launched a protest at their respective universities against government corruption, also condemning the effect of corruption during typhoons Tino and Uwan. They expressed how misuse of government funds have led to the stunting of STEM development in the country. [ 163 ] [ 164 ] [ 165 ] Members of UP ACTION also launched a protest at Brgy. Krus Na Ligas . [ 166 ] Hours later, students of UP Diliman converged with other students, teachers, and staff in a protest in Philcoa . [ 167 ]\n\nMakabayan leaders Liza Maza and Rep. Antonio Tinio of ACT Teachers joined church people and other citizens in San Pablo , Laguna for a rally by San Pablo Ayaw sa Korapsyon (SAPAK). [ 168 ]\n\nIn Cebu City, victims of typhoon Tino and BAYAN Central Visayas staged a Black Friday Protest at dusk at Gorordo Avenue, denouncing government corruption. They lit candles and rang bells [ 169 ]\n\nOutside of their convent at Aurora Boulevard , nuns from the Religious of the Good Shepherd held their weekly rosary prayer against corruption. [ 170 ]\n\nMiss Earth -Water 2024 Bea Millan-Windorski joined a climate justice mobilization headed by Youth Advocates for Climate Action Philippines, Kalikasan, and Agham near US Embassy Manila against imperialism and how corruption worsens natural disasters. [ 171 ]\n\nBAYAN held a protest at Boy Scout Memorial Circle in Quezon City carrying calls for President Marcos Jr. and Vice President Duterte to resign following the video statements of resigned Rep. Zaldy Co . According to BAYAN Secretary General Mong Palatino, they are opposed to the message of the Iglesia Ni Cristo rally for they have been silent regarding the said corruption of the Dutertes. [ 172 ]\n\nThe second installment of Takbo Laban sa Korapsyon (Run Against Corruption) fun run was held at UP Diliman headed by the UP Diliman Engineering Student Council and STEM-based organizations under BAYAN. Over 3,000 runners joined the event. The fun run featured a jail booth where participants tried to put alleged various government officials in a make-shift jail. They even expressed disappointment over the justice system where no one has been held accountable for the past three months. [ 173 ] Miss Earth-Water 2024 Bea Millan-Windorski also spoked during the event, saying that corruption is a worldwide issue, including in the United States and in the then-ongoing Conference of Parties for the dominance of business and fossil-fuel lobbyists .\n\nProgressive youth led by Rise for Education - SLSU and Bantay-Kaban Quezon held a 'hang-out protest' against corruption near the San Luis Obispo Church , Lucban , Quezon [ 174 ]\n\nThe Iglesia ni Cristo -led \" Rally for Transparency and a Better Democracy \" protest also begins. Around 550,000 people were estimated to have gathered around the Quirino Grandstand in Manila by afternoon. [ 175 ] [ 176 ] [ 177 ]\n\nThe United People's Initiative (UPI) held a parallel protest at the People Power Monument with the group urging President Marcos and Vice President Duterte to resolve their difference and focus on dealing with the anti-corruption issue. Meanwhile other groups Partido Demokratiko Pilipino (PDP) and the Bangon Sambayanan has blamed Marcos for the issue. [ 178 ]\n\nBAYAN-affiliated youth mass organizations, student councils, and other groups led various youth-led anti-corruption protests in celebration of International Students' Day , nationally also observed as National Students' Day.\n\nYouth Rage Against Corruption, Kabataan Partylist, and other groups marched to Mendiola in protest against corruption. Students carried placards towards the resignation of President Marcos Jr. and Vice President Duterte. However, they were only able to reach the front of the University of the East , Recto Avenue due to police barricades. [ 179 ] [ 180 ]\n\nStudents also marched and protested in anti-corruption rallies in UP Los Baños , UP Visayas , Miagao ; Cebu City; Tacloban City ; and Davao City where it was spearheaded by the regional chapter of Kabataan Partylist. [ 181 ] [ 182 ] [ 183 ] [ 184 ] [ 185 ] [ excessive citations ] In Iloilo City, students from UP Visayas Iloilo City Campus, West Visayas State University , and Central Philippine University , as well as teachers and members from other sectors merged by the Iloilo Provincial Capitol . [ 186 ]\n\nFor the first time in the university's history, a walkout was staged by the students of the UEP, Catarman . The protest was against corruption and against militarization while there were also reported presence of police and intelligence agents. [ 187 ]\n\nIn the afternoon, students from Ateneo de Manila University, Miriam College , and UP Diliman merged at Katipunan Avenue for a joint One Katipunan Laban sa Korapsyon protest. Heads and representatives of the student councils of the three educational institutions have called for the resignation of both the President and Vice President and all those involved in corruption. [ 188 ] [ 189 ] [ 190 ]\n\nIn the evening, the Iglesia ni Cristo -led \"Rally for Transparency and a Better Democracy\" protest ended, cutting it short by one day. [ 191 ]\n\nThe Duterte-aligned groups, Reforma Filipina and Hakbang ng Maisug, said they respected the decision of INC organizers and instead moved their assembly to Liwasang Bonifacio , where they continued to rally over separate issues including flooding in Quezon City’s fifth district. [ 192 ]\n\nHeaded by the National Union of Students of the Philippines Cordillera in observance of International / National Students' Day, more than 5,000 students from Baguio City and Benguet walked out of Benguet State University (BSU), Saint Louis University , University of Baguio , University of the Cordilleras , UP Baguio, and other schools and converged at Malcolm Square. Students of BSU joined the walkout despite what students voiced as efforts by the school administration to silence the mobilization. Students raised anti-corruption calls where government money could have been used for education purposes. Students have said that this will not be their last walkout and they would participate in the Bonifacio Day rallies on November 30. [ 193 ] [ 194 ]\n\nPro-Marcos counter-protesters, led by Filipinos Do Not Yield movement, gathered at the Welcome Rotonda in Quezon City, expressed their support for President Ferdinand Marcos Jr., and calling for the accountability on corrupt politicians. [ 195 ]\n\nA National Day of Walkout was orchestrated by Youth Rage Against Corruption, Kabataan Partylist, Anakbayan, and many more. The protesters converged by afternoon at Mendiola. Before this, walkouts were conducted by students in many schools and universities around Metro Manila. [ 196 ] Speakers and banners called for the resignation and removal of both President Marcos Jr. and Vice President Sara Duterte.\n\nOther BAYAN affiliated organizations also held Black Friday Protests that day.\n\nA church-led protest was held along Katipunan Avenue that night.\n\nA Padyak Kontra Kurakot (Pedal Against Corrupt) was held by groups such as Kalikasan, Kilusang Bayan Kontra Kurakot, Make It Safer Movement, and Youth Advocates for Climate Action Philippines . Cyclists donning protest placards and other forms of visual protest cycled from Quezon City Hall to Liwasang Bonifacio, Manila. [ 197 ] [ 198 ]\n\nBAYAN and affiliated organizations hosted several Black Friday Protests.\n\nA big protest by the Trillion Peso March Movement was made in EDSA and a Baha Sa Luneta 2.0 was done at Luneta Park that marched to Mendiola Avenue. Pro-Duterte supporters was also done Liwasang Bonifacio that also marched to Mendiola, carry the calls of resignation and ouster of the President, but loyalty to the Vice President. Pro-Marcos supporters from Sulu was also done at Mendiola prior, loyalty to the President.\n\nMultiple reiterations of several protest movements have also happened in many regions and cities around the Philippines and by OFWs around the world, including a demonstration in Utrecht in the Netherlands, [ 199 ] led by overseas chapters of BAYAN. [ 200 ]\n\nIn Baguio City, a local version of Baha sa Luneta was held, called Baha sa Burnham [Park]. [ 201 ]\n\nAfter a 6-year hiatus after Covid-19, UP Baguio once held a Lantern Parade in the campus where students held calls against corruption. UPB Chancellor Joel Addawe commended the students' leadership. [ 202 ]",
    "tf_idf_text": "antimarcosantiduterte opposition dutertist opposition promarcos counterprotesters neutral september series widespread demonstration begin philippines large protest occur september rizal park liwasang bonifacio manila people power monument camp aguinaldo gate edsa shrine along edsa quezon city within metro manila involve several anticorruption protest stem ongoing flood control project controversy largely involved department public work highway dpwh legislative branch philippine government several city municipality across different province also hold local demonstration september protest rizal park baha luneta organize various sectorial group include activist student simultaneous protest people power monument edsa shrine know trillion peso march organize mainly religious sector civic group although protest characterize peaceful throughout country isolate riot mask demonstrator occur along street near malacaang palace manila injure several protester bystander policeman result two casualty one stab attack another stray bullet protest militant group diehard duterte supporter counterprotesters continue december combined report anomaly flood control project include incomplete substandard work allege ghost project prompt widespread criticism government public discontent grow amid call transparency accountability infrastructure spending protester converge headquarters curlee sarah discaya gerrard construction general contractor development corporation pasig protester vandalize headquarters gate accord jonila castro one protester choose come one company socalled flood control queen king discayas show bring people anger thief front dpwh main office along bonifacio drive protester include youth group anakbayan threw rotten vegetable smelly water gate manila police district philippine national police pnp try defend use shield cebu regional leader ama sugbu kilusang mayo uno kmu bayan muna cebu bagong alyansang makabayan bayan central visayas throw rotten tomato office dpwh region vii office cebu city decry corruption takbo laban korapsyon run corruption fun run do university philippine diliman diliman protest corruption people participate condemned president bongbong marcos original nepo baby organize diliman university student council upd usc chairperson joaquin waks buenaflor say organize event unite people corruption especially amidst flood control project controversy black friday walkout held thousand faculty student staff university philippine particularly diliman university philippine manila diliman student faculty staff community join protest make large mass gather action since covid pandemic university series walkout stag student government nationaldemocratic mass organization league filipino student lfs also among various campus september several group march edsa shrine ortigas center people power monument edsa protest allege corruption nationwide flood control project people take part marikina city leg takbo laban korapsyon protest corruption government infrastructure project sarah elago gabriela womens party join run day cyclists youth advocate climate action philippine group join kontraktour bike protest corruption quezon city hall luneta park manila student bulacan state university stag campus walkout september protest allege corruption government project activity join around participant include student faculty member youth organization representative marginalize section transport group pagkakaisa mga samahan tsuper operator nationwide piston stag nationwide strike protest corruption explain flood result loss livelihood additional expense jeepney driver family student join los baos walkout september consider big protest inside university history protest local college hold separate protest merge student regent dexter clemente join protest local resident hagonoy bulacan hold protest foothigh high tide water engulf many area town town plaza protest fail flood control project town baguio city citywide walkout staged student saint louis university participate local chapter anakbayan bahaghari innabuyog gabriela youth kabataan partylist national union student philippines nusp student wear black chant marcos singilin duterte panagutin charge marcos hold duterte accountable say accountability must extend president ferdinand marcos sign budget enable corrupt scheme bear primary responsibility protest stag buildup september protest series mass demonstration around country hold sunday september date rally september coincide anniversary imposition martial law president ferdinand marcos symbolic choice group emphasize democratic right government accountability large protest hold metro manila baha luneta rizal park trillion peso march edsa shrine organizer describe two rally complementary encourage participation either protest event avoid call removal president bongbong marcos vice president sara duterte welcome group oppose corruption regardless political affiliation bayan chairperson teodoro casio warn vested interest call removal marcos duterte akbayan representative perci cendaa note marcos resignation may benefit duterte response anakbayan national chairperson mhing gomez say must compromisesmore removal marcos duterte system must change several government official express support protest president marcos address public concern express support protest state understands anger would likely join not president dpwh secretary vince dizon express full support rally condemn government corruption respond ongoing anticorruption demonstration vice president duterte fly visit ofw community japan also voiced support protest call government listen rally duterte supporter gather near gate camp aguinaldo brief scuffle protester attend trillion peso march call president marcos resignation addition pronouncement corruption among attended antimarcos rally retire military officer lead romeo poquiz former general air force later week arm force chief staff romeo brawner admit visited poquiz seven retire military officer camp aguinaldo even september call military withdrawal support president marcos initiate soft coup order solve corruption brawner deny proposal cite militarys allegiance constitution administration since deem action seditious treasonous although president marcos note unbothered retired general action rizal park become one primary venue september mass demonstration activity around luneta collectively refer baha luneta transl flood luneta protester gather luneta park sunday program lead group taumbayan ayaw magnanakaw abusado network alliance transl people thieve abuser network alliance tama student university philippine manila march luneta rally people park accord manila public information office number protester swell lead tindig pilipinas catholic educational association philippine clergy good governance religious group protester gather edsa shrine conduct trillion peso march demonstration number protester september twentyone people movement corruption coalition proadministration civic reformoriented group gather morayta call marcos independent commission infrastructure end corruption plan demonstration report plaza independencia cebu city march jaro plaza provincial capitol iloilo city rally also schedule public plaza bacolod cebu city dozen protester primarily student youth gather fuente osmea circle pst march along osmea boulevard rally last two hour separate rally hold produterte protester plaza independencia call president marcos resignation davao city produterte group roast cow offer heaven corruption prayer rally organize vice president duterte sacrificial slaughtering condemn philippine animal welfare society similar protest also hold legazpi laoag tuguegarao san fernando olongapo baguio pangasinan dumaguete cagayan oro butuan baguio city protest composed youth church worker group speak include joanna cario cordillera people alliance public health worker beth solang call government amidst unfinished healthcare facility understaffed healthcare system underpaid healthcare worker protest nationwide relatively peaceful rioting occur along mendiola street recto avenue manila police report protester mendiola threw improvise incendiary device include molotov cocktail injure least officer alongside confrontation medium also report scattered incident property damage burning tire barricade faceoffs security force demonstrator rioter engage violent confrontation police ignite trailer truck ayala bridge manila group protester mask riot along recto avenue set fire middle street hurl stone human waste object police officer attack several nearby establishment include ransack sogo hotel branch report vary testimony regard small explosion hear confrontation authority rallyists mendiola claim heard least one gunshot none initial police officer assign crowd control hold firearm swat team later arrive carry firearm see use tear gas eyewitness supporter rodrigo duterte report attempt march protest venue liwasang bonifacio mendiola intend move rally nearby malacaang palace call president marcos resignation halt march due rioter along recto seventeen individual arrest throw rock riot police ignite barricade tire report local authority less hour later police deployed water cannon another group mask protester officer retaliate throw rock back demonstrator manila mayor isko moreno state police officer injured confrontation currently receive medical care photojournalist document event also report beating harassment rioter bystander commit police mark chustin serbo yearold protester taguig participate riot fatally stab yearold watch technician attempt set fire police motorcycle near latter shop initially report lone casualty incident declare dead arrival upon bring jose reyes memorial medical center jrrmmc serbos parent prior knowledge participation manila rally tell serbo go sunday afternoon friend technician later surrender manila police apologize claim panicked blank commit attack amidst violence eric saber yearold construction worker paracale camarines norte go home work pasay fatally shot riot accord bulatlat altermidya cross recto avenue ride jeepney swat officer fire shot direction result stray bullet hit neck spinal injury cause bullet wound later confirm forensic pathologist raquel fortun saber soon bring jrrmmc reportedly die two day later pneumonia result gunshot wound accord police individual arrest protest corruption result police officer get injured mpd report arrest various location ayala bridge adult minor mendiola adult minor recto adult minor among injured police eight laceration nine hospitalize observation one possibly need admission nasal fracture accord police accord national union people lawyer nupl police torture detainee police tent mendiola mpd headquarters nupl also say police make several detainee beat detainee detainee force give false confession journalist manuel mogato remark violence along area isolate incident among peaceful nationwide demonstration note protester police authority markedly restrain dictatorial presidency ferdinand marcos university philippine diliman journalism professor danilo arao not consider sep rally culminate activity also time citizens not journalist carry patriotic duty fact check everything riot estimate result million damage public infrastructure private property international coalition human right philippine describe mass arrest violent dispersal human right violation karapatan stated september detainees not give food water many injured place lie police allegedly take bite hamburger lawyer bring child detention karapatan say police officer could hold liable philippine antitorture act people detain without charge long hour philippine law allow arrest without warrant report human right group amnesty international state police use unnecessary excessive force guilty torture human right violation year old protester testify assaulted plainclothes officer later punch kick beaten police truncheon pass beaten ambulance reporter arrive three teenage brother not take part protest beaten police truncheon accuse assault police police subsequently issue subpoenas student leader part investigation mendiola protest police use sonic weapon tear gas water cannon protester passersby student council leader university official condemn police issue subpoena harass student nupl say subpoenas aim threaten people prevent exercise right free expression peaceful assembly redress grievance small gathering also hold city outside philippine solidarity september protest include sydney melbourne australia overseas chapter anakbayan bayan migrante gabriela lead participated protest activity overseas filipinos foreigner solidarity city australia united state europe hongkong japan canada new zealand middle east various date september report school close curfew declare minor samahan progresibong kabataan spark stag protest camp crame headquarters philippine national police allege police brutality follow arrest rioter september communist party philippine release statement support protest connect political unrest recent protest indonesia nepal kenya love one member progressive group kalikasan launch protest front mpd headquarters order condemn police response september release detain continuously condemn corruption hundred student walk ateneo davao university protest corruption university president karel san juan spoked mobilization black friday protest hold concerned artist philippine along mrt station cubao quezon city student notre dame marbel university alunan avenue south cotabato sport complex koronadal city civil society group tindig paombong organize protest paombong bulacan raise concern allege corruption quality flood control project town resident claim contribute worsen flood community issue related paombongs water supply largely provide primewater company face criticism service deficiency also highlight protest conclude front municipal hall paombong student local leader representative various organization deliver speech event estimate drawn around participant different part bulacan student university santo tomas ust far eastern university feu stag walkout manila lead student council university chapter chapter kabataan partylist anakbayan lf feu demonstration title tamaraws unite walkout right take place along nicanor reyes street organize student council youth group participant raise concern blend learn setup rise tuition fee call great transparency school policy protest also address broad issue include corruption police brutality democratic right philippine student leader condemn denial medium government authority police brutality response september riot kmu group rally outside headquarters philippine national police condemnation police violence september anticorruption demonstration manila september student bulacan state university hold protest kick back kontra korap transl kick back anticorrupt march begin main campus pass bulacan capitol malolos city hall cut short reach office first district representative danilo domingo student call governor daniel fernando mayor christian natividad support demand justice flood victim point alleged irregularity flood control project link dpwh nearly one thousand student join rally thousand teacher stag classroom walkout protest corruption government infrastructure project protester criticize militarization school campus low wage teacher government leave classroom flood control project unfinished alliance concern teacher call increase teacher salary raise budget education prosecution corrupt government official attendee twice concert philippine arena bulacan also chant ikulong yan mga kurakot concert proper october student salle university stag walkout front salle hall participate organizer include university student government lasallians corruption university chapter anakbayan teddy casio become one speaker mobilization october student university east conduct walkout student social medium personality awra briguela participate echoed anticorruption sentiment student october lady fatima university quezon city campus student stag walkout good source need october student polytechnic university philippine launch systemwide walkout student participate accord office student regent stag walkout order seriously condemn anomalous flood control project lack government accountability student condemn effect corruption university like budget cut longunfinished dpwhproject north wing building union sanitation worker teacher also join student protest action end program student leader john paul azusano behalf samasa pup together chapter anakbayan league filipino student lfs panday sin kabataan partylist mass organization call genuine systemic change removal president ferdinand bongbong marcos vice president sara duterte corrupt politician speech azusano criticized government universitys budget deficit well state attack illegal detention student leader september anticorruption protest note corrupt politician remain free unaccountable conclude address call ouster president marcos coincide burn effigy represent president october representative kiko barzaga caviteth lead protest outside forbes park makati evening october end early morning next day demonstration attend people protester demand president marcos resign protest leader question action barzaga say action mere antic hypocritical like barzaga anticorruption support corrupt official part political dynasty sport lavish life anakbayan chairperson mhing gomez say diverting anger people not criticize budget contains unprogrammed appropriation october national day action corruption spearhead group anakbayan act corruption network action nusp kabataan partylist youth student many school university national capital region participate mass mobilization mendiola congresswoman renee kabataan partylist say president marcos cannot escape accuntability since flood control project do since approve unprogrammed appropriation simultaneous youth action launch anakbayan chapter different city outside manila mobilization central luzon state university call included removal president marcos vice president duterte change system black friday protest launch cebu city corruption weaponization law protest region vii dpwh office september subpoena violate bata pambansa previously issue regional cebuano leader damage do throwing tomato towards office protester hold banner prosecute corrupt bureaucratcapitalists not protester october uaap basketball game salle araneta coliseum dlsu animo squad pep squad joint performance call corrupt jail peasant organization kilusang magbubukid pilipinas kmp together organization launch protest mendiola marcos october policy show genuine land reform country peasant issue exacerbate worsen corruption government peasant camp gate department agrarian reform week speaker mobilization former gabriela womens party representative liza maza kmp chairperson danilo ramos say farmer affect ghost project corrupt flood control farmtomarket road project kmp secretarygeneral ronnie manalo denounce involvement government official corruption need farmer philippines postdisaster relief compensation well facility like postharvest machine dryer irrigation rice mill also denounce government fund embezzle used luxury government official farmer far negros southern tagalog central luzon condemn mendiola issue corruption rampant land conversion protester destroy effigy president marcos portray rat pest diliman student leader lead upd usc chairperson joaquin waks buenaflor mattheo wovi villanueva student christian movement philippine scmp held press conference subsequent protest subpoena pnp buenaflor relation september protest student condemn pnp quick student activist cannot corrupt official buenaflor say charge contractor corrupt official various group launch black friday protest part continue condemnation corruption marcos administration october member people surge kmp barge gate department energy compound bonifacio global city taguig city independent commission infrastructure headquarters locate protester attempt open gate compound mimi doringo condemn lack accountability two month urban poor remain homeless vulnerable later day student protest along diliman commonwealth avenue subpoena upd usc chairperson buenaflor continuously condemn corruption protester present countersubpoena president marcos buenaflor say not afraid simple subpoena marcosduterte regime instead become bolder even uphold stand fight hold corrupt accountable student rizal technological university also stag walkout various school church multisectoral group san miguel bulacan hold protest program patio mayor san miguel arcangel protester sing magkaisa vina morale compose tito sotto part event student consolacion university philippine also join demonstration malolos begin holy mass malolos cathedral march youth leader troop gate camp crame subpoenas pnp student leader involvement september protest protester continue decry corruption claim political intimidation repression participate protest student say investigation must corrupt official speaker program say government fund must allocate education not corruption political suppression pup sentral konseho mga magaaral central student council president tiffany faith brillante one receive subpoena call show police date opt join speak protest action act defiance protester tear burn copy subpoena health worker alliance health worker stag protest front philippine heart center condemn corruption effect deplorable condition health worker country group also condemn unfinished super health center well expire medicine investigate corruption candlelighting protest condemn corrupt politician ghost project conduct student journalist catarman northern samar spearhead university eastern philippine uep student publication pillar college editor guild philippine altermidya one eve soul day bayan mobilize mendiola halloween theme protest call malacaang house horror bayan secretarygeneral raymond mong palatino say truly kill filipino corrupt politician protest feature demonic monstrous description politician like president marcos vice president sara duterte clergy people iglesia filipina independiente promotion church people response launch anticorruption black friday protest cagayan oro city various group affiliate bayan launch multiple protest november black friday protest morning group kmp well disaster survivor clash police office ombudsman quezon city group urge ombudsman urgently investigate president marcos say role institutionalize corruption urge office probe flood control project infrastructure exacerbate flood cebu typhoon tino approve duterte marcos administration separate statement gabriela womens party congresswoman sarah elago call independent investigation infrastructure project cebu well group bayan national capital region march liwasang bonifacio mendiola protest corruption call lakbayan mamamayan kontra korapsyon journey people corruption significant protest cultural contain street theater musical performance also pay homage october revolution great proletarian cultural revolution urban poor group member bayan muna kadamay protest along gregorio araneta avenue quezon city floodcontrol project price million say not work resident brgy tatalon paint red teacher alliance concerned teacher act hold black friday protest among place work corruption accord act chairperson ruby bernardo teacher not ask luxury right teacher pay act hit president marcos lavish lifestyle travel amidst corruption call principal architect corruption announce national sitdown strike november teacher student employee launch protest inside diliman denounce fact diliman employee contractual worker massive corruption dusk bayan hold black friday protest katipunan avenue denounce corruption also denounce massive budget national task force end local communist arm conflict redtagging use stifle dissent worker union leadership trade union center kmu pambato cargo forwarder wyeth philippine daiwa seiko go place work forward anticorruption call also call high wage well work condition student mapa university makati stag walkout corruption bayan affiliate group launch multiple decentralized protest november black friday protest kmp hold protest outside senate blue ribbon committee probe flood control corruption ongoing urban poor group kadamay lead hukuman maralita court poor condemn national housing authority department human settlement urban development president marcos corruption official contractor amidst housing crisis country bayan muna launch protest tatalon quezon city blumentritt sampaloc manila various union kmu held protest work place include nexperia philippine inc worker union wyeth philippine progressive worker union wppwu vanson paper industrial worker union gabay unyon telekomuniksyon mga superbisor gut pldt worker first cavite industrial estate cavite head progressive worker union local ibm kmu centro mall cabuyao laguna canlubang industrial estate laguna also hold similar anticorruption proworker protest ust chapter anakbayan panday sin kabataan partylist march espaa central market conduct anticorruption market highlight plight vendor amidst largescale corruption mendiola youth group labor group kmu stag protest corruption protester call accountability involve corruption include president marcos manila police place barbed wire barricade entrance road front mendiola peace arch student teacher diliman college engineering college science dissolve face president marcos vice president sara duterte print paper part protest corruption denounce money put facility like laboratory stem student pup manila philippine normal university lead agham youth also launch protest respective university government corruption also condemn effect corruption typhoon tino uwan express misuse government fund lead stunt stem development country member action also launch protest brgy krus ligas hour later student diliman converged student teacher staff protest philcoa makabayan leader liza maza rep antonio tinio act teacher join church people citizens san pablo laguna rally san pablo ayaw korapsyon sapak cebu city victim typhoon tino bayan central visayas stag black friday protest dusk gorordo avenue denounce government corruption light candle ring bell outside convent aurora boulevard nuns religious good shepherd hold weekly rosary prayer corruption miss earth water bea millanwindorski join climate justice mobilization head youth advocate climate action philippine kalikasan agham near embassy manila imperialism corruption worsen natural disaster bayan hold protest boy scout memorial circle quezon city carry call president marcos vice president duterte resign follow video statement resign rep zaldy accord bayan secretary general mong palatino oppose message iglesia cristo rally silent regard say corruption dutertes second installment takbo laban korapsyon run corruption fun run hold diliman head diliman engineering student council stembased organization bayan runner join event fun run feature jail booth participant try put alleged various government official makeshift jail even express disappointment justice system one held accountable past three month miss earthwater bea millanwindorski also spoked event say corruption worldwide issue include united state thenongoing conference party dominance business fossilfuel lobbyist progressive youth lead rise education slsu bantaykaban quezon hold hangout protest corruption near san luis obispo church lucban quezon iglesia cristo lead rally transparency well democracy protest also begin around people estimate gather around quirino grandstand manila afternoon unite people initiative upi hold parallel protest people power monument group urge president marcos vice president duterte resolve difference focus deal anticorruption issue meanwhile group partido demokratiko pilipino pdp bangon sambayanan blame marcos issue bayanaffiliated youth mass organization student councils group lead various youthled anticorruption protest celebration international student day nationally also observe national student day youth rage corruption kabataan partylist group march mendiola protest corruption student carry placard towards resignation president marcos vice president duterte however able reach front university east recto avenue due police barricade student also march protested anticorruption rally los baos visayas miagao cebu city tacloban city davao city spearhead regional chapter kabataan partylist excessive citation iloilo city student visayas iloilo city campus west visayas state university central philippine university well teacher member sector merge iloilo provincial capitol first time universitys history walkout stag student uep catarman protest corruption militarization also report presence police intelligence agent afternoon student ateneo manila university miriam college diliman merge katipunan avenue joint one katipunan laban korapsyon protest head representative student council three educational institution call resignation president vice president involve corruption even iglesia cristo lead rally transparency well democracy protest end cut short one day dutertealigned group reforma filipina hakbang maisug say respect decision inc organizer instead move assembly liwasang bonifacio continue rally separate issue include flood quezon citys fifth district head national union student philippines cordillera observance international national student day student baguio city benguet walk benguet state university bsu saint louis university university baguio university cordilleras baguio school converge malcolm square student bsu join walkout despite student voiced effort school administration silence mobilization student raise anticorruption call government money could use education purpose student say not last walkout would participate bonifacio day rally november promarcos counterprotesters lead filipino not yield movement gather welcome rotonda quezon city express support president ferdinand marcos call accountability corrupt politician national day walkout orchestrate youth rage corruption kabataan partylist anakbayan many protester converge afternoon mendiola walkout conduct student many school university around metro manila speaker banner call resignation removal president marcos vice president sara duterte bayan affiliate organization also hold black friday protest day churchled protest hold along katipunan avenue night padyak kontra kurakot pedal corrupt held group kalikasan kilusang bayan kontra kurakot make safer movement youth advocate climate action philippine cyclist don protest placard form visual protest cycle quezon city hall liwasang bonifacio manila bayan affiliate organization host several black friday protest big protest trillion peso march movement make edsa baha luneta do luneta park march mendiola avenue produterte supporter also do liwasang bonifacio also march mendiola carry call resignation ouster president loyalty vice president promarcos supporter sulu also do mendiola prior loyalty president multiple reiteration several protest movement also happen many region city around philippine ofws around world include demonstration utrecht netherlands lead overseas chapter bayan baguio city local version baha luneta hold call baha burnham park year hiatus covid baguio held lantern parade campus student hold call corruption upb chancellor joel addawe commend student leadership"
}