{
    "title": "789 7 \"The Capital City Falls?! Big Mom and Jimbei\"Transliteration: \"Shuto Hōkai!? Biggu Mamu to Jinbē\" (Japanese:首都崩壊！？ ビッグ・マムとジンベエ) Yasunori Koyama Shōji Yonemura May 21, 2017(2017-05-21)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_19",
    "transformers_text": "789 7 \"The Capital City Falls?! Big Mom and Jimbei\"Transliteration: \"Shuto Hōkai!? Biggu Mamu to Jinbē\" (Japanese:首都崩壊！？ ビッグ・マムとジンベエ) Yasunori Koyama Shōji Yonemura May 21, 2017(2017-05-21)\n\nBig Mom continues her murderous rampage through Sweet City, still searching for croquembouche. Her 16th son Charlotte Moscato tries to stop her, but she steals forty years of his lifespan from him in a blind rage. However, before she can reach the castle, Jimbei races in with a pile of croquembouche tourists and feeds them to her, satiating her. With Big Mom in a good mood, Jimbei formally requests to leave her crew. Big Mom takes Jimbei to her castle in order to discuss Jimbei's request, and as they walk, Jimbei recalls his past experience with Luffy. Meanwhile, the Sanji Retrieval Team sails into the Mixed Juice Current, where the sea is composed of several juices. The team is attacked by fruit footballfish which resemble giant fruits, but Luffy kills several of them and the team feasts on their fruit bodies.",
    "tf_idf_text": "capital city fall big mom jimbeitransliteration shuto hkai biggu mamu jinb japanese yasunori koyama shji yonemura may big mom continue murderous rampage sweet city still search croquembouche son charlotte moscato try stop steal forty year lifespan blind rage however reach castle jimbei race pile croquembouche tourist feed satiate big mom good mood jimbei formally request leave crew big mom take jimbei castle order discus jimbeis request walk jimbei recall past experience luffy meanwhile sanji retrieval team sail mixed juice current sea compose several juice team attack fruit footballfish resemble giant fruit luffy kill several team feast fruit body"
}