{
    "title": "797 15 \"A Top Officer! The Sweet 3 General Cracker Appears!\"Transliteration: \"Dai Kanbu! San Shōsei Kurakkā Tōjō\" (Japanese:大幹部！三将星クラッカー登場) Kentarō Fujita Hitoshi Tanaka July 16, 2017(2017-07-16)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_19",
    "transformers_text": "797 15 \"A Top Officer! The Sweet 3 General Cracker Appears!\"Transliteration: \"Dai Kanbu! San Shōsei Kurakkā Tōjō\" (Japanese:大幹部！三将星クラッカー登場) Kentarō Fujita Hitoshi Tanaka July 16, 2017(2017-07-16)\n\nCharlotte Cracker confronts Luffy and Nami and pulls the buried man, Pound, out of the ground. Cracker reveals to Pound that Big Mom gave permission to kill him, and Pound begs him to let him see his daughters Chiffon and Lola one last time. The mention of Lola's name shocks Nami, who recalls meeting her on Thriller Bark. She remembers getting a Vivre Card pointing to Lola's mother, and realizes that Lola's mother is Big Mom. Randolph, Charlotte Brûlée, and the giant tree homie King Baum arrive to finish the job against the Straw Hats, and Brûlée reveals that she has Carrot and Chopper trapped in a mirror, which she shatters. Cracker asserts that taking out their enemies is now his responsibility, and attempts to execute Pound. However, Luffy blocks his strike, and as the two fight, Nami and Pound run away. They are chased by Brûlée and the homies, but on her hunch, Nami pulls out Lola's Vivre Card. The Vivre Card emits the aura of Big Mom's powerful soul, rendering all of the homies unable to attack.",
    "tf_idf_text": "top officer sweet general cracker appearstransliteration dai kanbu san shsei kurakk japanese kentar fujita hitoshi tanaka july charlotte cracker confronts luffy nami pull bury man pound ground cracker reveals pound big mom give permission kill pound beg let see daughter chiffon lola one last time mention lolas name shock nami recall meet thriller bark remembers get vivre card point lolas mother realize lolas mother big mom randolph charlotte brle giant tree homie king baum arrive finish job straw hat brle reveals carrot chopper trap mirror shatters cracker assert take enemy responsibility attempt execute pound however luffy block strike two fight nami pound run away chased brle homies hunch nami pull lolas vivre card vivre card emits aura big mom powerful soul render homies unable attack"
}