{
    "title": "799 17 \"An All-out Duel! Gear Four vs. the Bis-Bis Ability!\"Transliteration: \"Zenryoku Shōbu Gia Fōsu tai Bisu Bisu no Chikara\" (Japanese:全力勝負　ギア 4VSビスビスの能力) Directed by: Katsumi TokoroStoryboarded by: Kenji Yokoyama Shōji Yonemura July 30, 2017(2017-07-30)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_19",
    "transformers_text": "799 17 \"An All-out Duel! Gear Four vs. the Bis-Bis Ability!\"Transliteration: \"Zenryoku Shōbu Gia Fōsu tai Bisu Bisu no Chikara\" (Japanese:全力勝負　ギア 4VSビスビスの能力) Directed by: Katsumi TokoroStoryboarded by: Kenji Yokoyama Shōji Yonemura July 30, 2017(2017-07-30)\n\nDespite his most valiant efforts, Luffy cannot overwhelm Cracker's defenses. Cracker pins Luffy down, and the Sweet Commander claims that Sanji, as a royal, should appreciate his upcoming wedding and that Luffy is doing him no favors by rescuing him. This enrages Luffy, causing him to activate Gear Fourth: Bounceman, and he finally lands a harmful blow on Cracker. Cracker is powerless before Gear Fourth's might, and his body seemingly shatters after another attack. However, Cracker's body is revealed to just be a puppet made of biscuit, and the real Cracker reveals himself to Luffy, showcasing the powers of the Bis-Bis Fruit as he creates several of the biscuit puppets that Luffy had taken so long to bring down just one of. Meanwhile, Brook and Pedro encounter some Biscuit Soldiers as well in Sweet City, but as homies, and Pedro plans to use them to enter the Whole Cake Chateau. In the Mirro-World, Chopper and Carrot struggle to move around with chain balls around their feet, but they try to look into one of the mirrors. Elsewhere in the Seducing Woods, Nami decides to use the power of her Vivre Card to force the homies to attack Cracker, much to their shock.",
    "tf_idf_text": "allout duel gear four bisbis abilitytransliteration zenryoku shbu gia fsu tai bisu bisu chikara japanese direct katsumi tokorostoryboarded kenji yokoyama shji yonemura july despite valiant effort luffy cannot overwhelm cracker defenses cracker pin luffy sweet commander claim sanji royal appreciate upcoming wed luffy favor rescue enrages luffy cause activate gear fourth bounceman finally land harmful blow cracker cracker powerless gear fourth might body seemingly shatters another attack however cracker body revealed puppet make biscuit real cracker reveals luffy showcasing power bisbis fruit create several biscuit puppet luffy take long bring one meanwhile brook pedro encounter biscuit soldier well sweet city homies pedro plan use enter whole cake chateau mirroworld chopper carrot struggle move around chain ball around foot try look one mirror elsewhere seduce wood nami decides use power vivre card force homies attack cracker much shock"
}