{
    "title": "800 18 \"The First and the Second Join! The Vinsmoke Family\"Transliteration: \"Ichi to Ni Shūketsu! Vinsumōku-ke\" (Japanese:1と2　集結！ヴィンスモーク家) Directed by: Yusuke SuzukiStoryboarded by: Aya Komaki Atsuhiro Tomioka August 6, 2017(2017-08-06)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_19",
    "transformers_text": "800 18 \"The First and the Second Join! The Vinsmoke Family\"Transliteration: \"Ichi to Ni Shūketsu! Vinsumōku-ke\" (Japanese:1と2　集結！ヴィンスモーク家) Directed by: Yusuke SuzukiStoryboarded by: Aya Komaki Atsuhiro Tomioka August 6, 2017(2017-08-06)\n\nLuffy continues struggling against Cracker's Biscuit Soldiers; every time he destroys them, Cracker just makes more, and the Sweet Commander keeps Luffy on his toes with occasional onslaughts. However, Nami has put the homies under her command and forces them to attack Cracker against their will, Chopper and Carrot decide to exploit the Mirro-World and gain access to all the mirrors on Whole Cake Island, and Brook and Pedro hide inside a biscuit soldier homie that is going into the Whole Cake Chateau. The next day, Sanji's older brothers Vinsmoke Ichiji and Niji return to the Germa Kingdom, and the three of them reunite. However, when the Vinsmoke Family eats a meal together, Sanji and Niji quickly get into a fight over Niji's treatment of his food and cooks.",
    "tf_idf_text": "first second join vinsmoke familytransliteration ichi shketsu vinsumkuke japanese direct yusuke suzukistoryboarded aya komaki atsuhiro tomioka august luffy continue struggle cracker biscuit soldier every time destroy cracker make sweet commander keep luffy toe occasional onslaught however nami put homies command force attack cracker chopper carrot decide exploit mirroworld gain access mirror whole cake island brook pedro hide inside biscuit soldier homie go whole cake chateau next day sanjis old brother vinsmoke ichiji niji return germa kingdom three reunite however vinsmoke family eats meal together sanji niji quickly get fight nijis treatment food cook"
}