{
    "title": "812 30 \"Invading the Chateau! Reach the Road Ponegliff!\"Transliteration: \"Shadō sen'nyũ – Ubae! Rōdo Pōnegurifu\" (Japanese:城内潜入 奪え！ ロード歴史の本文) Yoshihiro Ueda Shōji Yonemura November 5, 2017(2017-11-05)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_19",
    "transformers_text": "812 30 \"Invading the Chateau! Reach the Road Ponegliff!\"Transliteration: \"Shadō sen'nyũ – Ubae! Rōdo Pōnegurifu\" (Japanese:城内潜入 奪え！ ロード歴史の本文) Yoshihiro Ueda Shōji Yonemura November 5, 2017(2017-11-05)\n\nTamago increases security on the Big Mom Pirates' three Ponegliffs in the Room of Treasure by having Sweet Commander Charlotte Smoothie protect them. Brook spies on the room and returns to tell Pedro about security and they hatch a plan to bypass it. In the Mirro-World, Brûlée and her henchmen finally capture Chopper and Carrot. However, the two devise a plan. They are taken to Brûlée's house where Carrot is about to be cooked in a boiling pot, but Chopper prepares the plan. Big Mom shows the Vinsmoke Family her collection of rare creatures trapped inside giant books. Meanwhile, Luffy wakes up in another part of the library, and he and Nami are bound inside a book together. Big Mom departs from the Vinsmokes and calls Luffy and Nami to discuss their actions but to her surprise, Luffy responds defiantly.",
    "tf_idf_text": "invade chateau reach road poneglifftransliteration shad senny ubae rdo pnegurifu japanese yoshihiro ueda shji yonemura november tamago increase security big mom pirate three ponegliffs room treasure sweet commander charlotte smoothie protect brook spy room return tell pedro security hatch plan bypass mirroworld brle henchman finally capture chopper carrot however two devise plan take brles house carrot cook boil pot chopper prepare plan big mom show vinsmoke family collection rare creature trap inside giant book meanwhile luffy wake another part library nami bound inside book together big mom departs vinsmokes call luffy nami discus action surprise luffy responds defiantly"
}