{
    "title": "816 34 \"The History of the Left Eye! Pedro vs. Baron Tamago!\"Transliteration: \"Hidarime no Innen – Pedoro VS Tamago Danshaku\" (Japanese:左眼の因縁 ペドロVSタマゴ男爵) Masahiro Hosoda Atsuhiro Tomioka December 3, 2017(2017-12-03)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_19",
    "transformers_text": "816 34 \"The History of the Left Eye! Pedro vs. Baron Tamago!\"Transliteration: \"Hidarime no Innen – Pedoro VS Tamago Danshaku\" (Japanese:左眼の因縁 ペドロVSタマゴ男爵) Masahiro Hosoda Atsuhiro Tomioka December 3, 2017(2017-12-03)\n\nChopper and Carrot run through the Mirro-World with Brûlée as their hostage to find Luffy, Nami and Sanji. Luffy attempts to rip his arms to escape imprisonment while Reiju is found by Pudding in a bloody state. Big Mom confronts Brook for trying steal a copy of her Road Ponegliff. Pedro battles Baron Tamago and thinks of the day he and Zepo first arrived on Whole Cake Island: They ran into Pekoms and learned that he became a member of the Big Mom Pirates. Pedro and Zepo attempt to sneak into Big Mom's Treasure Repository for her Ponegliffs but are ambushed by Tamago and the Chess Soldiers. They battle the soldiers and Tamago, even taking his left eye, until Big Mom appears. In the present, Pedro and Tamago continue their battle and talk about the day how Pedro lost is left eye. In the past, Pekoms is shocked at what his friends done while Big Mom is angry and makes spin the roulette. She makes Zepo spin it first and takes 100 years of his life, killing him as he only had 30 years left to live and tells Pedro to pay the remaining 70 years. Returning to the present again, Pedro and Tamago's battle intensifies as Tamago turns the tide around in his favor. In the past, Big Mom demands the 70 years but Pekoms managed to persuade her not to kill Pedro, however, she still demands 60 years of his life. Pedro removes his left eye and manages to make Big Mom only take 50 years of his life. In the present, Tamago continues his beat down on Pedro and questions his reason for returning. Pedro places his firm belief in the Straw Hats that they will change the world and cuts Tamago in half.",
    "tf_idf_text": "history leave eye pedro baron tamagotransliteration hidarime innen pedoro tamago danshaku japanese masahiro hosoda atsuhiro tomioka december chopper carrot run mirroworld brle hostage find luffy nami sanji luffy attempt rip arm escape imprisonment reiju find pudding bloody state big mom confronts brook try steal copy road ponegliff pedro battle baron tamago think day zepo first arrived whole cake island run pekoms learn become member big mom pirate pedro zepo attempt sneak big mom treasure repository ponegliffs ambush tamago chess soldier battle soldier tamago even take leave eye big mom appear present pedro tamago continue battle talk day pedro lose leave eye past pekoms shock friend do big mom angry make spin roulette make zepo spin first take year life kill year leave live tell pedro pay remain year return present pedro tamagos battle intensifies tamago turn tide around favor past big mom demand year pekoms manage persuade not kill pedro however still demand year life pedro remove leave eye manages make big mom take year life present tamago continue beat pedro question reason return pedro place firm belief straw hat change world cut tamago half"
}