{
    "title": "819 37 \"Sora's Wish! Germa's Failure – Sanji!\"Transliteration: \"Sora no Negai – Jeruma no Shippaisaku Sanji\" (Japanese:母 (ソラ) の願い ジェルマの失敗作サンジ) Yoshihiro Ueda Hitoshi Tanaka December 24, 2017(2017-12-24)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_19",
    "transformers_text": "819 37 \"Sora's Wish! Germa's Failure – Sanji!\"Transliteration: \"Sora no Negai – Jeruma no Shippaisaku Sanji\" (Japanese:母 (ソラ) の願い ジェルマの失敗作サンジ) Yoshihiro Ueda Hitoshi Tanaka December 24, 2017(2017-12-24)\n\nJimbei frees Luffy and Nami by burning the book they're trapped in, declaring an act of rebellion against Big Mom that he admits he cannot go back from. Meanwhile, Sanji visits Reiju in the medical center and informs her of the memories Pudding erased. Reiju insists that Sanji escape, but still plans to attend the wedding herself and allow Germa 66 to be taken out at the expense of her own life. Reiju explains that when their mother Sora was pregnant, she was strongly opposed to the surgery planned for her sons, as it would make them extremely strong but also emotionless; Sora took a drug to undo the surgery's effects which left her weakened but was only successful on Sanji. While Judge blames Sanji for Sora's death, Reiju tells him that Sora never regretted her actions due to Sanji being a kind child.",
    "tf_idf_text": "soras wish germas failure sanjitransliteration sora negai jeruma shippaisaku sanji japanese yoshihiro ueda hitoshi tanaka december jimbei free luffy nami burn book theyre trap declare act rebellion big mom admit cannot back meanwhile sanji visit reiju medical center informs memory pudding erased reiju insist sanji escape still plan attend wed allow germa take expense life reiju explain mother sora pregnant strongly oppose surgery plan son would make extremely strong also emotionless sora take drug undo surgery effect leave weaken successful sanji judge blame sanji soras death reiju tell sora never regret action due sanji kind child"
}