{
    "title": "821 39 \"The Chateau in Turmoil! Luffy, to the Rendezvous!\"Transliteration: \"Shatō Dōran – Rufi Yakusoku no Basho e\" (Japanese:城内 (シャトー) 動乱 ルフィ約束の場所へ) Directed by: Yusuke SuzukiStoryboarded by: Tetsuya Endō Tomohiro Nakayama January 14, 2018(2018-01-14)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_19",
    "transformers_text": "821 39 \"The Chateau in Turmoil! Luffy, to the Rendezvous!\"Transliteration: \"Shatō Dōran – Rufi Yakusoku no Basho e\" (Japanese:城内 (シャトー) 動乱 ルフィ約束の場所へ) Directed by: Yusuke SuzukiStoryboarded by: Tetsuya Endō Tomohiro Nakayama January 14, 2018(2018-01-14)\n\nAs Pedro detonates a string of dynamite at the courtyard, Chopper grabs him into the Mirro-World, before Tamago, having regenerated into the rooster-like Count Niwatori. While traveling in the Mirro-World, Chopper and Carrot manage to locate Nami and Jimbei, who are evading the Big Mom Pirates. Meanwhile, Luffy continues running through the chateau and is confronted by Cabaletta, who intends to avenge Cadenza. After a furious clash, Luffy manages to defeat Cabaletta and continues onward. Luffy eventually comes across the infirmary, where Reiju hides him from the pursuing Big Mom Pirates. Reiju informs Luffy that Sanji has been made aware of Pudding's deception and Luffy decides to return to the place where he promised to wait for Sanji. After jumping out of the Chateau and landing in Sweet City, Luffy is confronted by Chess Soldiers as he is traveling to his intended destination. While wandering in the hallways of the Chateau, Sanji decides that he will not return to the Straw Hats.",
    "tf_idf_text": "chateau turmoil luffy rendezvoustransliteration shat dran rufi yakusoku basho japanese direct yusuke suzukistoryboarded tetsuya end tomohiro nakayama january pedro detonate string dynamite courtyard chopper grab mirroworld tamago regenerate roosterlike count niwatori travel mirroworld chopper carrot manage locate nami jimbei evade big mom pirate meanwhile luffy continue run chateau confront cabaletta intend avenge cadenza furious clash luffy manage defeat cabaletta continue onward luffy eventually come across infirmary reiju hide pursue big mom pirate reiju informs luffy sanji make aware pudding deception luffy decides return place promise wait sanji jump chateau land sweet city luffy confront chess soldier travel intend destination wander hallway chateau sanji decide not return straw hat"
}