{
    "title": "824 42 \"The Rendezvous! Luffy, a One-on-One at His Limit!\"Transliteration: \"Yakusoku no Basho – Rufi Genkai no Ikkiuchi\" (Japanese:約束の場所 ルフィ限界の一騎打ち) Aya Komaki Shōji Yonemura February 4, 2018(2018-02-04)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_19",
    "transformers_text": "824 42 \"The Rendezvous! Luffy, a One-on-One at His Limit!\"Transliteration: \"Yakusoku no Basho – Rufi Genkai no Ikkiuchi\" (Japanese:約束の場所 ルフィ限界の一騎打ち) Aya Komaki Shōji Yonemura February 4, 2018(2018-02-04)\n\nLuffy fights against Charlotte Counter but despite his best efforts, his hunger causes him to be easily overpowered. Meanwhile, Brook reveals to the Sanji Retrieval Team that he successfully transcribed Big Mom's Ponegliffs. As the team prepares to find Sanji, Jimbei states that they should reach him before the wedding, as there is a plot going on behind the scenes that will plunge it into chaos. He reveals that Pekoms was caught up in this scheme, which resulted in him being shot by Bege. In the Whole Cake Chateau, the Vinsmokes celebrate by getting drunk and outside in Sweet City, Bobbin is shot by a mysterious gunman while pursuing Sanji who reaches the outskirts of Sweet City where Luffy promised, but cannot find him. However, he finally locates the unconscious Luffy by the remains of King Baum after hearing his stomach rumble.",
    "tf_idf_text": "rendezvous luffy oneonone limittransliteration yakusoku basho rufi genkai ikkiuchi japanese aya komaki shji yonemura february luffy fight charlotte counter despite best effort hunger cause easily overpower meanwhile brook reveals sanji retrieval team successfully transcribe big mom ponegliffs team prepare find sanji jimbei state reach wed plot go behind scenes plunge chaos reveals pekoms catch scheme result shot bege whole cake chateau vinsmokes celebrate get drunk outside sweet city bobbin shoot mysterious gunman pursue sanji reach outskirts sweet city luffy promise cannot find however finally locate unconscious luffy remain king baum hear stomach rumble"
}