{
    "title": "838 56 \"The Launcher Blasts! The Moment of Big Mom's Assassination!\"Transliteration: \"Heiki Sakuretsu! Biggu Mamu Ansatsu no Shunkan\" (Japanese:兵器炸裂! ビッグ·マム暗殺の瞬間) Yoshihiro Ueda Tomohiro Nakayama May 27, 2018(2018-05-27)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_19",
    "transformers_text": "838 56 \"The Launcher Blasts! The Moment of Big Mom's Assassination!\"Transliteration: \"Heiki Sakuretsu! Biggu Mamu Ansatsu no Shunkan\" (Japanese:兵器炸裂! ビッグ·マム暗殺の瞬間) Yoshihiro Ueda Tomohiro Nakayama May 27, 2018(2018-05-27)\n\nLinlin cried from Carmel's disappearance, and two people witnessed what really happened. One of the witnesses was an Elbaf giant, who quickly fled back to Elbaf to tell the other giants what he saw. The other witness was Streusen, who decided to take advantage of Linlin's potential. Streusen befriended Linlin using his Cook-Cook Fruit power to feed her and they began creating Linlin's ideal country. In the present, Bege, Vito, and Gotti fire their KX Launchers. However, their assassination attempt ends in failure as Big Mom's scream destroys the rockets before they could reach her. Caesar Clown brings in the escape mirror, but it is shattered by Big Mom's scream. Katakuri creates earplugs for his family and crew and the Big Mom Pirates proceed to surround the alliance.",
    "tf_idf_text": "launcher blast moment big mom assassinationtransliteration heiki sakuretsu biggu mamu ansatsu shunkan japanese yoshihiro ueda tomohiro nakayama may linlin cried carmels disappearance two people witness really happen one witness elbaf giant quickly flee back elbaf tell giant saw witness streusen decide take advantage linlins potential streusen befriend linlin use cookcook fruit power feed begin create linlins ideal country present bege vito gotti fire launcher however assassination attempt end failure big mom scream destroy rocket could reach caesar clown brings escape mirror shatter big mom scream katakuri create earplug family crew big mom pirate proceed surround alliance"
}