{
    "title": "841 59 \"Escape From the Tea Party! Luffy vs. Big Mom!\"Transliteration: \"Chakai Dasshutsu! Rufi VS Biggu Mamu\" (Japanese:茶会脱出!ルフィVSビガ·マム) Kōhei Kureta Kisa Miura June 17, 2018(2018-06-17)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_19",
    "transformers_text": "841 59 \"Escape From the Tea Party! Luffy vs. Big Mom!\"Transliteration: \"Chakai Dasshutsu! Rufi VS Biggu Mamu\" (Japanese:茶会脱出!ルフィVSビガ·マム) Kōhei Kureta Kisa Miura June 17, 2018(2018-06-17)\n\nAs Caesar carries Bege out of the venue, the Vinsmoke Family covers for them. During the scuffle, Big Mom knocks down Reiju, prompting Luffy and Sanji to leave Bege's body to defend her as Ichiji, Niji, and Yonji repel any Big Mom Pirate who goes after Caesar. When Du Feld tries to reclaim the Tamatebako, he's struck down by fellow Underwold emperor, Stussy, whose actullay a CP-\"Aigis\" 0 agent looking to claim the Tamatebako for the World Government. She makes sure that Morgans, the bird-man[5]president of the World Economy News Paper  who is spying on this exchange, will blame the theft on Feld in his newspaper in exchange for getting to see its contents. Unfortunately Du Fled's body pushes the Tamatebako off the roof. Luffy briefly clashes with Big Mom before retreating. As Big Mom starts chasing Luffy's group, Judge battles Big Mom but is quickly defeated.",
    "tf_idf_text": "escape tea party luffy big momtransliteration chakai dasshutsu rufi biggu mamu japanesevs khei kureta kisa miura june caesar carry bege venue vinsmoke family cover scuffle big mom knock reiju prompt luffy sanji leave beges body defend ichiji niji yonji repel big mom pirate go caesar feld try reclaim tamatebako he strike fellow underwold emperor stussy whose actullay cpaigis agent look claim tamatebako world government make sure morgan birdmanpresident world economy news paper spy exchange blame theft feld newspaper exchange get see content unfortunately fleds body push tamatebako roof luffy briefly clash big mom retreat big mom start chase luffys group judge battle big mom quickly defeat"
}