{
    "title": "870 88 \"A Fist of Divine Speed! Another Gear Four Application Activated!\"Transliteration: \"Shinsoku no Ken – Aratanaru Gia Fōsu Hatsudō!\" (Japanese:神速の拳 新たなるギア4発動！) Kōhei Kureta Shōji Yonemura January 27, 2019(2019-01-27)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_19",
    "transformers_text": "870 88 \"A Fist of Divine Speed! Another Gear Four Application Activated!\"Transliteration: \"Shinsoku no Ken – Aratanaru Gia Fōsu Hatsudō!\" (Japanese:神速の拳 新たなるギア4発動！) Kōhei Kureta Shōji Yonemura January 27, 2019(2019-01-27)\n\nLuffy activates Gear Fourth: Snakeman, a sleeker, less armored form of Bounceman, allows him to rapidly change their direction of his punches and increases their speed the longer their thrown. Katakuri responds by transforming into mochi and avoids them as he rolls toward Luffy in a donut-like shape. Upon reaching Luffy, Katakuri transforms back into his human body as he enlarges one of his forarms while covering it flaming Armament Haki-imbued spikes, and he slams it into Luffy in a move calledBuzz Cut Mochi. In addition to being injured, Luffy becomes stuck to the club, and Katakuri spins it around rapidly before slamming it into the ground, leaving Luffy at the bottom of a large crater. Sanji and Pudding make it to Cacao Island, and successfully sneak into Chocolat Town without anyone noticing. Back in the Mirro-World Luffy emerges from the crater, he and Katakuri engage in a massive duel leading to them preparing their final attacks. At the same time in Shakky's Rip-off Bar on the Sabaody Archipelago, Shakky wonders how Luffy was doing as she recalls Rayleigh once saying that only those who live in the present could shape a new era as Rayleigh reflects on his belief that Luffy will rise above any challenge. Back in the Mirror-World, Katakuri transforms into a mochi donut as he prepares to unleash theBuzz Cut Mochiagain, while Luffy moves his arm around his body and enlarges his fist for theGum-Gum King Cobra. Both attacks hit their mark, resulting in a tremendous clash that rumbles through the Mirro-World.",
    "tf_idf_text": "fist divine speed another gear four application activatedtransliteration shinsoku ken aratanaru gia fsu hatsud japanese khei kureta shji yonemura january luffy activates gear fourth snakeman sleeker less armored form bounceman allow rapidly change direction punch increase speed longer thrown katakuri respond transform mochi avoids roll toward luffy donutlike shape upon reach luffy katakuri transforms back human body enlarge one forarms cover flame armament hakiimbued spike slam luffy move calledbuzz cut mochi addition injure luffy becomes stick club katakuri spin around rapidly slam ground leave luffy bottom large crater sanji pudding make cacao island successfully sneak chocolat town without anyone notice back mirroworld luffy emerge crater katakuri engage massive duel lead prepare final attack time shakkys ripoff bar sabaody archipelago shakky wonder luffy recall rayleigh say live present could shape new era rayleigh reflect belief luffy rise challenge back mirrorworld katakuri transforms mochi donut prepares unleash thebuzz cut mochiagain luffy move arm around body enlarges fist thegumgum king cobra attack hit mark result tremendous clash rumble mirroworld"
}