{
    "title": "878 96 \"The World in Shock! The Fifth Emperor of the Sea Arrives!\"Transliteration: \"Sekai Kyōgaku – Dai Go no Umi no Kōtei Arawaru!\" (Japanese:世界驚愕　第五の海の皇帝現る！) Yutaka Nakashima Shōji Yonemura March 31, 2019(2019-03-31)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_19",
    "transformers_text": "878 96 \"The World in Shock! The Fifth Emperor of the Sea Arrives!\"Transliteration: \"Sekai Kyōgaku – Dai Go no Umi no Kōtei Arawaru!\" (Japanese:世界驚愕　第五の海の皇帝現る！) Yutaka Nakashima Shōji Yonemura March 31, 2019(2019-03-31)\n\nAt Foosha Village and an unnamed island in the New World, Makino and Shanks each remember Luffy's experiences with Shanks and the Red Hair Pirates 12 years ago as they read the newspaper story about Luffy's incursion into Totto Land. In the Ryugu Kingdom, Neptune and his family read the news as they prepare to head to the Reverie and decide to place Fish-Man Island under Luffy's protection. On the Thousand Sunny, Luffy discovers a Raid Suit canister secretly given to him and Sanji by Niji, but Sanji refuses to use it. Zues is shown to now be living in Nami's Clima-Tact. Carrot then shows the crew the newspaper, where they find out that Luffy and Sanji's bounties have increased, with Sanji initially happy that his bounty is now slightly higher than Zoro's, but becomes dismayed that his bounty now contains his family name while Luffy is now considered the Fifth Emperor of the Sea.",
    "tf_idf_text": "world shock fifth emperor sea arrivestransliteration sekai kygaku dai umi ktei arawaru japanese yutaka nakashima shji yonemura march foosha village unnamed island new world makino shank remember luffys experience shank red hair pirate year ago read newspaper story luffys incursion totto land ryugu kingdom neptune family read news prepare head reverie decide place fishman island luffys protection thousand sunny luffy discovers raid suit canister secretly give sanji niji sanji refuse use zues show live namis climatact carrot show crew newspaper find luffy sanjis bounty increase sanji initially happy bounty slightly high zoros become dismayed bounty contain family name luffy consider fifth emperor sea"
}