{
    "title": "en.wikipedia.org_wiki_Shinobi_Undercover",
    "url": "https://en.wikipedia.org/wiki/Shinobi_Undercover",
    "transformers_text": "Shinobi Undercover ( Japanese : しのびごと , Hepburn : Shinobigoto ) is a Japanese manga series written by Ippon Takegushi and illustrated by Santa Mitarashi. It began serialization in Shueisha 's Weekly Shōnen Jump magazine in September 2024, with its chapters collected in five volumes as of November 2025.\n\nYodaka is an extremely skilled shinobi who suffers from severe social anxiety. He is assigned to protect clumsy high school student, Aoi Mukai, who is being targeted by fugitive shinobi.\n\nYodaka must work to protect Aoi and overcome his poor social skills in order to give her the best high school student life.\n\nWritten by Ippon Takegushi and illustrated by Santa Mitarashi, the series began serialization in Shueisha 's Weekly Shōnen Jump magazine on September 17, 2024. [ 2 ] As of November 2025, the series' individual chapters have been collected into five tankōbon volumes. [ 3 ]\n\nViz Media and Manga Plus are publishing the series in English simultaneously with its Japanese release. [ 4 ]\n\nThree animated manga shorts were posted on the Weekly Shōnen Jump YouTube channel in December 2024. [ 5 ]\n\nThe following chapters have not yet been collected into tankobon format:\n\nThe series has been recommended by manga creators Shūichi Asō [ ja ] and Yūto Tsukuda [ ja ] . [ 11 ] [ 12 ] It was nominated for the 11th Next Manga Award in the print category in 2025, and was ranked eighth. [ 13 ] [ 14 ]\n\nJ.R. Waugh of Screen Rant described the manga as \"an authentic yet modern twist on ninja-themed manga\" and recommended it to fans of Naruto . [ 1 ]",
    "tf_idf_text": "shinobi undercover japanese hepburn shinobigoto japanese manga series write ippon takegushi illustrate santa mitarashi begin serialization shueisha weekly shnen jump magazine september chapter collect five volume november yodaka extremely skilled shinobi suffers severe social anxiety assign protect clumsy high school student aoi mukai target fugitive shinobi yodaka must work protect aoi overcome poor social skill order give best high school student life write ippon takegushi illustrate santa mitarashi series begin serialization shueisha weekly shnen jump magazine september november series individual chapter collect five tankbon volume viz medium manga plus publishing series english simultaneously japanese release three animate manga short post weekly shnen jump youtube channel december follow chapter not yet collect tankobon format series recommend manga creator shichi yto tsukuda nominate next manga award print category rank eighth waugh screen rant describe manga authentic yet modern twist ninjathemed manga recommend fan naruto"
}