{
    "title": "en.wikipedia.org_wiki_Template_talk_One_Piece",
    "url": "https://en.wikipedia.org/wiki/Template_talk:One_Piece",
    "transformers_text": "Ahem... Yes, I know their aweful... Lol. But that can be changed after Its been completed right? Angel Emfrbl 12:07, 23 July 2006 (UTC) [ reply ]\n\nFor the color scheme, perhaps making the top bar yellow, with the other bars being sky blue. The \"One Piece\" on the top bar will be dark blue, while the words on the other bars are orange. I don't know the codes for the colors, so can anyone else do this? Sigmasonic X 22:01, 24 July 2006 (UTC) [ reply ]\n\n[ General ] Cuttyflam 10:05, 25 July 2006 (UTC) [ reply ]\n\nI edited the template yesterday with some minor changes. Angel Emfrbl reverted it. Since I really don't want to start an edit-war, I've put it up for discussion. got Whiskey Peak, Little Garden, etc, etc. Like the original list on the old main page.\n\nA. Main Character to Straw Hat Pirates . Duh, they're the main characters.\n\nB. Editing Lucci and Spandam out, the entire CP9 in.\n\nC. Villians to Enemies . Buggy and Wapol can hardly be called evil. Neither does Gedatsu and some others, but that's D.\n\nD. Re-entering BW, CP9 and Skypiea's Priests in the Enemies part. Crocodile is merely the enemy in Arabasta, you've still got Little Garden and Whiskey Peak, both in which BW were the enemy, just not Croc. Like the original list, where you had \"Baroque Works, Sir Crocodile\", \"Skypeia's Priests, Eneru\" and just the CP9 near the end of the list.\n\nObjections?\n\nIf we include every enemy, it'll get quite crowded. Only the main villains should be included, just like how the Character List used to be. If you mean just putting, for example, Cipher Pol under the Villains section, then that would be pointless, because they are already under Other Factions. Sigmasonic X 01:25, 27 July 2006 (UTC) [ reply ]\n\nI'm not suggesting removal of the section, just slight modification. Hardly noticeable. Kurigiri 21:26, 27 July 2006 (UTC) [ reply ]\n\nPersonally, I think we should just have the leaders of the organizations in the \"Enemies\" section. Afterall, if we include \"Baroque Works\" along with \"Sir Crocodile\" there, why shouldn't we include \"Bellamy Pirates\" along with \"Bellamy\" and so on? I feel it would make the template too top heavy, so I think it would be best for the leader and the organization to be kept seperate. Or, alternatively, we could simply forgo the leaders' articles and place the crews in the \"Enemy\" section, though this would make the \"Pirate Crew\" section practically useless. Sigmasonic X 15:57, 30 July 2006 (UTC) [ reply ]\n\nThe edits I made to the Enemies section was only in order for it to match the original list from the past version of the main One Piece article. Still, because during the BW saga, croc is only the enemy in arabsta, and you've still got two islands without no enemy. Very not OP-like. Kurigiri 20:35, 30 July 2006 (UTC) [ reply ]\n\nI have a suggestion for the factions section... Why not have it:\n\nOr is this suggesting too much??? Angel Emfrbl 09:01, 27 July 2006 (UTC) [ reply ]\n\nWell I set up the basics of this page today so added it back in (can't say I'm proud of my effort... Because I didn't know how to approach it). Hmm... Everyone agree with it on whether its okay to replace that? It was removed previously. Angel Emfrbl 10:52, 27 July 2006 (UTC) [ reply ]\n\nAck! I'm trying to save a dozen pages related to One Piece now because someone stepped in. One of the changes he has noted is the size of the template compared to some of the pages. I don't think its worth going back to two different templates, so anyone any ideas how to strink this. Man all this is making my head spin thinking about it. Ideas anyone? >_<' Angel Emfrbl 12:55, 27 July 2006 (UTC) [ reply ]\n\nMost of the early translations are putting it down as '4 Emperors', so for now its what I can only write it as. Angel Emfrbl 10:13, 25 October 2006 (UTC) [ reply ]\n\nIs it really neccesary to have Garp's and Dragon's full name in the template? it's just spoilers. We could write just \"Garp\" and \"Dragon\". right? Kurigiri 22:07, 22 November 2006 (UTC) [ reply ]\n\nI wanted to bring up the idea of designs of new templates for the One Piece articles. The Templates look like this: Story Arcs , Related Articles , Factions , Characters . Each Navi Template has a link to the other Templates, and as you can see, are smaller and neater but still allow easy movement through the articles.\n\nAlso the change to the General will look like this; As you can see \"general\" has been split into five separate templates, each to be placed on the pages featured in the template. RecklessFire 21:31, 4 January 2007 (UTC) [ reply ]\n\nSunday I reverted the templates back to the orginal. Reason being is the same as the discussions we had a long time ago... Everyone prefers one single template (according to the discussion on the Main One Piece Talk Page).\n\nFor now though, the characters template has also been removed as per discussion on how to improve things. The characters now are only accessable on the main template via their factions pages. Then you can acess other characters by the Character Template. The trouble if we put the character back onto this template is that its likely to led to the same old \"template too big\" problem. In short we are going to have to accept things as they are until we can think up something better. Its sutiable have their links accessed via the factions pages, this is generally a standard and acceptable layout on other anime (or otherwise) wikipedia pages so we shouldn't have any problems with it here.\n\nOther changes include the removal of the sagas section. This was because they are gone now (deleted + merged into one article). Otherall, the template is now smaller and essentially a lot more suitable to wikipedia. The character template needs tweaking, we'll have a discussion on that later.\n\nAny further suggestions anyone has, feel free to bring them up. We can't touch the English adpations bit for now due to a cirrent discussion. Otherwise, this is the state of the template as of my signing this comment. Angel Emfrbl 09:46, 30 January 2007 (UTC) [ reply ]\n\nThe template does not appear to be displaying season 11 on my machine, despite clearing cache and giving the template a decent amount of time to update. じん ない 04:06, 10 January 2009 (UTC) [ reply ]\n\noi, season 10 is too big it needs to be broken up. Like at the archipelago arc on to the current episodes should be season 11, instead of merging it together with the thriller back arc - saiyo (November 13 2009)",
    "tf_idf_text": "ahem yes know aweful lol change complete right angel emfrbl july utc reply color scheme perhaps make top bar yellow bar sky blue one piece top bar dark blue word bar orange dont know cod color anyone else sigmasonic july utc reply general cuttyflam july utc reply edit template yesterday minor change angel emfrbl revert since really dont want start editwar ive put discussion get whiskey peak little garden etc etc like original list old main page main character straw hat pirate duh theyre main character edit lucci spandam entire villians enemy buggy wapol hardly call evil neither gedatsu others thats reentering skypieas priest enemy part crocodile merely enemy arabasta youve still get little garden whiskey peak enemy not croc like original list baroque work sir crocodile skypeias priest eneru near end list objection include every enemy itll get quite crowd main villain include like character list use mean put example cipher pol villain section would pointless already faction sigmasonic july utc reply not suggest removal section slight modification hardly noticeable kurigiri july utc reply personally think leader organization enemy section afterall include baroque work along sir crocodile shouldnt include bellamy pirate along bellamy feel would make template top heavy think would best leader organization keep seperate alternatively could simply forgo leader article place crew enemy section though would make pirate crew section practically useless sigmasonic july utc reply edits make enemy section order match original list past version main one piece article still saga croc enemy arabsta youve still get two island without enemy not oplike kurigiri july utc reply suggestion faction section not suggest much angel emfrbl july utc reply well set basic page today add back cant say proud effort didnt know approach hmm everyone agree whether okay replace remove previously angel emfrbl july utc reply ack try save dozen page relate one piece someone step one change note size template compare page dont think worth go back two different template anyone idea strink man make head spin think idea anyone angel emfrbl july utc reply early translation put emperor write angel emfrbl october utc reply really neccesary garps dragon full name template spoiler could write garp dragon right kurigiri november utc reply want bring idea design new template one piece article template look like story arcs related article faction character navi template link template see small neater still allow easy movement article also change general look like see general split five separate template place page feature template recklessfire january utc reply sunday revert template back orginal reason discussion long time ago everyone prefers one single template accord discussion main one piece talk page though character template also remove per discussion improve thing character accessable main template via faction page acess character character template trouble put character back onto template likely lead old template big problem short go accept thing think something well sutiable link access via faction page generally standard acceptable layout anime otherwise wikipedia page shouldnt problem change include removal sagas section go delete merge one article otherall template small essentially lot suitable wikipedia character template need tweak well discussion later suggestion anyone feel free bring cant touch english adpations bite due cirrent discussion otherwise state template sign comment angel emfrbl january utc reply template not appear display season machine despite clear cache give template decent amount time update january utc reply season big need break like archipelago arc current episode season instead merge together thriller back arc saiyo november"
}