{
    "title": "en.wikipedia.org_wiki_Zombiepowder.",
    "url": "https://en.wikipedia.org/wiki/Zombiepowder.",
    "transformers_text": "Zombiepowder. (stylized in all caps ) is a Japanese manga series written and illustrated by Tite Kubo . The manga ran in Shueisha 's shōnen manga magazine Weekly Shōnen Jump for 27 chapters from August 1999 to February 2000 before being canceled. The series was collected into four tankōbon volumes, released the following year. Zombiepowder. is distributed in North America by Viz Media , who licensed it in 2005. Although critical reception in the United States was largely mediocre, the series achieved moderate commercial success in the western market due to the prominence Kubo had achieved by that point for his second manga series, Bleach .\n\nZombiepowder. follows a teenaged boy named Elwood Shepherd, who joins with mysterious criminals Gamma Akutabi and C.T. Smith in their search for the Rings of the Dead. These rings are a group of legendary artifacts with the power to resurrect the dead and grant immortality to anyone who collects 12 of them. The series has a Weird West setting which mixes a background of sparsely populated frontier settlements and gunslinger aesthetics with modern conveniences, occult magic, supernatural martial arts, and mad science. The trio travel from town to town in this world, fighting other criminals for possession of the Rings of the Dead. The protagonists obtain three of the rings in the course of the story, but due to the series' cancellation, the eventual success or failure of their quest is unknown.\n\nThe series was a commercial failure in Japan but has been successful in the United States. Critical consensus is that Zombiepowder. was a technically proficient manga, but one which lacked the originality necessary to bear intrinsic appeal to most readers, which accounted for its cancellation. Additionally, the series was heavily focused on battles even by the standards of action manga, though whether this was a positive or negative trait is a matter of contention. Due to these factors, combined with its abrupt and unsatisfactory ending, critics hold that Zombiepowder. is significant primarily as a chapter in the career of its author, and would otherwise be a footnote which found an audience only among fans of violent action.\n\nZombiepowder. is set within a western-themed environment with inconsistent levels of technology, similar to that found in Yasuhiro Nightow 's manga series, Trigun . [ 2 ] [ 3 ] The most prominent characters in the series are Powder Hunters, individuals who seek the titular Zombie Powder, a life-giving substance that can imbue an individual with limitless life force , capable of granting immortality and even raising people back from the dead. Zombie Powder can only be obtained from the Rings of the Dead, dangerous magical artifacts that (individually) devour the vitality of anyone they touch, rendering them comatose; this stolen life energy is converted into the Zombie Powder, which can only be extracted if twelve Rings of the Dead are brought together.\n\nThe story begins with young pickpocket , John Elwood Shepherd befriending Powder Hunter, Gamma Akutabi after a botched attempt to rob him. It also turns out Gamma is a highly wanted fugitive in possession of a Ring of the Dead; because of this, when another member of the local gang Elwood is working sees them together, he assumes that Elwood's harboring him in hopes of turning him over for his bounty. The gang attacks Elwood's home, and Gamma comes to the rescue, but not before Elwood's sister, Sheryl, is killed by the gang's leader. Following the gang's assault, Elwood decides to accompany Gamma in his powder hunting in hopes of resurrecting Sheryl.\n\nAfter leaving Elwood's hometown, the pair meet up with Gamma's long-time partner C.T. Smith, another Powder Hunter who's also wanted. Smith has infiltrated the ranks of Ash Daughter, a gang which has found a Ring of the Dead. The three challenge the gang's leader, Ranewater Calder, and Gamma slays him using his mastery of the fictional sword art karin zanjutsu , which involves the user channeling their own bloodlust and manifesting it as pyrokinesis . Elwood, Gamma, and Smith thereby gain a second Ring of the Dead, concluding the first arc and volume of the series.\n\nThe remaining three volumes concern themselves with the battle for a third ring, which has been embedded for years in the body of a comatose young man named Emilio Lufas Getto. Gamma and company learn of Emilio's existence from his sister, Wolfina, a tabloid photojournalist and vigilante who does not believe in the Rings of the Dead. The group of hunters offer to restore Emilio to consciousness in exchange for the ring he contains. Before they can do so, however, Emilio is kidnapped by Balmunk the Mystic, a powder hunting magician who leads a circus-themed gang. Wolfina teams up with Elwood, Gamma, and Smith to retrieve Emilio, and they succeed in doing so after a number of battles with Balmunk's henchmen. The conflict culminates in a fight between Gamma and a giant golem summoned by Balmunk, which Gamma defeats with the help of a berserk state. Balmunk is beaten but not killed, and departs whilst swearing revenge upon Gamma.\n\nAfter rescuing Emilio, Gamma arranges to have the Ring of the Dead removed from his body by an old friend, mad scientist Nazna Gemini. The characters are brought to Gemini's lab by Angelle Cooney, a young girl with the power of teleportation . Once there, Gemini agrees to operate to remove the ring from Emilio in exchange for a year of experimentation rights on Wolfina.\n\nDue to the series' early cancellation, Zombiepowder. is ended without a solid conclusion, the final chapter showing Gamma and Smith leaving Elwood and Wolfina behind as they depart the Gemini Laboratory, whose staff have just begun the operation to save Emilio. It is left ambiguous whether Elwood chooses to follow Gamma and Smith, stay with Wolfina and Emilio, or become a Powder Hunter in his own right.\n\nAccording to Tite Kubo, Zombiepowder. originated as an idea for a samurai manga which would have been titled \"Samurai Drive.\" This initial conception of the story had very little in common with the end product, as it did not feature western elements or the titular zombie powder. It did star a version of Gamma, however, who still bore an over-sized sword and bounty, and featured scifi technologies. [ 7 ] With respect to the premise of Zombiepowder. , the author stated that the theme was fighting, and a world where the hope for resurrection lay not in god, but obtaining a mysterious substance. [ 41 ] Tite Kubo did not comment on his influences for the series, but critic Theron Martin believed its tone, setting, and style drew heavily on the cyberpunk manga Battle Angel Alita , the dark fantasy manga Berserk , and fellow sci-fi/western manga Trigun , [ 2 ] and A.E. Sparrow of IGN noted the obligatory genre influence of martial arts anime Dragon Ball Z . [ 14 ] The series also borrows terminology from the music industry, referring to each chapter as a track , the bonus omake content in each volume as B-Sides , and naming primary character Elwood after a record label founder. [ 4 ]\n\nZombiepowder. began serialization in Shueisha 's Weekly Shōnen Jump on August 2, 1999, and ran a brief 27 chapters before being canceled on February 28, 2000. [ 42 ] According to the author's commentary in the cover leaf of the third volume, Tite Kubo was in a state of severe emotional trauma when he wrote it, and only began to be happy with the quality of the series as it neared its ending. [ 43 ] Speaking retrospectively 12 years later, Kubo stated that he was not yet used to the scheduling pressures of weekly serialization when he wrote Zombiepowder. , and that at the time he paid too much attention to his editor's comments rather than trusting his own ideas. [ 44 ] Other than Tite Kubo, Zombiepowder. had five credited staff, though their exact roles in its production were never specified. [ 45 ]\n\nThe series was collected into four volumes, published in 2000 in Japan. [ 46 ] [ 47 ] Zombiepowder. was licensed for English distribution by Viz Media in 2005, following the success of Tite Kubo's second manga series, Bleach . [ 48 ] The first English volume was released in the United States in September 2006, and the last was released in June 2007. [ 49 ] [ 50 ] A French-language edition began publication through Tonkam in 2013. [ 51 ]\n\nThe Viz Media releases preserve the Japanese reading order and overlay the visual sound effects with equivalent English text. The English lettering was criticized for being overly large, which Anime News Network thought made the characters appear to be shouting at inappropriate moments. [ 2 ] There are several additional differences between the Japanese and English volume releases of Zombiepowder. . The cover of the second manga volume, which featured an illustration of C.T. Smith holding a gun to his own head, was replaced in the English edition with new art of Gamma in sunglasses. [ 52 ] [ 53 ] The English editions of volumes 2–4 also each contain a one-shot story from early in Kubo's career, which were not present in the Japanese collections: Ultra Unholy Hearted Machine , Rune Master Urara , and Bad Shield United , respectively. [ 53 ] [ 54 ] [ 50 ] These extra stories were included for two apparent reasons: to further appeal to Zombiepowder. ' s primary English-speaking audience of Bleach fans interested in the development of Tite Kubo's style, and to expand the length of the later volumes, which would otherwise have been shorter than Viz's normal releases, to standard pagecounts. [ 29 ]\n\nZombiepowder. sold modestly in Japan, but has been commercially successful in the United States. The second volume placed in the top 100 graphic novels for Christmas 2006. [ 56 ] Theron Martin of Anime News Network believed the series could have achieved some success in the United States without the Bleach connection due to the American market's larger appetite for series which focus on violent action, but that the series was heavily buoyed by Bleach ' s international popularity, [ 2 ] and primarily imported for an audience of \"Kubo completists [ sic ].\" [ 29 ]\n\nCritical reception of Zombiepowder. as a whole mostly deemed it mediocre and average. Two reviews from Anime News Network ranked it as a C, [ 2 ] [ 29 ] it received a C+ review from MangaCast, [ 21 ] a Den of Geek review gave it 3/5 stars, [ 22 ] and an IGN review concluded it was \"no better or worse that [ sic ] many other shōnen titles\" with \"not much to separate it from the massive stock of shōnen series that are similar to it.\" [ 14 ] Jason Thompson included it in a list of \"mediocre\" shōnen action titles whose clichéd nature and \"ripped-off\" character designs left them interesting only to readers unacquainted with the tropes of the genre. [ 57 ] The universal criticism in these reviews is that the series as a whole lacks originality, with most mentioning that it reads very much like the author's first effort it is, and would therefore appeal mostly to fans of the author. [ 2 ] [ 3 ] [ 14 ] [ 21 ] [ 22 ] [ 29 ] While he echoed most individual criticisms of the English-language reviewers, a divergent conclusion was reached by Russian critic Alexander Gorban of Animemaniacs Magazine Online , who believes that Zombiepowder. ' s fundamentals were all strong, and that the failure of the series in Japan was instead due to Tite Kubo's overreach in publishing a series in the highly-competitive Weekly Shōnen Jump at such a young age. Had the freshman author been serialized in a less prominent magazine, asserts Gorban, Zombiepowder. would have been allowed longer to establish itself and could have developed into a series at least as good as Bleach . [ 3 ]\n\nReception for individual elements of Zombiepowder. was more mixed. The series premise of seeking magical items was criticized as cliche by ANN and IGN, [ 2 ] [ 14 ] but deemed sufficient for the needs of the story by AMO, [ 3 ] and the parasitic nature of the rings and zombie powder themselves were complimented by MangaCast and IGN for lending suspense to the plot. [ 14 ] [ 21 ] The setting was criticized by ANN and Gorban alike for not having much effort put into it, being too similar to Trigun , and seeming to be chosen just for the sake of coolness, [ 2 ] [ 3 ] while IGN liked the mixture of the old west, arcane, and technological. [ 14 ] The quality of individual characters in the series was again considered a mixed bag, both in artistic design and characterization, but with a consensus across reviews that the characters were not developed much beyond their respective tropes. [ 2 ] [ 3 ] [ 14 ] [ 21 ] [ 29 ] [ 57 ]\n\nOf all the elements of the series, Zombiepowder. ' s action sequences received the most feedback. The battle scenes were criticized for their unsophisticated art by Anime News Network , with rough drawings and few backgrounds, [ 2 ] though in its second review ANN noted a guiding philosophy to the background omission: elements of the scene which were not props in the fight faded out whenever action began. [ 29 ] ANN also said that the action was entertainingly violent, kinetic, well-paced, easy to follow, and interspersed well with comedic moments. They ultimately concluded the action was handled better than average, but with the disclaimer that the action was \"the entire sum and substance\" of the series. [ 2 ] [ 29 ] IGN opened their review with a Tite Kubo quote from the first volume's flap: \"The theme is fighting. Sitting there and just reading it without thinking is fine. But if you ever feel like it please try to use your mind as you read,\" [ 41 ] and said that if this advice was taken Zombiepowder. could be a \"great shōnen tale\", but that without it the story was only enjoyable by dissection and comparison to other series. [ 14 ] Gorban's view was again the most positive, stating that the essential trait of a memorable fight scene is to pit two charismatic figures with contrasting personalities and combat styles against each other, and that the series grasped this notion admirably. [ 3 ] Finally, Den of Geek found Zombiepowder. ' s \"wall-to-wall\" action sequences colorful and fun, but complained that the sheer mass of them overwhelmed the rest of the story. [ 22 ]",
    "tf_idf_text": "zombiepowder stylize cap japanese manga series write illustrated tite kubo manga run shueisha shnen manga magazine weekly shnen jump chapter august february cancel series collect four tankbon volume release follow year zombiepowder distribute north america viz medium license although critical reception united state largely mediocre series achieve moderate commercial success western market due prominence kubo achieve point second manga series bleach zombiepowder follow teenaged boy name elwood shepherd join mysterious criminal gamma akutabi smith search ring dead ring group legendary artifact power resurrect dead grant immortality anyone collect series weird west set mix background sparsely populate frontier settlement gunslinger aesthetic modern convenience occult magic supernatural martial art mad science trio travel town town world fight criminal possession ring dead protagonist obtain three ring course story due series cancellation eventual success failure quest unknown series commercial failure japan successful united state critical consensus zombiepowder technically proficient manga one lack originality necessary bear intrinsic appeal reader account cancellation additionally series heavily focus battle even standard action manga though whether positive negative trait matter contention due factor combine abrupt unsatisfactory end critic hold zombiepowder significant primarily chapter career author would otherwise footnote find audience among fan violent action zombiepowder set within westernthemed environment inconsistent level technology similar find yasuhiro nightow manga series trigun prominent character series powder hunter individual seek titular zombie powder lifegiving substance imbue individual limitless life force capable grant immortality even raise people back dead zombie powder obtain ring dead dangerous magical artifact individually devour vitality anyone touch render comatose steal life energy convert zombie powder extract twelve ring dead bring together story begin young pickpocket john elwood shepherd befriend powder hunter gamma akutabi botch attempt rob also turn gamma highly want fugitive possession ring dead another member local gang elwood work see together assume elwoods harbor hope turn bounty gang attack elwoods home gamma come rescue not elwoods sister sheryl kill gang leader follow gang assault elwood decides accompany gamma powder hunt hope resurrect sheryl leave elwoods hometown pair meet gammas longtime partner smith another powder hunter who also want smith infiltrated rank ash daughter gang find ring dead three challenge gang leader ranewater calder gamma slays use mastery fictional sword art karin zanjutsu involve user channel bloodlust manifest pyrokinesis elwood gamma smith thereby gain second ring dead conclude first arc volume series remain three volume concern battle third ring embed year body comatose young man name emilio lufas getto gamma company learn emilios existence sister wolfina tabloid photojournalist vigilante not believe ring dead group hunter offer restore emilio consciousness exchange ring contains however emilio kidnap balmunk mystic powder hunt magician lead circusthemed gang wolfina team elwood gamma smith retrieve emilio succeed number battle balmunks henchman conflict culminates fight gamma giant golem summon balmunk gamma defeat help berserk state balmunk beat not kill departs whilst swear revenge upon gamma rescue emilio gamma arranges ring dead remove body old friend mad scientist nazna gemini character bring gemini lab angelle cooney young girl power teleportation gemini agree operate remove ring emilio exchange year experimentation right wolfina due series early cancellation zombiepowder end without solid conclusion final chapter show gamma smith leave elwood wolfina behind depart gemini laboratory whose staff begin operation save emilio leave ambiguous whether elwood chooses follow gamma smith stay wolfina emilio become powder hunter right accord tite kubo zombiepowder originate idea samurai manga would title samurai drive initial conception story little common end product not feature western element titular zombie powder star version gamma however still bore oversized sword bounty feature scifi technology respect premise zombiepowder author state theme fight world hope resurrection lay not god obtain mysterious substance tite kubo not comment influence series critic theron martin believe tone setting style draw heavily cyberpunk manga battle angel alita dark fantasy manga berserk fellow scifiwestern manga trigun sparrow ign note obligatory genre influence martial art anime dragon ball series also borrow terminology music industry refer chapter track bonus omake content volume bsides name primary character elwood record label founder zombiepowder begin serialization shueisha weekly shnen jump august run brief chapter cancel february accord author commentary cover leaf third volume tite kubo state severe emotional trauma write begin happy quality series near end speak retrospectively year later kubo state not yet use scheduling pressure weekly serialization write zombiepowder time pay much attention editor comment rather trust idea tite kubo zombiepowder five credited staff though exact role production never specify series collect four volume publish japan zombiepowder license english distribution viz medium follow success tite kubos second manga series bleach first english volume release united state september last release june frenchlanguage edition begin publication tonkam viz medium release preserve japanese reading order overlay visual sound effect equivalent english text english letter criticize overly large anime news network think make character appear shout inappropriate moment several additional difference japanese english volume release zombiepowder cover second manga volume feature illustration smith hold gun head replace english edition new art gamma sunglasses english edition volume also contain oneshot story early kubos career not present japanese collection ultra unholy hearted machine rune master urara bad shield unite respectively extra story include two apparent reason appeal zombiepowder primary englishspeaking audience bleach fan interested development tite kubos style expand length later volumes would otherwise short vizs normal release standard pagecounts zombiepowder sell modestly japan commercially successful united state second volume place top graphic novel christmas theron martin anime news network believe series could achieve success united state without bleach connection due american market large appetite series focus violent action series heavily buoy bleach international popularity primarily import audience kubo completists sic critical reception zombiepowder whole mostly deem mediocre average two review anime news network rank receive review mangacast den geek review give star ign review conclude good bad sic many shnen title not much separate massive stock shnen series similar jason thompson include list mediocre shnen action title whose clichd nature rippedoff character design leave interesting reader unacquainted trope genre universal criticism review series whole lack originality mention read much like author first effort would therefore appeal mostly fan author echo individual criticism englishlanguage reviewer divergent conclusion reach russian critic alexander gorban animemaniacs magazine online believe zombiepowder fundamental strong failure series japan instead due tite kubos overreach publish series highlycompetitive weekly shnen jump young age freshman author serialize less prominent magazine assert gorban zombiepowder would allow long establish could develop series least good bleach reception individual element zombiepowder mixed series premise seek magical item criticize cliche ann ign deem sufficient need story amo parasitic nature ring zombie powder compliment mangacast ign lending suspense plot set criticize ann gorban alike not much effort put similar trigun seem chosen sake coolness ign like mixture old west arcane technological quality individual character series consider mixed bag artistic design characterization consensus across review character not develop much beyond respective trope element series zombiepowder action sequence receive feedback battle scene criticize unsophisticated art anime news network rough drawing background though second review ann note guide philosophy background omission element scene not props fight fade whenever action begin ann also say action entertainingly violent kinetic wellpaced easy follow intersperse well comedic moment ultimately conclude action handle well average disclaimer action entire sum substance series ign open review tite kubo quote first volumes flap theme fight sit read without think fine ever feel like please try use mind read say advice take zombiepowder could great shnen tale without story enjoyable dissection comparison series gorbans view positive state essential trait memorable fight scene pit two charismatic figure contrast personality combat style series grasp notion admirably finally den geek find zombiepowder walltowall action sequence colorful fun complain sheer mass overwhelm rest story"
}