{
    "title": "en.wikipedia.org_wiki_SFGate",
    "url": "https://en.wikipedia.org/wiki/SFGate",
    "transformers_text": "SFGate is a news website based in San Francisco , California, covering news, culture, travel, food, politics and sports in the San Francisco Bay Area , Hawaii and California.\n\nLaunched on November 3, 1994, as The Gate in the wake of an eleven-day newspaper strike , [ 1 ] and renamed SFGate in 1998, the site once served as the digital home of the San Francisco Chronicle . [ 2 ] [ 3 ] Hearst Newspapers bought the site and SF Chronicle in the early 2000s. [ 4 ] [ 5 ] [ 3 ] SFGate and the San Francisco Chronicle split into two separate newsrooms in 2019, with independent editorial staff. [ 6 ] Grant Marek took over as editor-in-chief in 2019. [ 7 ] At the time SFGate split from the Chronicle in 2019, it had only 21 staff members. [ 8 ] By 2021, the SFGate newsroom consisted of about 40 staff, including Drew Magary and Rod Benson . [ 9 ]\n\nBy 2025, SFGate had grown to 60 employees, with half of them working remotely in 23 different cities and claimed that it was now \"the largest news site on the entire West Coast\". [ 8 ] [ 3 ] Press Gazette profiled SFGate in 2025, describing it as the largest website dedicated to local news in the United States that tends to focus on the more popular tourist destinations in California and for Californians from National Parks to Disneyland to Hawaii. [ 3 ]\n\nIn 2010, SFGate won the Pulitzer Prize for Editorial Cartooning for Mark Fiore 's cartoons, marking the first time the award had been given to work not appearing in print. [ 10 ] [ 11 ]\n\nSince 2019, the site won awards from the San Francisco Press Club , North American Travel Journalists Association , and Society of American Travel Writers Lowell Thomas. [ 3 ]",
    "tf_idf_text": "sfgate news website base san francisco california cover news culture travel food politics sport san francisco bay area hawaii california launch november gate wake elevenday newspaper strike rename sfgate site serve digital home san francisco chronicle hearst newspaper buy site chronicle early sfgate san francisco chronicle split two separate newsroom independent editorial staff grant marek take editorinchief time sfgate split chronicle staff member sfgate newsroom consisted staff include draw magary rod benson sfgate grown employee half work remotely different city claim large news site entire west coast press gazette profile sfgate describe large website dedicate local news united state tend focus popular tourist destination california californian national park disneyland hawaii sfgate pulitzer prize editorial cartoon mark fiore cartoon mark first time award give work not appear print since site award san francisco press club north american travel journalist association society american travel writer lowell thomas"
}