{
    "title": "en.wikipedia.org_wiki_One_Piece__Burning_Blood",
    "url": "https://en.wikipedia.org/wiki/One_Piece:_Burning_Blood",
    "transformers_text": "One Piece: Burning Blood [ a ] is a fighting video game developed by Spike Chunsoft and published by Bandai Namco Entertainment . Based on the One Piece franchise, it was released for PlayStation 4 , PlayStation Vita , Xbox One , and Windows . It is the first One Piece video game to be released on an Xbox video game console. It was released in Japan on April 21, 2016, in North America on May 31, 2016, and in Europe on June 3, 2016. The Windows version was released in North America on September 1, 2016, and in Europe on September 2, 2016. The game was not released for Xbox One in Japan.\n\nOne Piece: Burning Blood is a fighting game, which features a cel-shaded artstyle, similar to the One Piece anime. [ 1 ] The game also features an \"advanced battle system\", which allows players to perform stronger attacks and block normal attacks from enemies. [ 2 ] Similar to the Grand Battle! series, Burning Blood is a 1-on-1 (and up to 9 vs 9) fighting game. It focuses on fighting as well as devil fruit abilities, with Logia users being able to use their powers to avoid damage.\n\nOn September 8, 2015, publisher Bandai Namco Entertainment trademarked three names, one of which is Burning Blood . [ 3 ] The game was officially announced at Sony Computer Entertainment Japan Asia's Tokyo Game Show 2015 press conference. [ 4 ]\n\nThe game debuted at number one of the Japanese sales charts, with 35,496 copies sold on PS4 and 32,682 sold on PS Vita in its first week in Japan. [ 8 ] In four weeks PS4 and PS Vita versions sold 104,120 units in Japan. [ 9 ]\n\nIt currently holds an aggregated score of 66 on Metacritic , indicating \"mixed or average reviews\", based on 45 reviews. [ 5 ] IGN awarded it a score of 6.5 out of 10, saying \"One Piece: Burning Blood is a bit too much for the uninitiated, and a bit too little for One Piece stalwarts.\" [ 10 ] Destructoid awarded it 5.5 out of 10, saying \" The combat here just isn't that fun, and no amount of colorful anime action will change that.\" [ 11 ] Hardcore Gamer awarded it a score of 3 out of five, saying, \" One Piece: Burning Blood is one of those middle of the road games that makes game reviewers weep...Neither good nor bad, it exists.\" [ 12 ] Famitsu awarded it four scores of 8 out of 10, which equaled an overall score of 32/40. [ 13 ]",
    "tf_idf_text": "one piece burn blood fight video game develop spike chunsoft publish bandai namco entertainment base one piece franchise release playstation playstation vita xbox one window first one piece video game release xbox video game console release japan april north america may europe june window version release north america september europe september game not release xbox one japan one piece burn blood fight game feature celshaded artstyle similar one piece anime game also feature advanced battle system allow player perform strong attack block normal attack enemy similar grand battle series burn blood fight game focus fight well devil fruit ability logia user able use power avoid damage september publisher bandai namco entertainment trademark three name one burn blood game officially announce sony computer entertainment japan asias tokyo game show press conference game debut number one japanese sale chart copy sell sell vita first week japan four week vita version sell unit japan currently hold aggregate score metacritic indicate mixed average review base review ign award score say one piece burn blood bit much uninitiated bit little one piece stalwarts destructoid award say combat isnt fun amount colorful anime action change hardcore gamer award score five say one piece burn blood one middle road game make game reviewer weepneither good nor bad exists famitsu award four score equal overall score"
}