{
    "title": "en.wikipedia.org_wiki_LabX_Media_Group",
    "url": "https://en.wikipedia.org/wiki/LabX_Media_Group",
    "transformers_text": "LabX Media Group is an Ontario-based media and technology company focused on the biological research community. [ 1 ] Founded in 1995 as an online marketplace for laboratory equipment, it has grown through various acquisitions to now have a presence in publishing and laboratory services. [ 2 ]\n\nLabX Media Group operates under a number of different brands representing different industries. The company was originally founded as LabX, an online marketplace for laboratory products.\n\n1DegreeBio, an online marketplace for life sciences products, was founded in 2009 as an independent company, but was acquired by LabX Media Group in 2016. [ 3 ]\n\nLabWrench.com, an online forum for discussing laboratory equipment, was started by LabX Media Group in 2010 and is now partially integrated into the LabX marketplace. [ 4 ]\n\nThe other major arm of LabX Media Group's brands is science publishing .\n\nLab Manager Magazine (acquired in 2008) is a trade journal for research lab managers. [ 4 ] The Scientist (magazine) (acquired in 2011) is a professional magazine targeted towards life science researchers, with articles on current biology research. [ 4 ]\n\nIn 2016, LabX Media Group acquired UK-based Technology Networks, another trade journal targeted towards research scientists. [ 2 ]\n\nIn 2020, LabX Media Group acquired IFLScience , [ 2 ] a popular science website founded by Elise Andrew .\n\nIn 2024, LabX Media acquired Discover Magazine from Kalmbach Media [ 5 ]",
    "tf_idf_text": "labx medium group ontariobased medium technology company focus biological research community found online marketplace laboratory equipment grow various acquisition presence publish laboratory service labx medium group operate number different brand represent different industry company originally found labx online marketplace laboratory product degreebio online marketplace life science product found independent company acquire labx medium group labwrenchcom online forum discuss laboratory equipment start labx medium group partially integrate labx marketplace major arm labx medium group brand science publish lab manager magazine acquire trade journal research lab manager scientist magazine acquire professional magazine target towards life science researcher article current biology research labx medium group acquire ukbased technology network another trade journal target towards research scientist labx medium group acquire iflscience popular science website found elise andrew labx medium acquire discover magazine kalmbach medium"
}