{
    "title": "en.wikipedia.org_wiki_Drosophila_melanogaster",
    "url": "https://en.wikipedia.org/wiki/Drosophila_melanogaster",
    "transformers_text": "Drosophila melanogaster is a species of fly (an insect of the order Diptera) in the family Drosophilidae . The species is often referred to as the fruit fly or lesser fruit fly , or less commonly the \" vinegar fly\", \" pomace fly\", [ a ] [ 5 ] or \" banana fly\". [ 6 ] In the wild, D. melanogaster are attracted to rotting fruit and fermenting beverages, and they are often found in orchards, kitchens and pubs.\n\nStarting with Charles W. Woodworth 's 1901 proposal of the use of this species as a model organism , [ 7 ] [ 8 ] D. melanogaster continues to be widely used for biological research in genetics , physiology , microbial pathogenesis , and life history evolution . In 1946 D. melanogaster was the first animal to be launched into space . [ 9 ] As of 2017, six Nobel Prizes have been awarded to drosophilists for their work using the insect. [ 10 ] [ 11 ]\n\nDrosophila melanogaster is typically used in research owing to its rapid life cycle, relatively simple genetics with only four pairs of chromosomes , and large number of offspring per generation. [ 12 ] It was originally an African species, with all non-African lineages having a common origin. [ 13 ] Its geographic range includes all continents, including islands. [ 14 ] D. melanogaster is a common pest in homes, restaurants, and other places where food is served. [ 15 ]\n\nFlies belonging to the family Tephritidae are also called \"fruit flies\". This can cause confusion, especially in the Mediterranean, Australia , and South Africa , where the Mediterranean fruit fly Ceratitis capitata is an economic pest.\n\nThe term \" Drosophila \", meaning \"dew-loving\", is a modern scientific Latin adaptation from Greek words δρόσος , drósos , \" dew \", and φιλία , philía , \"lover\". The term \" melanogaster \" meaning \"black-belly\", comes from Ancient Greek μέλας , mélas , \"black\", and γᾰστήρ , gastḗr , \"belly\". [ citation needed ]\n\nWild type fruit flies are yellow-brown, with brick-red eyes and transverse black rings across the abdomen.\n\nThe fly's body is divided into three main parts: head, thorax , and abdomen. The head is relatively round and features large, prominent red compound eyes. These eyes are made up of hundreds of ommatidia and occupy most of the head's surface. The brick-red color of the eyes of the wild type fly are due to two pigments: xanthommatin, which is brown and is derived from tryptophan , and drosopterins, which are red and are derived from guanosine triphosphate . [ 16 ] Between the eyes are short antennae , which look like tiny feathery or bristled projections and are used for detecting odors, air currents, and vibrations. [ 17 ] Drosophila also has bristles —short, stiff hairs—distributed across the head and body, which are useful for tactile sensing.\n\nThe thorax is robust and bears three pairs of legs and one pair of wings. The wings are clear and membranous, with fine veins visible, and span approximately 4 mm. [ 18 ] They are held flat over the back when the fly is at rest. Just behind the wings are small knob-like structures called halteres , which are modified hindwings. These help the fly maintain balance and orientation in flight. [ 19 ]\n\nThe drosophila leg is composed of five leg segments: the coxa, trochanter, femur, tibia, and tarsus. They have five tarsal segments in their tarsus, ending with the fly foot which has multiple structures including the claw and adhesive structures. The pulvillus , a flexible elongated structure underneath the claw, and setae , hair-like structures that are spatula-shaped and inset the pulvilli are the main attachment devices used by D. melanogaster . Although their claws may be used for attachment onto rough surfaces. [ 20 ] Males also have sex combs located on the first tarsal segment, which are tiny bristle-like structures on their front legs, used to attach to females during mating. Extensive images are found at FlyBase . [ 21 ]\n\nThe abdomen is segmented and tapers toward the end. It often appears striped, with alternating bands of light and dark pigmentation. In males, the abdomen is typically darker and more rounded, while females have a more pointed and striped abdomen. The black portions of the abdomen are the inspiration for the species name ( melanogaster = \"black-bellied\" ).\n\nThey exhibit sexual dimorphism ; females are about 2.5 mm (0.10 in) long, while males are slightly smaller. Females have bodies that are up to 30% larger than an adult male. [ 22 ] [ 23 ] Unlike humans , the sex and physical appearance of fruit flies is not influenced by hormones . [ 24 ] The appearance and sex of fruit flies is determined only by genetic information. [ 24 ]\n\nDrosophila melanogaster can be distinguished from related species by the following combination of features: gena ~1/10 diameter of eye at greatest vertical height; wing hyaline and with costal index 2.4; male protarsus with a single row of ~12 setae forming a sex comb; male epandrial posterior lobe small and nearly triangular; female abdominal tergite 6 with dark band running to its ventral margin; female oviscapt small, pale, without dorsodistal depression and with 12–13 peg-like outer ovisensilla. [ 25 ] [ 26 ]\n\nUnder optimal growth conditions at 25 °C (77 °F), the D. melanogaster lifespan is about 50 days from egg to death. [ 27 ] The developmental period for D. melanogaster varies with temperature, as with many ectothermic species. The shortest development time (egg to adult), seven days, is achieved at 28 °C (82 °F). [ 28 ] [ 29 ] Development times increase at higher temperatures (11 days at 30 °C or 86 °F) due to heat stress. Under ideal conditions, the development time at 25 °C (77 °F) is 8 + 1 ⁄ 2 days, [ 28 ] [ 29 ] [ 30 ] at 18 °C (64 °F) it takes 19 days [ 28 ] [ 29 ] and at 12 °C (54 °F) it takes over 50 days. [ 28 ] [ 29 ] Under crowded conditions, development time increases, [ 31 ] while the emerging flies are smaller. [ 31 ] [ 32 ] Females lay some 400 eggs (embryos), about five at a time, into rotting fruit or other suitable material such as decaying mushrooms and sap fluxes . Drosophila melanogaster is a holometabolous insect, so it undergoes a full metamorphosis.\n\nTheir life cycle is broken down into four stages: embryo, larva, pupa, adult. [ 33 ] The eggs, which are about 0.5 mm long, hatch after 12–15 hours (at 25 °C or 77 °F). [ 28 ] [ 29 ] The resulting larvae grow for about four days (at 25 °C) while molting twice (into second- and third-instar larvae), at about 24 and 48 hours after hatching. [ 28 ] [ 29 ] During this time, they feed on the microorganisms that decompose the fruit, as well as on the sugar of the fruit itself. The mother puts feces on the egg sacs to establish the same microbial composition in the larvae's guts that has worked positively for herself. [ 34 ] Then the larvae encapsulate in the puparium and undergo a four-day-long metamorphosis (at 25 °C), after which the adults eclose (emerge). [ 28 ] [ 29 ]\n\nMales perform a sequence of five behavioral patterns to court females. First, males orient themselves while playing a courtship song by horizontally extending and vibrating their wings. Soon after, the male positions himself at the rear of the female's abdomen in a low posture to tap and lick the female genitalia. Finally, the male curls his abdomen and attempts copulation. Females can reject males by moving away, kicking, and extruding their ovipositor. [ 35 ] Copulation lasts around 15–20 minutes, [ 36 ] during which males transfer a few hundred, very long (1.76 mm) sperm cells in seminal fluid to the female. [ 37 ] Females store the sperm in a tubular receptacle and in two mushroom-shaped spermathecae ; sperm from multiple matings compete for fertilization. A last male precedence is believed to exist; the last male to mate with a female sires about 80% of her offspring.\n\nThis precedence was found to occur through both displacement and incapacitation. [ 38 ] The displacement is attributed to sperm handling by the female fly as multiple matings are conducted and is most significant during the first 1–2 days after copulation. Displacement from the seminal receptacle is more significant than displacement from the spermathecae. [ 38 ] Incapacitation of first male sperm by second male sperm becomes significant 2–7 days after copulation. The seminal fluid of the second male is believed to be responsible for this incapacitation mechanism (without removal of first male sperm) which takes effect before fertilization occurs. [ 38 ] The delay in effectiveness of the incapacitation mechanism is believed to be a protective mechanism that prevents a male fly from incapacitating his own sperm should he mate with the same female fly repetitively. Sensory neurons in the uterus of female D. melanogaster respond to a male protein, sex peptide , which is found in semen. [ 39 ]\n\nThis protein makes the female reluctant to copulate for about 10 days after insemination . The signal pathway leading to this change in behavior has been determined. The signal is sent to a brain region that is a homolog of the hypothalamus and the hypothalamus then controls sexual behavior and desire. [ 39 ] Gonadotropic hormones in Drosophila maintain homeostasis and govern reproductive output via a cyclic interrelationship, not unlike the mammalian estrous cycle . [ 40 ] Sex peptide perturbs this homeostasis and dramatically shifts the endocrine state of the female by inciting juvenile hormone synthesis in the corpus allatum . [ 41 ]\n\nD. melanogaster is often used for life extension studies, such as to identify genes purported to increase lifespan when mutated . [ 42 ] D. melanogaster is also used in studies of aging . Werner syndrome is a condition in humans characterized by accelerated aging. It is caused by mutations in the gene WRN that encodes a protein with essential roles in repair of DNA damage. Mutations in the D. melanogaster homolog of WRN also cause increased physiologic signs of aging, such as shorter lifespan, higher tumor incidence, muscle degeneration, reduced climbing ability, altered behavior and reduced locomotor activity. [ 43 ]\n\nMeiotic recombination in D. melanogaster appears to be employed in repairing damage in germ-line DNA as indicated by the findings that meiotic recombination is induced by the DNA damaging agents ultraviolet light [ 44 ] and mitomycin C . [ 45 ]\n\nFemales become receptive to courting males about 8–12 hours after emergence. [ 46 ] Specific neuron groups in females have been found to affect copulation behavior and mate choice. One such group in the abdominal nerve cord allows the female fly to pause her body movements to copulate. [ 39 ] Activation of these neurons induces the female to cease movement and orient herself towards the male to allow for mounting. If the group is inactivated, the female remains in motion and does not copulate. Various chemical signals such as male pheromones often are able to activate the group. [ 39 ]\n\nAlso, females exhibit mate choice copying . When virgin females are shown other females copulating with a certain type of male, they tend to copulate more with this type of male afterwards than naïve females (which have not observed the copulation of others). This behavior is sensitive to environmental conditions, and females copulate less in bad weather conditions. [ 47 ]\n\nD. melanogaster males exhibit a strong reproductive learning curve. That is, with sexual experience, these flies tend to modify their future mating behavior in multiple ways. These changes include increased selectivity for courting only intraspecifically, as well as decreased courtship times.\n\nSexually naïve D. melanogaster males are known to spend significant time courting interspecifically, such as with D. simulans flies. Naïve D. melanogaster will also attempt to court females that are not yet sexually mature, and other males. D. melanogaster males show little to no preference for D. melanogaster females over females of other species or even other male flies. However, after D. simulans or other flies incapable of copulation have rejected the males' advances, D. melanogaster males are much less likely to spend time courting nonspecifically in the future. This apparent learned behavior modification seems to be evolutionarily significant, as it allows the males to avoid investing energy into futile sexual encounters. [ 48 ]\n\nIn addition, males with previous sexual experience modify their courtship dance when attempting to mate with new females—the experienced males spend less time courting, so have lower mating latencies, meaning that they are able to reproduce more quickly. This decreased mating latency leads to a greater mating efficiency for experienced males over naïve males. [ 49 ] This modification also appears to have obvious evolutionary advantages, as increased mating efficiency is extremely important in the eyes of natural selection .\n\nBoth male and female D. melanogaster flies act polygamously (having multiple sexual partners at the same time). [ 50 ] In both males and females, polygamy results in a decrease in evening activity compared to virgin flies, more so in males than females. [ 50 ] Evening activity consists of those in which the flies participate other than mating and finding partners, such as finding food. [ 51 ] The reproductive success of males and females varies, because a female only needs to mate once to reach maximum fertility. [ 51 ] Mating with multiple partners provides no advantage over mating with one partner, so females exhibit no difference in evening activity between polygamous and monogamous individuals. [ 51 ] For males, however, mating with multiple partners increases their reproductive success by increasing the genetic diversity of their offspring. [ 51 ] This benefit of genetic diversity is an evolutionary advantage because it increases the chance that some of the offspring will have traits that increase their fitness in their environment.\n\nThe difference in evening activity between polygamous and monogamous male flies can be explained with courtship. For polygamous flies, their reproductive success increases by having offspring with multiple partners, and therefore they spend more time and energy on courting multiple females. [ 51 ] On the other hand, monogamous flies only court one female, and expend less energy doing so. [ 51 ] While it requires more energy for male flies to court multiple females, the overall reproductive benefits it produces has kept polygamy as the preferred sexual choice. [ 51 ]\n\nThe mechanism that affects courtship behavior in Drosophila is controlled by the oscillator neurons DN1s and LNDs. [ 52 ] Oscillation of the DN1 neurons was found to be effected by sociosexual interactions , and is connected to mating-related decrease of evening activity. [ 52 ]\n\nD. melanogaster remains one of the most studied organisms in biological research, particularly in genetics and developmental biology. It is also employed in studies of environmental mutagenesis. [ citation needed ]\n\nD. melanogaster was among the first organisms used for genetic analysis , and today it is one of the most widely used and genetically best-known of all eukaryotic organisms. All organisms use common genetic systems; therefore, comprehending processes such as transcription and replication in fruit flies helps in understanding these processes in other eukaryotes, including humans . [ 53 ]\n\nThomas Hunt Morgan began using fruit flies in experimental studies of heredity at Columbia University in 1910 in a laboratory known as the Fly Room. The Fly Room was cramped with eight desks, each occupied by students and their experiments. They started off experiments using milk bottles to rear the fruit flies and handheld lenses for observing their traits. The lenses were later replaced by microscopes, which enhanced their observations. Morgan and his students eventually elucidated many basic principles of heredity, including sex-linked inheritance, epistasis , multiple alleles, and gene mapping . [ 53 ]\n\nD. melanogaster had historically been used in laboratories to study genetics and patterns of inheritance. However, D. melanogaster also has importance in environmental mutagenesis research, allowing researchers to study the effects of specific environmental mutagens. [ 54 ]\n\nThere are many reasons the fruit fly is a popular choice as a model organism: [ citation needed ]\n\nGenetic markers are commonly used in Drosophila research, for example within balancer chromosomes or P-element inserts, and most phenotypes are easily identifiable either with the naked eye or under a microscope. In the list of a few common markers below, the allele symbol is followed by the name of the gene affected and a description of its phenotype. (Note: Recessive alleles are in lower case, while dominant alleles are capitalised.)\n\nDrosophila genes are traditionally named after the phenotype they cause when mutated. For example, the absence of a particular gene in Drosophila will result in a mutant embryo that does not develop a heart. Scientists have thus called this gene tinman , named after the Oz character of the same name . [ 58 ] Likewise changes in the Shavenbaby gene cause the loss of dorsal cuticular hairs in Drosophila sechellia larvae. [ 59 ] This system of nomenclature results in a wider range of gene names than in other organisms.\n\nThe genome of D. melanogaster (sequenced in 2000, and curated at the FlyBase database [ 55 ] ) contains four pairs of chromosomes—an X/Y pair, and three autosomes labeled 2, 3, and 4. The fourth chromosome is relatively very small and therefore often ignored, aside from its important eyeless gene. The D. melanogaster sequenced genome of 139.5 million base pairs has been annotated [ 82 ] and contains around 15,682 genes (Ensemble release 73), including 13,822 protein-coding genes. [ 83 ] More than 60% of the genome appears to be functional non-protein-coding DNA. [ 84 ] Determination of sex in Drosophila occurs by the X:A ratio of X chromosomes to autosomes, not because of the presence of a Y chromosome as in human sex determination. Although the Y chromosome is entirely heterochromatic , it contains at least 16 genes, many of which are thought to have male-related functions. [ 85 ]\n\nThere are three transferrin orthologs, all of which are dramatically divergent from those known in chordate models. [ 86 ]\n\nA June 2001 study by National Human Genome Research Institute comparing the fruit fly and human genome estimated that about 60% of genes are conserved between the two species. [ 87 ] About 75% of known human disease genes have a recognizable match in the genome of fruit flies, [ 88 ] and 50% of fly protein sequences have mammalian homologs [ citation needed ] . An online database called Homophila is available to search for human disease gene homologues in flies and vice versa. [ 89 ]\n\nDrosophila is being used as a genetic model for several human diseases including the neurodegenerative disorders Parkinson's , Huntington's , spinocerebellar ataxia and Alzheimer's disease . [ 90 ] The fly is also being used to study mechanisms underlying aging and oxidative stress , immunity , diabetes , and cancer , as well as drug abuse . [ 91 ] [ 92 ] [ 93 ]\n\nThe life cycle of this insect has four stages: fertilized egg, larva, pupa, and adult. [ 14 ]\n\nEmbryogenesis in Drosophila has been extensively studied, as its small size, short generation time, and large brood size makes it ideal for genetic studies. It is also unique among model organisms in that cleavage occurs in a syncytium .\n\nDuring oogenesis, cytoplasmic bridges called \"ring canals\" connect the forming oocyte to nurse cells. Nutrients and developmental control molecules move from the nurse cells into the oocyte. In the figure to the left, the forming oocyte can be seen to be covered by follicular support cells. [ citation needed ]\n\nAfter fertilization of the oocyte, the early embryo (or syncytial embryo ) undergoes rapid DNA replication and 13 nuclear divisions until about 5000 to 6000 nuclei accumulate in the unseparated cytoplasm of the embryo. By the end of the eighth division, most nuclei have migrated to the surface, surrounding the yolk sac (leaving behind only a few nuclei, which will become the yolk nuclei). After the 10th division, the pole cells form at the posterior end of the embryo, segregating the germ line from the syncytium. Finally, after the 13th division, cell membranes slowly invaginate, dividing the syncytium into individual somatic cells. Once this process is completed, gastrulation starts. [ 94 ]\n\nNuclear division in the early Drosophila embryo happens so quickly, no proper checkpoints exist, so mistakes may be made in division of the DNA. To get around this problem, the nuclei that have made a mistake detach from their centrosomes and fall into the centre of the embryo (yolk sac), which will not form part of the fly. [ citation needed ]\n\nThe gene network (transcriptional and protein interactions) governing the early development of the fruit fly embryo is one of the best understood gene networks to date, especially the patterning along the anteroposterior (AP) and dorsoventral (DV) axes (See under morphogenesis ). [ 94 ]\n\nThe embryo undergoes well-characterized morphogenetic movements during gastrulation and early development, including germ-band extension , formation of several furrows, ventral invagination of the mesoderm , and posterior and anterior invagination of endoderm (gut), as well as extensive body segmentation until finally hatching from the surrounding cuticle into a first-instar larva. [ citation needed ]\n\nDuring larval development, tissues known as imaginal discs grow inside the larva. Imaginal discs develop to form most structures of the adult body, such as the head, legs, wings, thorax, and genitalia. Cells of the imaginal disks are set aside during embryogenesis and continue to grow and divide during the larval stages—unlike most other cells of the larva, which have differentiated to perform specialized functions and grow without further cell division. At metamorphosis, the larva forms a pupa , inside which the larval tissues are reabsorbed and the imaginal tissues undergo extensive morphogenetic movements to form adult structures.\n\nBiotic and abiotic factors experienced during development will affect developmental resource allocation leading to phenotypic variation , also referred to as developmental plasticity. [ 95 ] [ 96 ] As in all insects, [ 96 ] environmental factors can influence several aspects of development in Drosophila melanogaster . [ 97 ] [ 98 ] Fruit flies reared under a hypoxia treatment experience decreased thorax length, while hyperoxia produces smaller flight muscles, suggesting negative developmental effects of extreme oxygen levels. [ 99 ] Circadian rhythms are also subject to developmental plasticity. Light conditions during development affect daily activity patterns in Drosophila melanogaster , where flies raised under constant dark or light are less active as adults than those raised under a 12-hour light/dark cycle. [ 100 ]\n\nTemperature is one of the most pervasive factors influencing arthropod development. In Drosophila melanogaster temperature-induced developmental plasticity can be beneficial and/or detrimental. [ 101 ] [ 102 ] Most often lower developmental temperatures reduce growth rates which influence many other physiological factors. [ 103 ] For example, development at 25 °C increases walking speed, thermal performance breadth , and territorial success, while development at 18 °C increases body mass, wing size, all of which are tied to fitness. [ 98 ] [ 101 ] Moreover, developing at certain low temperatures produces proportionally large wings which improve flight and reproductive performance at similarly low temperatures ( See acclimation ). [ 104 ]\n\nWhile certain effects of developmental temperature, like body size, are irreversible in ectotherms , others can be reversible. [ 96 ] [ 105 ] When Drosophila melanogaster develop at cold temperatures they will have greater cold tolerance, but if cold-reared flies are maintained at warmer temperatures their cold tolerance decreases and heat tolerance increases over time. [ 105 ] [ 106 ] Because insects typically only mate in a specific range of temperatures, their cold/heat tolerance is an important trait in maximizing reproductive output. [ 107 ]\n\nWhile the traits described above are expected to manifest similarly across sexes, developmental temperature can also produce sex-specific effects in D. melanogaster adults.\n\nDrosophila flies have both X and Y chromosomes, as well as autosomes . Unlike humans, the Y chromosome does not confer maleness; rather, it encodes genes necessary for making sperm. Sex is instead determined by the ratio of X chromosomes to autosomes. [ 112 ] Furthermore, each cell \"decides\" whether to be male or female independently of the rest of the organism, resulting in the occasional occurrence of gynandromorphs .\n\nThree major genes are involved in determination of Drosophila sex. These are sex-lethal , sisterless , and deadpan . Deadpan is an autosomal gene which inhibits sex-lethal , while sisterless is carried on the X chromosome and inhibits the action of deadpan . An AAX cell has twice as much deadpan as sisterless , so sex-lethal will be inhibited, creating a male. However, an AAXX cell will produce enough sisterless to inhibit the action of deadpan , allowing the sex-lethal gene to be transcribed to create a female.\n\nLater, control by deadpan and sisterless disappears and what becomes important is the form of the sex-lethal gene. A secondary promoter causes transcription in both males and females. Analysis of the cDNA has shown that different forms are expressed in males and females. Sex-lethal has been shown to affect the splicing of its own mRNA . In males, the third exon is included which encodes a stop codon , causing a truncated form to be produced. In the female version, the presence of sex-lethal causes this exon to be missed out; the other seven amino acids are produced as a full peptide chain, again giving a difference between males and females. [ 113 ]\n\nPresence or absence of functional sex-lethal proteins now go on to affect the transcription of another protein known as doublesex. In the absence of sex-lethal, doublesex will have the fourth exon removed and be translated up to and including exon 6 (DSX-M[ale]), while in its presence the fourth exon which encodes a stop codon will produce a truncated version of the protein (DSX-F[emale]). DSX-F causes transcription of Yolk proteins 1 and 2 in somatic cells, which will be pumped into the oocyte on its production.\n\nThe D. melanogaster immune system can be divided into two responses: humoral and cell-mediated. The former is a systemic response mediated in large part through the toll and Imd pathways, which are parallel systems for detecting microbes. Other pathways including the stress response pathways JAK-STAT and P38 , nutritional signalling via FOXO , and JNK cell death signalling are all involved in key physiological responses to infection. D. melanogaster has an organ called the \" fat body \", which is analogous to the human liver. The fat body is the primary secretory organ and produces key immune molecules upon infection, such as serine proteases and antimicrobial peptides (AMPs). AMPs are secreted into the hemolymph and bind infectious bacteria and fungi, killing them by forming pores in their cell walls or inhibiting intracellular processes. The cellular immune response instead refers to the direct activity of blood cells (hemocytes) in Drosophila , which are analogous to mammalian monocytes/macrophages. Hemocytes also possess a significant role in mediating humoral immune responses such as the melanization reaction. [ 114 ]\n\nThe immune response to infection can involve up to 2,423 genes, or 13.7% of the genome. Although the fly's transcriptional response to microbial challenge is highly specific to individual pathogens, Drosophila differentially expresses a core group of 252 genes upon infection with most bacteria. This core group of genes is associated with gene ontology categories such as antimicrobial response, stress response, secretion, neuron-like, reproduction, and metabolism among others. [ 115 ] [ 116 ] Drosophila also possesses several immune mechanisms to both shape the microbiota and prevent excessive immune responses upon detection of microbial stimuli. For instance, secreted PGRPs with amidase activity scavenge and degrade immunostimulatory DAP-type PGN in order to block Imd activation. [ 117 ]\n\nUnlike mammals, Drosophila have innate immunity but lack an adaptive immune response. However, the core elements of this innate immune response are conserved between humans and fruit flies. As a result, the fruit fly offers a useful model of innate immunity for disentangling genetic interactions of signalling and effector function, as flies do not have to contend with interference of adaptive immune mechanisms that could confuse results. Various genetic tools, protocols, and assays make Drosophila a classical model for studying the innate immune system , [ 118 ] which has even included immune research on the international space station. [ 119 ]\n\nMultiple elements of the Drosophila JAK-STAT signalling pathway bear direct homology to human JAK-STAT pathway genes. JAK-STAT signalling is induced upon various organismal stresses such as heat stress, dehydration, or infection. JAK-STAT induction leads to the production of a number of stress response proteins including Thioester-containing proteins (TEPs), [ 120 ] Turandots, [ 121 ] and the putative antimicrobial peptide Listericin. [ 122 ] The mechanisms through which many of these proteins act is still under investigation. For instance, the TEPs appear to promote phagocytosis of Gram-positive bacteria and the induction of the toll pathway. As a consequence, flies lacking TEPs are susceptible to infection by toll pathway challenges. [ 120 ]\n\nCirculating hemocytes are key regulators of infection. This has been demonstrated both through genetic tools to generate flies lacking hemocytes, or through injecting microglass beads or lipid droplets that saturate hemocyte ability to phagocytose a secondary infection. [ 123 ] [ 124 ] Flies treated like this fail to phagocytose bacteria upon infection, and are correspondingly susceptible to infection. [ 125 ] These hemocytes derive from two waves of hematopoiesis , one occurring in the early embryo and one occurring during development from larva to adult. [ 126 ] However Drosophila hemocytes do not renew over the adult lifespan, and so the fly has a finite number of hemocytes that decrease over the course of its lifespan. [ 127 ] Hemocytes are also involved in regulating cell-cycle events and apoptosis of aberrant tissue (e.g. cancerous cells) by producing Eiger, a tumor necrosis factor signalling molecule that promotes JNK signalling and ultimately cell death and apoptosis. [ 128 ]\n\nIn 1971, Ron Konopka and Seymour Benzer published \"Clock mutants of Drosophila melanogaster \", a paper describing the first mutations that affected an animal's behavior. Since then, Benzer and others have used behavioral screens to isolate genes involved in vision , olfaction , audition, learning/memory, courtship, pain, aggression , grooming , and other processes, such as longevity. [ citation needed ]\n\nWild-type flies show an activity rhythm with a frequency of about a day (24 hours). Benzer and others found mutants with faster and slower rhythms, as well as broken rhythms—flies that move and rest in random spurts. Work over the following 30 years has shown that these mutations (and others like them) affect a group of genes and their products that form a biochemical or biological clock . This clock is found in a wide range of fly cells, but the clock-bearing cells that control activity are several dozen neurons in the fly's central brain. [ citation needed ]\n\nThe Nobel Prize in Physiology or Medicine for 2017 was awarded to Jeffrey C. Hall, Michael Rosbash, Michael W. Young for their works using fruit flies in understanding the \"molecular mechanisms controlling the circadian rhythm \". [ 129 ]\n\nFollowing the pioneering work of Alfred Henry Sturtevant [ 130 ] and others, Benzer and colleagues [ 56 ] used sexual mosaics to develop a novel fate mapping technique. This technique made it possible to assign a particular characteristic to a specific anatomical location. For example, this technique showed that male courtship behavior is controlled by the brain. [ 56 ] Mosaic fate mapping also provided the first indication of the existence of pheromones in this species. [ 131 ] Males distinguish between conspecific males and females and direct persistent courtship preferentially toward females thanks to a female-specific sex pheromone which is mostly produced by the female's tergites .\n\nMale flies sing to the females during courtship using their wings to generate sound, and some of the genetics of sexual behavior have been characterized. In particular, the fruitless gene has several different splice forms, and male flies expressing female splice forms have female-like behavior and vice versa. The TRP channels nompC , nanchung , and inactive are expressed in sound-sensitive Johnston's organ neurons and participate in the transduction of sound. [ 132 ] [ 133 ] Mutating the Genderblind gene, also known as CG6070, alters the sexual behavior of Drosophila , turning the flies bisexual . [ 134 ]\n\nThe first learning and memory mutants ( dunce , rutabaga , etc.) were isolated by William \"Chip\" Quinn while in Benzer's lab, and were eventually shown to encode components of an intracellular signaling pathway involving cyclic AMP , protein kinase A, and a transcription factor known as CREB. These molecules were shown to be also involved in synaptic plasticity in Aplysia and mammals. [ 135 ]\n\nThe compound eye of the fruit fly contains 760 unit eyes or ommatidia , and are one of the most advanced among insects. Each ommatidium contains eight photoreceptor cells (R1-8), support cells, pigment cells , and a cornea. Wild-type flies have reddish pigment cells, which serve to absorb excess blue light so the fly is not blinded by ambient light. Eye color genes regulate cellular vesicular transport. The enzymes needed for pigment synthesis are then transported to the cell's pigment granule, which holds pigment precursor molecules. [ 68 ]\n\nEach photoreceptor cell consists of two main sections, the cell body and the rhabdomere . The cell body contains the nucleus , while the 100-μm-long rhabdomere is made up of toothbrush-like stacks of membrane called microvilli . Each microvillus is 1–2 μm in length and about 60 nm in diameter. [ 136 ] The membrane of the rhabdomere is packed with about 100 million opsin molecules, the visual protein that absorbs light. The other visual proteins are also tightly packed into the microvilli, leaving little room for cytoplasm .\n\nAbout two-thirds of the Drosophila brain is dedicated to visual processing. [ 137 ] Although the spatial resolution of their vision is significantly worse than that of humans, their temporal resolution is around 10 times better.\n\nFlies use a modified version of Bloom filters to detect novelty of odors, with additional features including similarity of novel odor to that of previously experienced examples, and time elapsed since previous experience of the same odor. [ 138 ]\n\nLike many other hexapod insects, Drosophila typically walk using a tripod gait . [ 140 ] This means that three of the legs swing together while the other three remain stationary, or in stance. Specifically, the middle leg moves in phase with the contralateral front and hind legs. However, variability around the tripod configuration exists along a continuum, meaning that flies do not exhibit distinct transitions between different gaits. [ 141 ] At fast walking speeds, the walking configuration is mostly tripod (three legs in stance), but at slower walking speeds, flies are more likely to have four (tetrapod) or five legs in stance (wave). [ 142 ] [ 143 ] These transitions may help to optimize static stability . [ 144 ] Because flies are so small, inertial forces are negligible compared with the elastic forces of their muscles and joints or the viscous forces of the surrounding air. [ 145 ]\n\nFlies fly via straight sequences of movement interspersed by rapid turns called saccades. [ 146 ] During these turns, a fly is able to rotate 90 degrees in less than 50 milliseconds. [ 146 ]\n\nCharacteristics of Drosophila flight may be dominated by the viscosity of the air, rather than the inertia of the fly body, but the opposite case with inertia as the dominant force may occur. [ 146 ] However, subsequent work showed that while the viscous effects on the insect body during flight may be negligible, the aerodynamic forces on the wings themselves actually cause fruit flies' turns to be damped viscously. [ 147 ]\n\nDrosophila is one of the few animals ( C. elegans being another) where detailed neural circuits ( connectomes ) of the brain and nerve cord are available.\n\nThe larval brain and nerve cord consist of 3,016 neurons and 548,000 synapses. [ 148 ] The Drosophila adult central nervous system (brain plus ventral nerve cord) has been reconstructed in both the male [ 149 ] and the female [ 150 ] and contains around 160,000 neurons and over 200 million synapses. These datasets allow scientists to generate testable hypotheses about how the brain processes information and gives rise to behavior. [ 151 ]\n\nDrosophila is sometimes referred to as a pest due to its tendency to live in human settlements where fermenting fruit is found. Flies may collect in homes, restaurants, stores, and other locations. [ 15 ] The name and behavior of this species of fly have led to the misconception that it is a biological security risk in Australia and elsewhere. While other \"fruit fly\" species do pose a risk, D. melanogaster is attracted to fruit that is already rotting, rather than causing fruit to rot. [ 152 ] [ 153 ]",
    "tf_idf_text": "drosophila melanogaster specie fly insect order diptera family drosophilidae specie often refer fruit fly lesser fruit fly less commonly vinegar fly pomace fly banana fly wild melanogaster attract rot fruit fermenting beverage often find orchard kitchen pubs start charles woodworth proposal use specie model organism melanogaster continue widely use biological research genetics physiology microbial pathogenesis life history evolution melanogaster first animal launched space six nobel prize award drosophilists work use insect drosophila melanogaster typically use research owe rapid life cycle relatively simple genetics four pair chromosomes large number offspring per generation originally african specie nonafrican lineage common origin geographic range include continent include island melanogaster common pest home restaurant place food serve fly belong family tephritidae also call fruit fly cause confusion especially mediterranean australia south africa mediterranean fruit fly ceratitis capitata economic pest term drosophila mean dewloving modern scientific latin adaptation greek word drsos dew phila lover term melanogaster mean blackbelly come ancient greek mlas black gastr belly citation need wild type fruit fly yellowbrown brickred eye transverse black ring across abdomen fly body divide three main part head thorax abdomen head relatively round feature large prominent red compound eye eye make hundred ommatidia occupy head surface brickred color eye wild type fly due two pigment xanthommatin brown derive tryptophan drosopterins red derive guanosine triphosphate eye short antennae look like tiny feathery bristle projection use detect odor air current vibration drosophila also bristle short stiff hairsdistributed across head body useful tactile sense thorax robust bear three pair legs one pair wing wing clear membranous fine vein visible span approximately hold flat back fly rest behind wing small knoblike structure call halter modify hindwings help fly maintain balance orientation flight drosophila leg compose five leg segment coxa trochanter femur tibia tarsus five tarsal segment tarsus end fly foot multiple structure include claw adhesive structure pulvillus flexible elongated structure underneath claw seta hairlike structure spatulashaped inset pulvilli main attachment device use melanogaster although claw may use attachment onto rough surface male also sex comb locate first tarsal segment tiny bristlelike structure front leg use attach female mat extensive image find flybase abdomen segment taper toward end often appear striped alternate band light dark pigmentation male abdomen typically darker round female point striped abdomen black portion abdomen inspiration specie name melanogaster blackbellied exhibit sexual dimorphism female long male slightly small female body large adult male unlike human sex physical appearance fruit fly not influence hormone appearance sex fruit fly determine genetic information drosophila melanogaster distinguish related specie follow combination feature gena diameter eye great vertical height wing hyaline costal index male protarsus single row seta form sex comb male epandrial posterior lobe small nearly triangular female abdominal tergite dark band run ventral margin female oviscapt small pale without dorsodistal depression peglike outer ovisensilla optimal growth condition melanogaster lifespan day egg death developmental period melanogaster varies temperature many ectothermic specie shortest development time egg adult seven day achieve development time increase high temperature day due heat stress ideal condition development time day take day take day crowd condition development time increase emerge fly small female lay eggs embryos five time rot fruit suitable material decay mushroom sap flux drosophila melanogaster holometabolous insect undergoes full metamorphosis life cycle broken four stage embryo larva pupa adult egg long hatch hour result larvae grow four day molt twice second thirdinstar larva hour hatch time feed microorganism decompose fruit well sugar fruit mother put feces egg sacs establish microbial composition larvaes gut work positively larvae encapsulate puparium undergo fourdaylong metamorphosis adult eclose emerge male perform sequence five behavioral pattern court female first males orient play courtship song horizontally extend vibrate wing soon male position rear female abdomen low posture tap lick female genitalia finally male curl abdomen attempt copulation female reject male move away kick extrude ovipositor copulation last around minute male transfer hundred long sperm cell seminal fluid female female store sperm tubular receptacle two mushroomshaped spermathecae sperm multiple mating compete fertilization last male precedence believe exist last male mate female sire offspring precedence find occur displacement incapacitation displacement attribute sperm handle female fly multiple mating conduct significant first day copulation displacement seminal receptacle significant displacement spermathecae incapacitation first male sperm second male sperm become significant day copulation seminal fluid second male believe responsible incapacitation mechanism without removal first male sperm take effect fertilization occur delay effectiveness incapacitation mechanism believe protective mechanism prevents male fly incapacitate sperm mate female fly repetitively sensory neuron uterus female melanogaster respond male protein sex peptide find semen protein make female reluctant copulate day insemination signal pathway lead change behavior determine signal sent brain region homolog hypothalamus hypothalamus control sexual behavior desire gonadotropic hormone drosophila maintain homeostasis govern reproductive output via cyclic interrelationship not unlike mammalian estrous cycle sex peptide perturbs homeostasis dramatically shifts endocrine state female incite juvenile hormone synthesis corpus allatum melanogaster often use life extension study identify gene purport increase lifespan mutate melanogaster also use study age werner syndrome condition human characterize accelerated aging cause mutation gene wrn encodes protein essential role repair dna damage mutation melanogaster homolog wrn also cause increase physiologic sign age shorter lifespan high tumor incidence muscle degeneration reduce climb ability alter behavior reduce locomotor activity meiotic recombination melanogaster appear employed repair damage germline dna indicate finding meiotic recombination induce dna damaging agent ultraviolet light mitomycin females become receptive courting male hour emergence specific neuron group females find affect copulation behavior mate choice one group abdominal nerve cord allow female fly pause body movement copulate activation neuron induces female cease movement orient towards male allow mount group inactivate female remains motion not copulate various chemical signal male pheromone often able activate group also females exhibit mate choice copy virgin female show female copulate certain type male tend copulate type male afterwards nave female not observe copulation others behavior sensitive environmental condition females copulate less bad weather condition melanogaster male exhibit strong reproductive learning curve sexual experience fly tend modify future mat behavior multiple way change include increased selectivity court intraspecifically well decrease courtship time sexually nave melanogaster male know spend significant time court interspecifically simulans fly nave melanogaster also attempt court females not yet sexually mature male melanogaster male show little preference melanogaster female females specie even male fly however simulans fly incapable copulation reject male advance melanogaster male much less likely spend time court nonspecifically future apparent learn behavior modification seem evolutionarily significant allows male avoid invest energy futile sexual encounter addition male previous sexual experience modify courtship dance attempt mate new femalesthe experienced male spend less time court low mating latency mean able reproduce quickly decrease mat latency lead great mat efficiency experience male nave male modification also appear obvious evolutionary advantage increase mat efficiency extremely important eye natural selection male female melanogaster fly act polygamously multiple sexual partner time male female polygamy result decrease even activity compare virgin fly males female even activity consist fly participate mat find partner find food reproductive success male females varies female need mate reach maximum fertility mat multiple partner provide advantage mat one partner females exhibit difference evening activity polygamous monogamous individual male however mat multiple partner increase reproductive success increase genetic diversity offspring benefit genetic diversity evolutionary advantage increase chance offspring trait increase fitness environment difference evening activity polygamous monogamous male fly explain courtship polygamous fly reproductive success increase offspring multiple partner therefore spend time energy court multiple female hand monogamous fly court one female expend less energy require energy male fly court multiple female overall reproductive benefit produce kept polygamy prefer sexual choice mechanism affect courtship behavior drosophila control oscillator neuron dns lnds oscillation neuron find effected sociosexual interaction connect matingrelated decrease evening activity melanogaster remain one study organisms biological research particularly genetics developmental biology also employ study environmental mutagenesis citation need melanogaster among first organism use genetic analysis today one widely use genetically bestknown eukaryotic organism organism use common genetic system therefore comprehend process transcription replication fruit fly help understanding process eukaryotes include human thomas hunt morgan begin use fruit fly experimental study heredity columbia university laboratory know fly room fly room cramp eight desk occupied student experiment start experiment use milk bottle rear fruit fly handheld lenses observe trait lens later replace microscope enhance observation morgan student eventually elucidate many basic principle heredity include sexlinked inheritance epistasis multiple allele gene map melanogaster historically use laboratory study genetics pattern inheritance however melanogaster also importance environmental mutagenesis research allow researcher study effect specific environmental mutagen many reason fruit fly popular choice model organism citation need genetic marker commonly use drosophila research example within balancer chromosome pelement insert phenotype easily identifiable either naked eye microscope list common marker allele symbol follow name gene affect description phenotype note recessive allele low case dominant allele capitalise drosophila gene traditionally name phenotype cause mutate example absence particular gene drosophila result mutant embryo not develop heart scientist thus call gene tinman name character name likewise change shavenbaby gene cause loss dorsal cuticular hair drosophila sechellia larva system nomenclature result wider range gene name organisms genome melanogaster sequence curated flybase database contain four pair chromosomesan pair three autosome label fourth chromosome relatively small therefore often ignore aside important eyeless gene melanogaster sequence genome million base pair annotate contains around gene ensemble release include proteincoding gene genome appear functional nonproteincoding dna determination sex drosophila occur ratio chromosome autosomes not presence chromosome human sex determination although chromosome entirely heterochromatic contains least gene many thought malerelated function three transferrin orthologs dramatically divergent know chordate model june study national human genome research institute compare fruit fly human genome estimate gene conserve two specie know human disease gene recognizable match genome fruit fly fly protein sequence mammalian homologs citation need online database call homophila available search human disease gene homologues fly vice versa drosophila use genetic model several human disease include neurodegenerative disorder parkinson huntington spinocerebellar ataxia alzheimers disease fly also use study mechanism underlie age oxidative stress immunity diabetes cancer well drug abuse life cycle insect four stage fertilize egg larva pupa adult embryogenesis drosophila extensively study small size short generation time large brood size make ideal genetic study also unique among model organism cleavage occur syncytium oogenesis cytoplasmic bridge call ring canal connect form oocyte nurse cell nutrient developmental control molecule move nurse cell oocyte figure leave form oocyte see cover follicular support cell citation need fertilization oocyte early embryo syncytial embryo undergoes rapid dna replication nuclear division nuclei accumulate unseparated cytoplasm embryo end eighth division nuclei migrate surface surround yolk sac leave behind nuclei become yolk nuclei division pole cell form posterior end embryo segregate germ line syncytium finally division cell membrane slowly invaginate divide syncytium individual somatic cell process complete gastrulation start nuclear division early drosophila embryo happen quickly proper checkpoint exist mistake may make division dna get around problem nucleus make mistake detach centrosome fall centre embryo yolk sac not form part fly citation need gene network transcriptional protein interaction govern early development fruit fly embryo one best understood gene network date especially pattern along anteroposterior dorsoventral ax see morphogenesis embryo undergoes wellcharacterized morphogenetic movement gastrulation early development include germband extension formation several furrow ventral invagination mesoderm posterior anterior invagination endoderm gut well extensive body segmentation finally hatch surround cuticle firstinstar larva citation need larval development tissue know imaginal disc grow inside larva imaginal disc develop form structure adult body head legs wing thorax genitalia cell imaginal disk set aside embryogenesis continue grow divide larval stagesunlike cell larva differentiate perform specialized function grow without cell division metamorphosis larva form pupa inside larval tissue reabsorb imaginal tissue undergo extensive morphogenetic movement form adult structure biotic abiotic factor experience development affect developmental resource allocation lead phenotypic variation also refer developmental plasticity insect environmental factor influence several aspect development drosophila melanogaster fruit fly rear hypoxia treatment experience decrease thorax length hyperoxia produce small flight muscle suggest negative developmental effect extreme oxygen level circadian rhythm also subject developmental plasticity light condition development affect daily activity pattern drosophila melanogaster fly raise constant dark light less active adult raise hour lightdark cycle temperature one pervasive factor influence arthropod development drosophila melanogaster temperatureinduced developmental plasticity beneficial andor detrimental often low developmental temperature reduce growth rate influence many physiological factor example development increase walk speed thermal performance breadth territorial success development increase body mass wing size tie fitness moreover develop certain low temperature produce proportionally large wing improve flight reproductive performance similarly low temperature see acclimation certain effect developmental temperature like body size irreversible ectotherm others reversible drosophila melanogaster develop cold temperature great cold tolerance coldreared fly maintain warm temperature cold tolerance decrease heat tolerance increase time insects typically mate specific range temperature coldheat tolerance important trait maximize reproductive output trait describe expect manifest similarly across sex developmental temperature also produce sexspecific effect melanogaster adult drosophila fly chromosomes well autosomes unlike human chromosome not confer maleness rather encode gene necessary make sperm sex instead determine ratio chromosome autosomes furthermore cell decide whether male female independently rest organism result occasional occurrence gynandromorphs three major gene involve determination drosophila sex sexlethal sisterless deadpan deadpan autosomal gene inhibits sexlethal sisterless carry chromosome inhibits action deadpan aax cell twice much deadpan sisterless sexlethal inhibit create male however aaxx cell produce enough sisterless inhibit action deadpan allow sexlethal gene transcribe create female later control deadpan sisterless disappears become important form sexlethal gene secondary promoter cause transcription male female analysis cdna show different form express male female sexlethal show affect splice mrna male third exon include encodes stop codon cause truncate form produce female version presence sexlethal cause exon miss seven amino acid produce full peptide chain give difference male female presence absence functional sexlethal protein affect transcription another protein know doublesex absence sexlethal doublesex fourth exon remove translated include exon dsxmale presence fourth exon encodes stop codon produce truncate version protein dsxfemale dsxf cause transcription yolk proteins somatic cell pump oocyte production melanogaster immune system divide two response humoral cellmediated former systemic response mediate large part toll imd pathways parallel system detect microbes pathway include stress response pathways jakstat nutritional signalling via foxo jnk cell death signal involve key physiological response infection melanogaster organ call fat body analogous human liver fat body primary secretory organ produce key immune molecule upon infection serine proteases antimicrobial peptide amps amps secrete hemolymph bind infectious bacteria fungi kill forming pore cell wall inhibit intracellular process cellular immune response instead refers direct activity blood cell hemocytes drosophila analogous mammalian monocytesmacrophages hemocytes also possess significant role mediate humoral immune response melanization reaction immune response infection involve gene genome although flys transcriptional response microbial challenge highly specific individual pathogen drosophila differentially express core group gene upon infection bacteria core group gene associate gene ontology category antimicrobial response stress response secretion neuronlike reproduction metabolism among others drosophila also possess several immune mechanism shape microbiota prevent excessive immune response upon detection microbial stimuli instance secrete pgrps amidase activity scavenge degrade immunostimulatory daptype pgn order block imd activation unlike mammal drosophila innate immunity lack adaptive immune response however core element innate immune response conserve human fruit fly result fruit fly offer useful model innate immunity disentangle genetic interaction signal effector function fly not contend interference adaptive immune mechanism could confuse result various genetic tool protocols assay make drosophila classical model study innate immune system even include immune research international space station multiple element drosophila jakstat signal pathway bear direct homology human jakstat pathway gene jakstat signal induce upon various organismal stress heat stress dehydration infection jakstat induction lead production number stress response proteins include thioestercontaining protein teps turandots putative antimicrobial peptide listericin mechanisms many protein act still investigation instance teps appear promote phagocytosis grampositive bacteria induction toll pathway consequence fly lack teps susceptible infection toll pathway challenge circulate hemocytes key regulator infection demonstrate genetic tool generate fly lack hemocytes inject microglass bead lipid droplet saturate hemocyte ability phagocytose secondary infection fly treat like fail phagocytose bacteria upon infection correspondingly susceptible infection hemocytes derive two wave hematopoiesis one occur early embryo one occurring development larva adult however drosophila hemocytes not renew adult lifespan fly finite number hemocytes decrease course lifespan hemocytes also involved regulate cellcycle event apoptosis aberrant tissue cancerous cell produce eiger tumor necrosis factor signal molecule promotes jnk signal ultimately cell death apoptosis ron konopka seymour benzer publish clock mutant drosophila melanogaster paper describe first mutation affect animal behavior since benzer others use behavioral screen isolate gene involve vision olfaction audition learningmemory courtship pain aggression grooming process longevity citation need wildtype fly show activity rhythm frequency day hour benzer others find mutant faster slow rhythm well broken rhythmsflies move rest random spurt work follow year show mutation others like affect group gene product form biochemical biological clock clock find wide range fly cell clockbearing cell control activity several dozen neuron fly central brain citation need nobel prize physiology medicine award jeffrey hall michael rosbash michael young work use fruit fly understand molecular mechanism control circadian rhythm follow pioneer work alfred henry sturtevant others benzer colleague use sexual mosaic develop novel fate mapping technique technique make possible assign particular characteristic specific anatomical location example technique show male courtship behavior control brain mosaic fate mapping also provide first indication existence pheromone specie male distinguish conspecific male female direct persistent courtship preferentially toward female thanks femalespecific sex pheromone mostly produce female tergites male fly sing female courtship use wing generate sound genetics sexual behavior characterize particular fruitless gene several different splice form male fly express female splice form femalelike behavior vice versa trp channel nompc nanchung inactive express soundsensitive johnston organ neuron participate transduction sound mutate genderblind gene also know alters sexual behavior drosophila turn fly bisexual first learn memory mutant dunce rutabaga etc isolate william chip quinn benzers lab eventually show encode component intracellular signal pathway involve cyclic amp protein kinase transcription factor know creb molecule show also involve synaptic plasticity aplysia mammal compound eye fruit fly contains unit eye ommatidia one advance among insect ommatidium contains eight photoreceptor cell support cell pigment cell cornea wildtype fly reddish pigment cell serve absorb excess blue light fly not blinded ambient light eye color gene regulate cellular vesicular transport enzyme need pigment synthesis transport cell pigment granule hold pigment precursor molecule photoreceptor cell consist two main section cell body rhabdomere cell body contain nucleus mlong rhabdomere make toothbrushlike stack membrane call microvilli microvillus length diameter membrane rhabdomere pack million opsin molecule visual protein absorbs light visual protein also tightly pack microvilli leave little room cytoplasm twothirds drosophila brain dedicate visual processing although spatial resolution vision significantly bad human temporal resolution around time good fly use modify version bloom filter detect novelty odor additional feature include similarity novel odor previously experience example time elapse since previous experience odor like many hexapod insect drosophila typically walk use tripod gait mean three leg swing together three remain stationary stance specifically middle leg move phase contralateral front hind legs however variability around tripod configuration exist along continuum mean fly not exhibit distinct transition different gait fast walk speed walk configuration mostly tripod three leg stance slow walk speed fly likely four tetrapod five leg stance wave transition may help optimize static stability fly small inertial force negligible compare elastic force muscle joint viscous force surround air fly fly via straight sequence movement intersperse rapid turn call saccade turn fly able rotate degree less millisecond characteristic drosophila flight may dominate viscosity air rather inertia fly body opposite case inertia dominant force may occur however subsequent work show viscous effect insect body flight may negligible aerodynamic force wing actually cause fruit fly turn damp viscously drosophila one animal elegans another detailed neural circuit connectomes brain nerve cord available larval brain nerve cord consist neuron synapses drosophila adult central nervous system brain plus ventral nerve cord reconstruct male female contains around neuron million synapsis datasets allow scientist generate testable hypothesis brain process information give rise behavior drosophila sometimes referred pest due tendency live human settlement ferment fruit find fly may collect home restaurant store location name behavior specie fly lead misconception biological security risk australia elsewhere fruit fly specie pose risk melanogaster attract fruit already rot rather cause fruit rot"
}