{
    "title": "en.wikipedia.org_wiki_Ilia_Isorel%C3%BDs_Paulino",
    "url": "https://en.wikipedia.org/wiki/Ilia_Isorel%C3%BDs_Paulino",
    "transformers_text": "Ilia Isorelýs Paulino (born March 26, 1995) [ 1 ] [ 2 ] is an American actress, best known for her role as Lila Flores on The Sex Lives of College Girls (2021) [ 3 ] and Alvida in Netflix's live adaptation of One Piece (2023). [ 4 ]\n\nPaulino was born in Lawrence, Massachusetts on March 26, 1995 to Dominican parents. [ 5 ] [ 1 ] [ 6 ] She has a younger sister, Noemi, who is also an actress. [ 6 ] Growing up speaking mostly Spanish , Paulino described the beginning of her path to acting as 'complicated' due to her strong accent. [ 7 ] At age 13, she and a friend auditioned for a theatre version of Beauty and the Beast , with Paulino getting the main role as the Beast. [ 1 ]\n\nIn 2013 Paulino acted in the short movie Innovation before graduating from Central Catholic High School in Lawrence. Later she studied musical theatre at DeSales University in Center Valley, Pennsylvania [ 8 ] and graduated from Yale School of Drama in 2020. [ 6 ] [ 9 ]\n\nIn 2021, she appeared in a supporting role in the featured film production Queenpins . Since that same year, Paulino has played the role of Lila Flores in the HBO Max television series The Sex Lives of College Girls . [ 3 ] [ 1 ] [ 10 ] In early March 2022, it was announced that Paulino would have played the role of pirate captain Alvida in Netflix's One Piece live-action adaptation , [ 4 ] [ 11 ] [ 12 ] [ 13 ] a role for which she shed a significant amount of weight between the first and second season. [ 14 ] [ 15 ]\n\nOn November 2023, Paulino founded Cusp of Rebirth Productions alongside Donato Fatuesi e Logan Ellis. [ 16 ] [ 17 ]",
    "tf_idf_text": "ilia isorels paulino bear march american actress best know role lila flores sex life college girl alvida netflixs live adaptation one piece paulino bear lawrence massachusetts march dominican parent young sister noemi also actress grow speak mostly spanish paulino describe begin path act complicate due strong accent age friend audition theatre version beauty beast paulino get main role beast paulino act short movie innovation graduate central catholic high school lawrence later study musical theatre desales university center valley pennsylvania graduate yale school drama appear supporting role feature film production queenpins since year paulino play role lila flores hbo max television series sex live college girl early march announce paulino would play role pirate captain alvida netflixs one piece liveaction adaptation role shed significant amount weight first second season november paulino found cusp rebirth production alongside donato fatuesi logan elli"
}