{
    "title": "en.wikipedia.org_wiki_Marty_Adelstein",
    "url": "https://en.wikipedia.org/wiki/Marty_Adelstein",
    "transformers_text": "Martin Bruce Adelstein is an American television producer. Before becoming a producer, he was a partner at the Endeavor Talent Agency , where he was one of the founding members. As of 2019, Adelstein is the CEO and founder of Tomorrow Studios , a joint venture between Adelstein and ITV Studios .\n\nAdelstein has represented writer David E. Kelley for over 20 years. He discovered Kelley after he read his script called \"From the Hip\" and brought him to Los Angeles to work on his first show L.A. Law . He also discovered Dwayne \"The Rock\" Johnson while representing the WWF . Adelstein booked him to host Saturday Night Live and the show received the highest rating in 10 years. He was subsequently put in the film The Mummy Returns where he received 5 million dollars for 5 minutes of screen time as The Scorpion King. He also brought actress/writer Tina Fey to the agency as well as writers Bonnie and Terry Turner who went on to create 3rd Rock from the Sun and That '70s Show .\n\nAdelstein has produced many television series, including the MTV series Teen Wolf , the NBC series Aquarius , the critically acclaimed 2011 film Hanna and the ABC / Fox sitcom Last Man Standing . [ 1 ]\n\nAdelstein is married and has three children.\n\nAdelstein has joined the advisory board of the Creative Community for Peace (CCFP), an organization that is composed of prominent members of the entertainment industry who promote the arts as a means to achieve peace, support artistic freedom, and counter the cultural boycott of Israel . [ 2 ]\n\nFOX Production Awards 2008(Best Long Term Show)",
    "tf_idf_text": "martin bruce adelstein american television producer become producer partner endeavor talent agency one founding member adelstein ceo founder tomorrow studio joint venture adelstein itv studio adelstein represent writer david kelley year discover kelley read script call hip bring los angeles work first show law also discover dwayne rock johnson represent wwf adelstein book host saturday night live show receive high rating year subsequently put film mummy return receive million dollar minute screen time scorpion king also bring actresswriter tina fey agency well writer bonnie terry turner go create rock sun show adelstein produce many television series include mtv series teen wolf nbc series aquarius critically acclaim film hanna abc fox sitcom last man stand adelstein marry three child adelstein join advisory board creative community peace ccfp organization compose prominent member entertainment industry promote art mean achieve peace support artistic freedom counter cultural boycott israel fox production award best long term show"
}