{
    "title": "768 22 \"The Third One! Raizo of the Mist, the Ninja, Appears!\"Transliteration: \"Sannin Me! Ninja: Kiri no Raizō Tōjō!\" (Japanese:三人目！忍者・霧の雷ぞう登場！) Directed by:Yoshihiro UedaStoryboarded by:Tetsuya Endō Jin Tanaka December 11, 2016(2016-12-11) TBA",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_18",
    "transformers_text": "768 22 The Third One Rai zo of the Mist the Ninja Appears Transliteration S ann in Me Ninja Kiri no R aiz T j Japanese Directed by Yoshihiro Ueda Story boarded by Tetsuya End J in Tanaka December 11 2016 2016 12 11 TBA Kin ' em on expresses his gratitude to the two rulers for keeping Rai zo safe However Dog storm and Cat Viper quickly become angry at each other and prepare to fight only to be chastised by Momo no suke who they quickly bow to Kin ' em on reveals that he is not Momo no suke's father and that his real father is Ko zuki Oden the great daimyo of Kuri in the Land of Wa no He also explains that he and Kan j uro along with Duke Dog storm and Master Cat Viper serve as his retainers As Luffy and the others take this in Dog storm and Cat Viper decide to call a truce and be more friendly to one other to which the rest of the Minks rejoice They then all journey to the large tree in the whale forest entering a secret door in the tail which leads to a hidden underground chamber When they reach it they find a distraught Rai zo who had been chained up to prevent him from giving himself up to Jack",
    "tf_idf_text": "third one rai mist ninja appear transliteration ann ninja kiri aiz japanese direct yoshihiro ueda story board tetsuya end tanaka december tba kin express gratitude two ruler keep rai safe however dog storm cat viper quickly become angry prepare fight chastise momo suke quickly bow kin reveals not momo sukes father real father zuki oden great daimyo kuri land also explain kan uro along duke dog storm master cat viper serve retainer luffy others take dog storm cat viper decide call truce friendly one rest mink rejoice journey large tree whale forest enter secret door tail lead hide underground chamber reach find distraught rai chain prevent give jack"
}