{
    "title": "SP5 \"Episode of Nami: Tears of a Navigator and the Bonds of Friends\"[4]Transliteration: \"Episōdo obu Nami: Kōkaishi no Namida to Nakama no Kizuna\" (Japanese:エピソードオブナミ ～航海士の涙と仲間の絆～) Katsumi Tokoro Hirohiko Kamisaka August 25, 2012(2012-08-25) 106 minutes",
    "url": "https://en.wikipedia.org/wiki/List_of_One_Piece_television_specials",
    "transformers_text": "SP5 \"Episode of Nami: Tears of a Navigator and the Bonds of Friends\"[4]Transliteration: \"Episōdo obu Nami: Kōkaishi no Namida to Nakama no Kizuna\" (Japanese:エピソードオブナミ ～航海士の涙と仲間の絆～) Katsumi Tokoro Hirohiko Kamisaka August 25, 2012(2012-08-25) 106 minutes\n\nAn abridged remake of the Arlong Park story arc:[n 2]Some time after joining the Straw Hats, Nami steals the Going Merry and returns to her home inCocoyashi Village, which is under the control of theArlong Pirates. When Usopp finds Nami,Arlongorders her to kill him, and she injures herself while faking Usopp's death. Once the Straw Hats regroup, Nami's sisterNojiko, aware of the bond they had, explains that when Arlong took control of the village, he murdered Nami's mother and held Cocoyashi's citizens as ransom to exploit Nami's exceptional talent for cartography. After Arlong informsNezumi, a bribed Marine, of where Nami's earnings are hidden, the village riots against Arlong despite poor odds. After Nami tearfully asks Luffy for help, he and the remaining Straw Hats free the village by fighting and defeating the Arlong Pirates. After a days-long celebration, Nami re-joins the Straw Hat crew.",
    "tf_idf_text": "episode nami tear navigator bond friendstransliteration episdo obu nami kkaishi namida nakama kizuna japanese katsumi tokoro hirohiko kamisaka august minute abridge remake arlong park story arcn time join straw hat nami steal go merry return home incocoyashi village control thearlong pirate usopp find namiarlongorders kill injures fake usopps death straw hat regroup namis sisternojiko aware bond explain arlong take control village murder namis mother hold cocoyashis citizen ransom exploit namis exceptional talent cartography arlong informsnezumi bribe marine namis earnings hidden village riot arlong despite poor odds nami tearfully ask luffy help remain straw hat free village fight defeat arlong pirate dayslong celebration nami rejoin straw hat crew"
}