{
    "title": "SP8 \"3D2Y: Overcoming Ace's Death! Luffy's Pledge to his Friends\"[4]Transliteration: \"Surī-Dī Tsū-Wai: Ēsu no Shi o Koete! Rufi Nakama to no Chikai\" (Japanese:〝3D2Y〟 エースの死を越えて! ルフィ仲間との誓い) Naoyuki Itou Hirohiko Kamisaka,Jin Tanaka, Tomohiro Nakayama August 30, 2014(2014-08-30) 107 minutes",
    "url": "https://en.wikipedia.org/wiki/List_of_One_Piece_television_specials",
    "transformers_text": "SP8 \"3D2Y: Overcoming Ace's Death! Luffy's Pledge to his Friends\"[4]Transliteration: \"Surī-Dī Tsū-Wai: Ēsu no Shi o Koete! Rufi Nakama to no Chikai\" (Japanese:〝3D2Y〟 エースの死を越えて! ルフィ仲間との誓い) Naoyuki Itou Hirohiko Kamisaka,Jin Tanaka, Tomohiro Nakayama August 30, 2014(2014-08-30) 107 minutes\n\nLuffy is 18 months into his training in Ruskaina when several Navy ships are attacked byByrnndi World;[n 5]World was imprisoned after several of his crew gave him away to the Navy and revealed themselves to be Cipher Pol spies, but escaped Impel Down during the War of the Best and has now reunited with members of his former crew. World kidnaps Marigold and Sandersonia, and Luffy and Hancock set out to rescue them. They arrive at World's ship, which holds a huge newly built cannon; Buggy and Mihawk also arrive due to the Warlords being summoned. Once Luffy, Hancock and Buggy have taken out the remainder of World's crew, his brother Byojack unsuccessfully tries to convince him to abandon his revenge, but World reveals that he is still enraged over their \"betrayal\" and has been using his crew as a means to an end. Luffy overhears this and it, combined with World's taunting ofAce's death, motivates him enough to successfully defeat World using the Armament Haki ability that he had been honing on Ruskaina. Severely weakened, World uses the cannon on approaching Navy ships, but the attack is deflected by Mihawk and the Navy successfully destroys World's ship. Six months later, Luffy reunites with his crew.",
    "tf_idf_text": "overcome ace death luffys pledge friendstransliteration surd tswai shi koete rufi nakama chikai japanesedy naoyuki itou hirohiko kamisakajin tanaka tomohiro nakayama august minute luffy month train ruskaina several navy ship attack bybyrnndi worldn world imprison several crew give away navy reveal cipher pol spy escape impel war best reunite member former crew world kidnaps marigold sandersonia luffy hancock set rescue arrive world ship hold huge newly build cannon buggy mihawk also arrive due warlord summon luffy hancock buggy take remainder world crew brother byojack unsuccessfully try convince abandon revenge world reveals still enrage betrayal use crew mean end luffy overhears combine world taunt ofaces death motivates enough successfully defeat world use armament haki ability hone ruskaina severely weaken world use cannon approach navy ship attack deflect mihawk navy successfully destroy world ship six month later luffy reunites crew"
}