{
    "title": "SP9 \"Episode of Sabo: The Three Brothers' Bond – The Miraculous Reunion and the Inherited Will\"[4]Transliteration: \"Episōdo obu Sabo: San-Kyōdai no Kizuna – Kiseki no Saikai to Uketsugareru Ishi\" (Japanese:エピソードオブサボ 〜3兄弟の絆 奇跡の再会と受け継がれる意志〜) Gou Koga Hirohiko Kamisaka August 22, 2015(2015-08-22) 107 minutes",
    "url": "https://en.wikipedia.org/wiki/List_of_One_Piece_television_specials",
    "transformers_text": "SP9 \"Episode of Sabo: The Three Brothers' Bond – The Miraculous Reunion and the Inherited Will\"[4]Transliteration: \"Episōdo obu Sabo: San-Kyōdai no Kizuna – Kiseki no Saikai to Uketsugareru Ishi\" (Japanese:エピソードオブサボ 〜3兄弟の絆 奇跡の再会と受け継がれる意志〜) Gou Koga Hirohiko Kamisaka August 22, 2015(2015-08-22) 107 minutes\n\nAn abridged remake of Sabo's childhood and the Dressrosa story arc.[n 6]After Ace's death in the Marineford War, which is seen in flashbacks, Sabo appears at his grave. He later arrives in Dressrosa to investigate a weapon smuggling, where he is informed that Doflamingo is holding a tournament at the nearby coliseum with Ace's Flame-Flame devil fruit as a prize. Luffy's crew soon arrives in Dressrosa and, entering the tournament under the alias \"Lucy\", he gets to the final round. Recognizing Luffy, Sabo reminisces about their shared childhood: Sabo and Ace refuse to befriend Luffy, but change their mind after he is kidnapped by a pirate and beaten for refusing to give away the location of their treasure. Later, the three declare themselves brothers. When his father finds them, Sabo reveals that he is a Noble who ran away from home and is forced to go back to his biological family. Sabo is told about a plan to burn down the poor area of the country and unsuccessfully tries to warn Ace and Luffy. Sabo escapes home again to become a pirate, but his boat is shot down and he's presumed dead. In the present day: the Straw Hats join an uprising against Doflamingo and, after revealing his identity, Sabo agrees to take \"Lucy's\" place so that Luffy can join them. As the Straw Hats revert Dressrosa's toy slaves back to humans, Sabo wins the tournament and eats the Flame-Flame fruit, \"borrowing\" Ace's Fire Fist technique.",
    "tf_idf_text": "episode sabo three brother bond miraculous reunion inherit willtransliteration episdo obu sabo sankydai kizuna kiseki saikai uketsugareru ishi japanese gou koga hirohiko kamisaka august minute abridge remake sabos childhood dressrosa story arcn ace death marineford war see flashback sabo appear grave later arrives dressrosa investigate weapon smuggle informed doflamingo hold tournament nearby coliseum ace flameflame devil fruit prize luffys crew soon arrive dressrosa enter tournament alias lucy get final round recognize luffy sabo reminisces share childhood sabo ace refuse befriend luffy change mind kidnap pirate beaten refuse give away location treasure later three declare brother father find sabo reveals noble run away home force back biological family sabo tell plan burn poor area country unsuccessfully try warn ace luffy sabo escape home become pirate boat shot he presume dead present day straw hat join uprising doflamingo reveal identity sabo agrees take lucys place luffy join straw hat revert dressrosas toy slave back human sabo win tournament eats flameflame fruit borrowing ace fire fist technique"
}