{
    "title": "896 5 \"Side Story! Clash! Luffy vs. the King of Carbonation!\"Transliteration: \"Tokubetsu-hen! Kessen! Rufi tai Tansan-ō\" (Japanese:特別編！決戦！ルフィVS炭酸王) Yutaka Nakashima Atsuhiro Tomioka Shigefumi Shingaki August 4, 2019(2019-08-04)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_20",
    "transformers_text": "896 5 Side Story Clash Luffy vs the King of Carbonation Transliteration Tokubetsu hen K essen Ru fi tai Tans an Japanese VS Yutaka Na kashima Atsuhiro To mio ka S hig ef umi Shin gaki August 4 2019 2019 08 04 As Luffy fights Cidre as Hancock fights Gua rna who uses a pair of pressurized carbonated hoses as swords meanwhile the rest of the Straw Hats discovers that the Cidre Guild soldiers are local men who Cidre forced to fight for him When G iger and Hancock's sisters arrive the Cidre Guild fall back with Luffy and the others following Cidre equips his most powerful carbonated rig to battle Luffy and he discovers that the Cidre Guild soldiers are local men who Cidre coerced by taking their families hostage Hancock defeats both Ginger and Guarana turning them to stone Luffy is able to defeat Cidre with an Gum Gum Elephant Gun and Hancock revives the Guild's slaves she had turned to stone Afterwards Luffy finds an invitation to the Pirate Fest and the freed Cidre Guild members gift the Straw Hats several barrels of cola The Straw Hats sail to Delta Island for the Pirate Fest with a planned race for Gol D Roger's treasure in particular exciting Luffy Other Supernovas make their way as elsewhere Buena Festa looks forward to a clash between Luffy and Douglas Bullet leading to the events in One Piece Stampede",
    "tf_idf_text": "side story clash luffy king carbonation transliteration tokubetsu hen essen tai tan japanese yutaka kashima atsuhiro mio hig umi shin gaki august luffy fight cidre hancock fight gua rna us pair pressurize carbonated hose sword meanwhile rest straw hat discovers cidre guild soldier local men cidre force fight iger hancocks sister arrive cidre guild fall back luffy others follow cidre equips powerful carbonate rig battle luffy discovers cidre guild soldier local men cidre coerce take family hostage hancock defeat ginger guarana turn stone luffy able defeat cidre gum gum elephant gun hancock revive guild slave turn stone afterwards luffy find invitation pirate fest freed cidre guild member gift straw hat several barrel cola straw hat sail delta island pirate fest plan race gol rogers treasure particular excite luffy supernova make way elsewhere buena festa look forward clash luffy douglas bullet lead event one piece stampede"
}