{
    "title": "922 31 \"A Tale of Chivalry! Zoro and Tonoyasu's Little Trip!\"Transliteration: \"Ninkyō Den! Zoro to Tonoyasu Futari-tabi!\" (Japanese:任侠伝！ゾロとトの康二人旅！) Yusuke Suzuki Ryo Yamazaki Masayuki Takagi February 16, 2020(2020-02-16)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_20",
    "transformers_text": "922 31 A Tale of Chivalry Zoro and To no yas u's Little Trip Transliteration N inky Den Zoro to To no yas u Futari tabi Japanese Yusuke Suzuki Ryo Yamazaki Masayuki Takagi February 16 2020 2020 02 16 Zoro goes to a gambling house with a sycophant named To no yas u After Zoro exposes the house of cheating a brawl breaks out Afterwards Zoro and To no yas u go to Ebisu Town which Zoro assumes is wealthy as it is named after the god of fortune Meanwhile the Ninja Pirate Mink Samurai Alliance works to steal weapons and food while pinning the blame on Mt A tama Thieves Franky learns that head carpenter Minato mo no longer has the blueprints of Kai do's mansion He goes all over the Flower Capital searching for them but hits a dead end At the shogun's castle CP 0 attempts to negotiate for weapons with Orochi who demands that Vega punk to be brought to Wa no all the while boasting that he's untouchable with Kai do backing him Meanwhile Momo no suke reveals to Tama that he has a sister named Hi yori and he does not know whether or not she is alive but doesn't want to look for her out of fear that Orochi would go after her",
    "tf_idf_text": "tale chivalry zoro yas little trip transliteration inky den zoro yas futari tabi japanese yusuke suzuki ryo yamazaki masayuki takagi february zoro go gamble house sycophant name yas zoro expose house cheat brawl break afterwards zoro yas ebisu town zoro assume wealthy name god fortune meanwhile ninja pirate mink samurai alliance work steal weapon food pin blame tama thief franky learns head carpenter minato long blueprint kai dos mansion go flower capital search hit dead end shoguns castle attempt negotiate weapon orochi demand vega punk bring boast he untouchable kai back meanwhile momo suke reveals tama sister name yori not know whether not alive doesnt want look fear orochi would"
}