{
    "title": "925 34 \"Dashing! The Righteous Soba Mask!\"Transliteration: \"Dai Katsuyaku! Masayoshi no O-Soba Masuku!\" (Japanese:大活躍！正義のおそばマスク！) Midori Tanaka Akiko Inoue Kenji Yokoyama March 22, 2020(2020-03-22)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_20",
    "transformers_text": "925 34 Dashing The Righteous Soba Mask Transliteration Dai Katsuya ku Masa yoshi no O Soba Masu ku Japanese Midori Tanaka Akiko Inoue Kenji Yokoyama March 22 2020 2020 03 22 As he confronts Page One Sanji puts on his Raid Suit in order to disguise himself Law who as a child was a fan of Sora Warrior of the Sea comic strip which is popular in the North Blue recognizes it as Germ a 66's Stealth Black Unwilling to be associated with Germ a Sanji instead dons the name Soba Mask As Sanji fights Page One with the Raid Suit he and displays its capabilities including invisibility As San iji notes the cruel irony of how his childhood dream of invisibility came true through the Germ a technology that he hated Page One transform into his Human Beast Form and r engages with Sanji After unleashing one powerful attack Sanji escapes into the sky as Us opp Law and Franky also flee to avoid being identified Back in the shogun's caste Robin sneaks around trying to find important information but she is confronted by the Orochi On iwa ban shu Orochi's personal ninja force as Fukurokuju the ninja leader gives Robin a chance to explain herself",
    "tf_idf_text": "dash righteous soba mask transliteration dai katsuya masa yoshi soba masu japanese midori tanaka akiko inoue kenji yokoyama march confronts page one sanji put raid suit order disguise law child fan sora warrior sea comic strip popular north blue recognize germ stealth black unwilling associate germ sanji instead don name soba mask sanji fight page one raid suit display capability include invisibility san iji note cruel irony childhood dream invisibility come true germ technology hat page one transform human beast form engage sanji unleash one powerful attack sanji escape sky opp law franky also flee avoid identify back shoguns caste robin sneak around try find important information confront orochi iwa ban shu orochis personal ninja force fukurokuju ninja leader give robin chance explain"
}