{
    "title": "930 39 \"A Lead Performer! Queen the Plague Emerges!\"Transliteration: \"Ōkanban! Ekisai no Kuīn Arawaru\" (Japanese:大看板! 疫災のクイーン現る！) Yusuke Suzuki Shōji Yonemura Masahiro Shimanuki June 28, 2020(2020-06-28)[3][n 4]",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_20",
    "transformers_text": "930 39 A Lead Performer Queen the Plague Emerges Transliteration kan ban Eki sai no Ku n A raw aru Japanese Yusuke Suzuki Sh ji Yone mura Masahiro S him an uki June 28 2020 2020 06 28 3 n 4 Rai zo manages to steal some keys from the Prisoner Mines executive tower Meanwhile Hyo who's revealed to be the former yak uz a head Hyogo ro the Flower refuses to tell Da if ugo who gave him the food tickets When the vice warden threatens to kill Hyogo ro Luffy kicks Da if ugo to defend the old man and then fights the guards until the prison's warden Headliner Bab an uki an elephant SMILE user with an elephant head from his stomach fires a cannonball from the elephant's trunk at him Luffy note that he cannot use his Hak i because of the Sea stone cuffs Headliner Solitaire the prison's vice warden and a monkey SMILE user finds out about the stolen keys As Queen arrives at the Prisoner Mines and performs a short musical number With the guards distracted Luffy carries Hyo away attempting to climb a wall to escape the prison Bab an uki describes the circumstances to Queen telling him about Kid's escape the stolen keys and Luffy attempting to escape Queen tells his men to chase after Luffy",
    "tf_idf_text": "lead performer queen plague emerge transliteration kan ban eki sai raw aru japanese yusuke suzuki yone mura masahiro uki june rai manage steal key prisoner mine executive tower meanwhile hyo who reveal former yak head hyogo flower refuse tell ugo give food ticket vice warden threatens kill hyogo luffy kick ugo defend old man fight guard prison warden headliner bab uki elephant smile user elephant head stomach fire cannonball elephant trunk luffy note cannot use hak sea stone cuff headliner solitaire prison vice warden monkey smile user find steal key queen arrives prisoner mine performs short musical number guard distract luffy carry hyo away attempt climb wall escape prison bab uki describes circumstance queen tell kid escape steal key luffy attempt escape queen tell men chase luffy"
}