{
    "title": "937 46 \"Tonoyasu! Ebisu Town's Most Loved!\"Transliteration: \"Tonoyasu! Ebisu-chō ichi no Ninkimono!\" (Japanese:トの康！えびす町一の人気者！) Satoshi Itō Akiko Inoue Kazuya Hisada August 16, 2020(2020-08-16)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_20",
    "transformers_text": "937 46 To no yas u Ebisu Town's Most Loved Transliteration To no yas u Ebisu ch ichi no N in kimono Japanese Satoshi It Akiko Inoue Kazuya His ada August 16 2020 2020 08 16 Luffy continues to try to learn how to advance his Armament Hak i which Hyogo ro says it referred to as Ryu o in Wa no through fighting in the Sumo Inferno While discussing the state of the rebellion To no yas u speaks to and addresses Kan j uro and Shinobu casually but they do not remember him as he leave to tend to the townsfolk An old woman explains to Nami and Us opp that To no yas u gets his income from his daughter Toko 11 who works at the capital and sends it to him which To no yas u would give most of it away to the townspeople Back in the prison Luffy continues fighting until the night and will resume the next day After Luffy explains to Hyogo ro who the Four Emperors are they are met by Rai zo and Caribou whom Rai zo had recruited As they talk about the rebellion Hyogo ro asks to join the cause which Rai zo eagerly allows H you goro considers recruiting the Udon prisoners to fight for them as most of the prisoners were arrested for treason against Orochi The others accept this idea and Rai zo works to free Kawa matsu from of his cell Caribou then takes out a giant pot of os hiruko stolen from Queen Meanwhile Big Mom approaches Udon with Ki ku Chopper Momo no suke and Tama",
    "tf_idf_text": "yas ebisu town love transliteration yas ebisu ichi kimono japanese satoshi akiko inoue kazuya ada august luffy continue try learn advance armament hak hyogo say refer ryu fight sumo inferno discuss state rebellion yas speak address kan uro shinobu casually not remember leave tend townsfolk old woman explain nami opp yas get income daughter toko work capital sends yas would give away townspeople back prison luffy continue fight night resume next day luffy explain hyogo four emperor meet rai caribou rai recruit talk rebellion hyogo ask join cause rai eagerly allow goro considers recruit udon prisoner fight prisoner arrest treason orochi others accept idea rai work free kawa matsu cell caribou take giant pot hiruko steal queen meanwhile big mom approach udon chopper momo suke tama"
}