{
    "title": "942 51 \"The Straw Hats Step In! An Uproarious Deadly Battle at the Execution Ground!\"Transliteration: \"Ichimi Ran'nyū! Sōzen! Shokei-jō no Gekitō\" (Japanese:一味乱入！騒然！処刑場の激闘) Kōhei Kureta Shōji Yonemura Toshio Deguchi & Keita Saitō September 20, 2020(2020-09-20)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_20",
    "transformers_text": "942 51 The Straw Hats Step In An Uproarious Deadly Battle at the Execution Ground Transliteration Ichi mi Ran ' ny S zen Sho kei j no Gek it Japanese K he i Kure ta Sh ji Yone mura Toshio Deg uchi Keita S a it September 20 2020 2020 09 20 Zoro and Sanji manage to save Toko The swordsman directly attacks Orochi who is protected by K yoshiro while Sanji fights against Drake who transforms into Dragon Dragon Fruit Model Ancient Type Allosaurus Beast Form Franky saves Zoro from the firing squad and manages to recover Ya sui e's body as the rest of the Straw Hats join the fight At Udon Luffy cheers on his crew from the sumo ring Just then Queen is informed that some criminals have arrived Kama zo who failed to assassinate Toko and Kid who surrendered after his escape enter the prison Kid immediately recognized Kama zo and asks why he's constantly laughing after having beaten up anyone who mocked his laugh and even masked his face to hide it in the past where it is revealed that Kama zo is Kid's own crew mate Killer Killer was somehow forced to eat a SMILE fruit and therefore can only express happiness Kid screams out in anguish demanding to know who's responsible for his partner condition and as well as what happened to the rest of his crew Angered for Kid Luffy calls out Queen demanding he resumes the sumo match",
    "tf_idf_text": "straw hat step uproarious deadly battle execution ground transliteration ichi run zen sho kei gek japanese kure yone mura toshio deg uchi keita september zoro sanji manage save toko swordsman directly attack orochi protected yoshiro sanji fight drake transforms dragon dragon fruit model ancient type allosaurus beast form franky save zoro fire squad manages recover sui body rest straw hat join fight udon luffy cheer crew sumo ring queen inform criminal arrive kama fail assassinate toko kid surrender escape enter prison kid immediately recognize kama ask he constantly laugh beat anyone mock laugh even mask face hide past revealed kama kid crew mate killer killer somehow force eat smile fruit therefore express happiness kid scream anguish demand know who responsible partner condition well happen rest crew anger kid luffy call queen demand resume sumo match"
}