{
    "title": "944 53 \"The Storm Has Come! A Raging Big Mom!\"Transliteration: \"Arashi Tōrai! Ō-abare Biggu Mamu!\" (Japanese:嵐到来！大暴れビッグ・マム！) Masahiro Hosoda Shinzō Fujita Kenji Yokoyama October 4, 2020(2020-10-04)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_20",
    "transformers_text": "944 53 The Storm Has Come A Raging Big Mom Transliteration Arashi T rai a bare Big gu M amu Japanese Masahiro Ho soda Shin z Fujita Kenji Yokoyama October 4 2020 2020 10 04 After the skirmish inside the Flower Capital Kin ' em on confesses to A shura that he provoked Hold em into attacking Mt A tama When A shura becomes angry Kin ' em on admits his mistake for trying to force A shura to join the rebellion and once again begs him for his help A shura tells the two to follow him as he has something important to show them After Chopper's group arrives at the Prisoner Mines Big Mom breaks in Chopper and Ki ku who dons a disguise go in after her as Momo no suke and Tama stay outside During Big Mom's search for os hiruko Queen refusing to share his favorite food transforms into his Dragon Dragon Fruit Ancient Type Model Brachiosaurus Beast Form to fight her both unaware there isn't any soup left While he and Ki ku travel through the entrance Chopper worries if the amnesiac Big Mom can fight Queen only to find her slamming Queen's head into the ground",
    "tf_idf_text": "storm come rag big mom transliteration arashi rai bare big amu japanese masahiro soda shin fujita kenji yokoyama october skirmish inside flower capital kin confess shura provoke hold attack tama shura become angry kin admits mistake try force shura join rebellion begs help shura tell two follow something important show chopper group arrive prisoner mine big mom break chopper don disguise momo suke tama stay outside big mom search hiruko queen refuse share favorite food transforms dragon dragon fruit ancient type model brachiosaurus beast form fight unaware isnt soup leave travel entrance chopper worry amnesiac big mom fight queen find slam queen head ground"
}