{
    "title": "948 57 \"Start Fighting Back! Luffy and the Akazaya Samurai!\"Transliteration: \"Hangeki Kaishi! Rufi to Akazaya no Samurai!\" (Japanese:反撃開始！ルフィと赤鞘の侍！) Yutaka Nakashima Shōji Yonemura Shūichi Itō November 1, 2020(2020-11-01)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_20",
    "transformers_text": "948 57 Start Fighting Back Luffy and the A kaz aya Samurai Transliteration Han geki Kai shi Ru fi to A kaz aya no Samurai Japanese Yutaka Na kashima Sh ji Yone mura Sh ichi It November 1 2020 2020 11 01 Rai zo retrieves the keys to Kawa matsu's cell as well as his sword So to Moto but is confronted by Solitaire though he is able to escape The ninja later gives them to him and Kawa matsu frees himself and fends off the guards with both Ryu o enhanced sumo techniques and his unique sword fighting style Kappa Style After Rai zo Kawa matsu and Ki ku reunite they join up with Luffy and Hyogo ro in fighting the Beast Pirates When Ki ku dons a one mask it is revealed that full name and epithet is Ki kuno jo of the Lingering Snow as well as a fact that she is actually a transgender woman However the Beast Pirates continue to infect prisoners with diseased Plague Rounds Elsewhere Zoro and Hi yori walk through a leafy forest they are attacked by one Fukurokuju's assassins but Zoro fends him off At sea Queen's ship takes Big Mom to On iga shima Despite the tranquilizer shots Big Mom wakes up briefly asking for os hiruko then falls back asleep Back at Udon Kid attempts to remove his cuffs Rai zo throws them the keys but Kid only having one hand asks Killer to help him unlock the cuffs However Killer just lies on the ground laughing",
    "tf_idf_text": "start fight back luffy kaz aya samurai transliteration han geki kai shi kaz aya samurai japanese yutaka kashima yone mura ichi november rai retrieve key kawa matsus cell well sword moto confront solitaire though able escape ninja later give kawa matsu free fends guard ryu enhance sumo technique unique sword fight style kappa style rai kawa matsu reunite join luffy hyogo fight beast pirate don one mask reveal full name epithet kuno linger snow well fact actually transgender woman however beast pirate continue infect prisoner diseased plague round elsewhere zoro yori walk leafy forest attack one fukurokujus assassins zoro fends sea queen ship take big mom iga shima despite tranquilizer shot big mom wake briefly ask hiruko fall back asleep back udon kid attempt remove cuff rai throw key kid one hand ask killer help unlock cuff however killer lie ground laugh"
}