{
    "title": "954 63 \"Its Name is Enma! Oden's Great Swords!\"Transliteration: \"Sono Na wa Enma! Oden no Meitō!\" (Japanese:その名は閻魔！おでんの名刀！) Kōhei Kureta Tomohiro Nakayama Kazuya Hisada December 13, 2020(2020-12-13)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_20",
    "transformers_text": "954 63 Its Name is Enma Oden's Great Swords Transliteration So no Na wa Enma Oden no Me it Japanese K he i Kure ta Tomohiro Nakayama Kazuya His ada December 13 2020 2020 12 13 Kawa matsu rekindles his bond with Hi yori whilst Zoro chases after G yuki maru Kawa matsu explains that in Ringo people are given a sword at birth which they keep for their entire life When they die their swords are used as grave markers for their Eternal Graves He also tells her that thirteen years ago after she ran away he spent some time robbing and storing swords from the Eternal Graves in Ringo after befriending Onimaru a kom a gits une a a fox with flame like mane and tail who was once the companion of S him o tsuki Us him aru the late dam iyo of Ringo During his time guarding the graves he came up with the alias G yuki maru This went on until he was captured trying to steal food and was sent to Udon Hi yori feels it isn't a coincidence that a man named G yuki maru is doing the exact same thing Kawa matsu did Kawa matsu contacts Kin ' em on to reveal that he can supply the alliance with the stored weapons Meanwhile G yuki maru reveals himself to be Onimaru in a human form 13 Hi yori then offers to trade Zoro's Shu shui with Em na a sword that belonged to Ko zuki Oden and the only blade that injured Kai do",
    "tf_idf_text": "name enma odens great sword transliteration enma oden japanese kure tomohiro nakayama kazuya ada december kawa matsu rekindles bond yori whilst zoro chase yuki maru kawa matsu explain ringo people give sword birth keep entire life die sword use grave marker eternal graf also tell thirteen year ago run away spent time rob store sword eternal graf ringo befriend onimaru kom git une fox flame like mane tail companion tsuki aru late dam iyo ringo time guard graf come alias yuki maru go captured try steal food send udon yori feel isnt coincidence man name yuki maru exact thing kawa matsu kawa matsu contact kin reveal supply alliance store weapon meanwhile yuki maru reveals onimaru human form yori offer trade zoros shu shui sword belong zuki oden blade injured kai"
}