{
    "title": "962 71 \"Changing Destiny! The Whitebeard Pirates Cast Ashore!\"Transliteration: \"Ugoku Unmei Hyōchaku! Shirohige Kaizokudan!\" (Japanese:動く運命 漂着！白ひげ海賊団！) Yasunori Koyama Atsuhiro Tomioka Masahiro Shimanuki February 14, 2021(2021-02-14)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_20",
    "transformers_text": "962 71 Changing Destiny The White beard Pirates Cast Ashore Transliteration U goku Un mei Hy c haku Shiro hig e Kai z oku dan Japanese Ya sun ori Koyama Atsuhiro To mio ka Masahiro S him an uki February 14 2021 2021 02 14 Oden defeats A shura Do ji and his bandits and earns the title of the Daimyo of Kuri with Sukiyaki repealing his disavowal and accepts him as his son again After taking his followers as his official retainers he spends years rebuilding the lawless land and eventually rescues and nurtures Cat Viper Dog storm and Kaw at matsu who's revealed to be a fish man but goes as a kappa to escape his kind's persecution after his mother's death from it When Oden was having financial trouble due to him constantly lending money to Orochi his retainers decide to steal from Ya sui e but are caught Ya sui e then decides to give gold to Oden's retainers to let them train and become worthy samurai Oden and his retainers become distinguished legends in Wa no and Ko zuki Sukiyaki is proud of Oden's accomplishments Meanwhile the White beard Pirates cast ashore the beaches of Wa no",
    "tf_idf_text": "change destiny white beard pirate cast ashore transliteration goku mei haku shiro hig kai oku dan japanese sun ori koyama atsuhiro mio masahiro uki february oden defeat shura bandit earn title daimyo kuri sukiyaki repeal disavowal accepts son take follower official retainer spend year rebuild lawless land eventually rescue nurture cat viper dog storm kaw matsu who reveal fish man go kappa escape kinds persecution mother death oden financial trouble due constantly lend money orochi retainer decide steal sui catch sui decides give gold odens retainer let train become worthy samurai oden retainer become distinguished legend zuki sukiyaki proud odens accomplishment meanwhile white beard pirate cast ashore beach"
}