{
    "title": "972 81 \"The End of the Battle! Oden vs. Kaido!\"Transliteration: \"Ketchaku no Toki! Oden tai Kaidō!\" (Japanese:決着の時！おでんVSカイドウ！) Directed by: Ryōsuke TanakaStoryboarded by: Aya Komaki Hitoshi Tanaka Yong-Ce Tu May 2, 2021(2021-05-02)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_20",
    "transformers_text": "972 81 The End of the Battle Oden vs Kai do Transliteration Ketch aku no Toki Oden tai Kaid Japanese VS Directed by Ry suke Tanaka Story boarded by Aya Ko maki Hitoshi Tanaka Yong Ce Tu May 2 2021 2021 05 02 Shinobu helps Oden and the A kaz aya Nine in their battle as King and Queen join the fray to confront Oden's retainers Oden confronts Kai do and is pushed back until he manages to injure him leaving a scar Kai do turns back into his human form and prepares to enter a final clash with Oden However Hi gura shi disguises herself as Momo no suke while a Beast Pirate held her at knife point distracting Oden just enough for Kai do to critically wound and defeat the off guarded samurai A shura and Kin ' em on try to rescue Oden but are defeated as well by King and Queen Oden and the A kaz aya Nine were all jailed in the Flower Capital with only Shinobu being spared thanks to Oden denying allegiance to her so that she would not be arrested with the others Three days later Oden and the A kaz aya Nine were sentenced to public execution by boiling Just before Oden entered the pot he suggested a wager to Orochi and Kai do if he and his retainers could survive a set amount of time in the pot they would be set free",
    "tf_idf_text": "end battle oden kai transliteration ketch aku toki oden tai kaid japanese directed suke tanaka story board aya maki hitoshi tanaka yong may shinobu help oden kaz aya nine battle king queen join fray confront odens retainer oden confronts kai push back manages injure leave scar kai turn back human form prepares enter final clash oden however gura shi disguise momo suke beast pirate hold knife point distract oden enough kai critically wound defeat guard samurai shura kin try rescue oden defeat well king queen oden kaz aya nine jail flower capital shinobu spar thanks oden denying allegiance would not arrest others three day later oden kaz aya nine sentence public execution boil oden enter pot suggest wager orochi kai retainer could survive set amount time pot would set free"
}