{
    "title": "977 86 \"The Sea Is For Pirates! Raid! To Onigashima!\"Transliteration: \"Umi wa Kaizoku! Uchiiri! Iza Onigashima\" (Japanese:海は海賊！討入り！いざ鬼ヶ島) Masahiro Hosoda Akiko Inoue Kenji Yokoyama June 6, 2021(2021-06-06)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_20",
    "transformers_text": "977 86 The Sea Is For Pirates Raid To On iga shima Transliteration Umi wa Kai z oku Uchi iri Iz a On iga shima Japanese Masahiro Ho soda Akiko Inoue Kenji Yokoyama June 6 2021 2021 06 06 No allies have to come to aid the raid on On iga shima so the A kaz aya Nine jump on a rowboat to go to On iga shima Ki kuno jo deduces that there must be a traitor amongst them Kin ' em on struggles to accept that one of his friends betrayed them Kan j uro coldly confesses that he is the traitor He claims that while he had no ill will towards them the person a of Oden's loyal retainer was just a role given to him to him by Orochi after witnessing his parents murder revealing himself as a member of the Kuro zum i Family He reveals he was responsible not only for leaking Oden's plan to attack Kai do 20 years ago but also for Jack finding Zo u and leaking information about the raid to Orochi just three Beast Pirate ships come to attack them Kin ' em on cuts down Kan j uro only to reveal that it is only a drawing of him made by his Devil Fruit 15 The real Kan j uro is still at the port where he restrains Shinobu with drawn snakes and captures Momo no suke As the Beast Pirates bombard the A kaz aya's boat with cannonballs their ships are attacked as the Thousand Sunny emerges from the high waves Meanwhile the A kaz aya's boat is lifted from the water by the Polar Tang with Law scolding the samurai for underestimating the sea Another of the Beast Pirates ' ship is attacked on the other side by the Kid Pirates ' ship the Victoria Punk Kid states he is only there to take down Kai do also commenting that the rebels and their ships are at another port As Luffy Law and Kid prepare for battle Luffy tells the samurai that the sea is meant for pirates",
    "tf_idf_text": "sea pirate raid iga shima transliteration umi kai oku uchi iri iga shima japanese masahiro soda akiko inoue kenji yokoyama june ally come aid raid iga shima kaz aya nine jump rowboat iga shima kuno deduces must traitor amongst kin struggle accept one friend betray kan uro coldly confess traitor claim ill towards person odens loyal retainer role give orochi witness parent murder reveal member kuro zum family reveals responsible not leak odens plan attack kai year ago also jack find leak information raid orochi three beast pirate ship come attack kin cut kan uro reveal draw make devil fruit real kan uro still port restrains shinobu drawn snake capture momo suke beast pirate bombard kaz ayas boat cannonball ship attack thousand sunny emerges high wave meanwhile kaz ayas boat lift water polar tang law scold samurai underestimating sea another beast pirate ship attacked side kid pirate ship victoria punk kid state take kai also comment rebel ship another port luffy law kid prepare battle luffy tell samurai sea meant pirate"
}