{
    "title": "986 95 \"Fighting Music! An Ability That Harms Luffy!\"Transliteration: \"Tatakau Myūjikku! Rufi o Osou Nōryoku!\" (Japanese:戦う音楽！ルフィを襲う能力！) Shigeyasu Yamauchi Hitoshi Tanaka Majiro & LEE August 8, 2021(2021-08-08)",
    "url": "https://en.wikipedia.org/wiki/One_Piece_season_20",
    "transformers_text": "986 95 Fighting Music An Ability That Harms Luffy Transliteration Tata kau My j ikk u Ru fi o Oso u N ryo ku Japanese Shi gey as u Yamauchi Hitoshi Tanaka Ma jiro LEE August 8 2021 2021 08 08 Remembering Tama's joy from os hiruko for the first time in Ok o bore Town Luffy explains how wasteful the partygoers were being Zoro decides to join Luffy before they decide to escape the Performance Floor Scratch men A poo notices and recognizes Luffy and Zoro and alert ts Queen who watches them from above shocked that Luffy escaped the prisoner mine Queen realizes that Bab an uki lied to him when he reported that Luffy was safely behind bars Queen calls out to all the partygoers announcing that he plans on eliminating a member of the Tobi R opp o and offers the soon to be vacant spot to the person who captures Luffy Luffy and Zoro battle several Gift ers but A poo intervenes and attacks them using his music based Devil Fruit ability 16 Even when Luffy and Zoro remove their disguises to fight better they are still overwhelmed Kid decides to intervene himself using his Devil Fruit ability to attract the metal around him to create a gigantic metallic arm that he slams into A poo for betraying their former alliance",
    "tf_idf_text": "fight music ability harm luffy transliteration tata kau ikk oso ryo japanese shi gey yamauchi hitoshi tanaka jiro lee august remember tamas joy hiruko first time bore town luffy explain wasteful partygoer zoro decides join luffy decide escape performance floor scratch men poo notice recognize luffy zoro alert queen watch shock luffy escape prisoner mine queen realize bab uki lie report luffy safely behind bar queen call partygoer announce plan eliminate member tobi opp offer soon vacant spot person capture luffy luffy zoro battle several gift er poo intervenes attack use music base devil fruit ability even luffy zoro remove disguise fight good still overwhelm kid decide intervene use devil fruit ability attract metal around create gigantic metallic arm slam poo betray former alliance"
}