{
    "title": "10 \"Boy meets girl\" Yoshimichi Hirai Kazuyuki Fudeyasu March 15, 2011(2011-03-15)[20]",
    "url": "https://en.wikipedia.org/wiki/Level_E",
    "transformers_text": "10 \"Boy meets girl\" Yoshimichi Hirai Kazuyuki Fudeyasu March 15, 2011(2011-03-15)[20]\n\nTachibana announces at school that Shimizu will be moving to America with his family due to his father's job. The other four color rangers become upset since Shimizu will be leaving in two days. In the woods, Shimizu comes across an injured woman named Lorelei, who admits that she is a mermaid alien. She urges him to come back with help, despite his falling out with his friends. Shimizu brings the other color rangers back to the woods, but Lorelei is nowhere to be found. After the color rangers resolve their conflict, they begin their search for Lorelei and end up finding her in a lair. Surprisingly, she is treated as merchandise by three poachers. However, when Lorelei believes that Shylock, the leader of the poachers, will take her to her mermaid roommates, the color rangers instinctively attack the poachers to protect Lorelei. After the color rangers tie up the poachers, Shylock shockingly reveals that Lorelei's mermaid roommates were already sold and probably dead. Lorelei shoots the poachers to death in tears. The color rangers introduce themselves by name to Lorelei, before she changes into her mermaid form and swims off into the ocean to reunite with her mermaid roommates.",
    "tf_idf_text": "boy meet girl yoshimichi hirai kazuyuki fudeyasu march tachibana announce school shimizu move america family due father job four color ranger become upset since shimizu leave two day wood shimizu come across injured woman name lorelei admits mermaid alien urge come back help despite fall friend shimizu brings color ranger back wood lorelei nowhere find color ranger resolve conflict begin search lorelei end find lair surprisingly treat merchandise three poacher however lorelei believe shylock leader poacher take mermaid roommate color ranger instinctively attack poacher protect lorelei color ranger tie poacher shylock shockingly reveals loreleis mermaid roommate already sell probably dead lorelei shoot poacher death tear color ranger introduce name lorelei change mermaid form swim ocean reunite mermaid roommate"
}