{
    "title": "11 \"Field of dreams!\" Toshiya Shinohara Masashi Suzuki March 22, 2011(2011-03-22)[20]",
    "url": "https://en.wikipedia.org/wiki/Level_E",
    "transformers_text": "11 \"Field of dreams!\" Toshiya Shinohara Masashi Suzuki March 22, 2011(2011-03-22)[20]\n\nYukitaka and the Kisaragi High School baseball team seemingly arrive at Koushien Stadium during their semi-final match, but it appears to be built in the middle of nowhere. Captain Craft, Sado and Colin are informed by Lafferty that the charter bus disappeared on the way to the stadium, in which it is deduced that the charter bus underwent spontaneous spatial translocation, otherwise being sucked into another dimension. When Prince Baka later appears at Koushien Stadium, the Kisaragi High School baseball team notices that only the locker room looks like Konan Municipal Stadium, leading Prince Baka to conclude that the Kisaragi High School baseball team is trapped inside someone's mind. Eliminating the source of the stress will get them back to the real world, but any member of the Kisaragi High School baseball team could be the suspect. Suddenly, the Matsukawa Commercial High School baseball team arrive to face off against the Kisaragi High School baseball team. Miho, Captain Craft, Sado, Colin and Lafferty meet up at the real stadium, where they realize that the answer is concentration instead of stress. Everything returns to normal after bulkyright fielderCaptain Iwata wakes up from his so-called dream.",
    "tf_idf_text": "field dream toshiya shinohara masashi suzuki march yukitaka kisaragi high school baseball team seemingly arrive koushien stadium semifinal match appear build middle nowhere captain craft sado colin inform lafferty charter bus disappear way stadium deduce charter bus underwent spontaneous spatial translocation otherwise suck another dimension prince baka later appear koushien stadium kisaragi high school baseball team notice locker room look like konan municipal stadium lead prince baka conclude kisaragi high school baseball team trap inside someone mind eliminate source stress get back real world member kisaragi high school baseball team could suspect suddenly matsukawa commercial high school baseball team arrive face kisaragi high school baseball team miho captain craft sado colin lafferty meet real stadium realize answer concentration instead stress everything return normal bulkyright fieldercaptain iwata wake socalled dream"
}