{
    "title": "12 \"Half moon...!\" Naokatsu Tsuda Jukki Hanada March 29, 2011(2011-03-29)[20]",
    "url": "https://en.wikipedia.org/wiki/Level_E",
    "transformers_text": "12 \"Half moon...!\" Naokatsu Tsuda Jukki Hanada March 29, 2011(2011-03-29)[20]\n\nPrince Mohan and Princess Luna, who are respectively Prince Baka's younger brother and fiancée, meet with Captain Craft, Sado and Colin. Prince Baka, who takes refuge in Yukitaka's apartment, explains to Yukitaka that he convinced Dogra's succession assembly to pass a ridiculous bill that would keep him from getting married and taking the throne as king. After an intrigued Miho shows up at Yukitaka's apartment, Prince Mohan and Princess Luna suddenly appear outside Yukitaka's apartment in their escape pod. Princess Luna confesses her love for Prince Baka, but Prince Baka hightails it out of the apartment, riding off with Captain Craft, Sado and Colin. The next day in a canyon, Prince Baka, Captain Craft, Sado and Colin find a hidden spaceship creating a barrier in the atmosphere. The spaceship actually belongs to Prince Mohan, who may have feelings for Princess Luna, according to Prince Baka. During baseball practice, Yukitaka and Miho are told by Princess Luna that her arranged marriage with Prince Baka was to maintain peace between Dogra and Magura, proving her love by solving a difficult math problem. Prince Baka later finds hidden bugs in Yukitaka's apartment, soon realizing that Colin was a spy for Princess Luna.",
    "tf_idf_text": "half moon naokatsu tsuda jukki hanada march prince mohan princess luna respectively prince bakas young brother fiance meet captain craft sado colin prince baka take refuge yukitakas apartment explain yukitaka convinced dogras succession assembly pass ridiculous bill would keep get married take throne king intrigue miho show yukitakas apartment prince mohan princess luna suddenly appear outside yukitakas apartment escape pod princess luna confess love prince baka prince baka hightail apartment rid captain craft sado colin next day canyon prince baka captain craft sado colin find hidden spaceship create barrier atmosphere spaceship actually belong prince mohan may feelings princess luna accord prince baka baseball practice yukitaka miho tell princess luna arrange marriage prince baka maintain peace dogra magura prove love solve difficult math problem prince baka later find hidden bug yukitakas apartment soon realize colin spy princess luna"
}