{
    "title": "1 \"An alien on the planet\" Toshiyuki Katō Jukki Hanada January 11, 2011(2011-01-11)[23]",
    "url": "https://en.wikipedia.org/wiki/Level_E",
    "transformers_text": "1 \"An alien on the planet\" Toshiyuki Katō Jukki Hanada January 11, 2011(2011-01-11)[23]\n\nHigh school student and baseball playerYukitaka Tsutsuimoves into his apartment, shocked that an alien namedPrince Bakahas already invited himself inside. Prince Baka explains that his escape pod crash-landed on Earth two nights ago. As further proof that he is an alien, Prince Baka even gives Yukitaka a controller to make the escape pod explode from a distance.Miho Edogawaswings by from next door and gives Yukitaka a welcoming gift. As the news later reports that there were no casualties, Yukitaka allows Prince Baka to stay overnight. After Prince Baka retrieves an orb seen on the news, Yukitaka witnesses him oozing blue blood. However, Prince Baka heals his wounds near a tree, causing it to bloom. The next day after Yukitaka has baseball practice, the police shows up at Yukitaka's apartment looking for Prince Baka. With Yukitaka playing it down, the police leaves after telling him that Prince Baka is wanted for murder. Prince Baka later shows Yukitaka a holographic image from the orb, anarthropodfrom the planet Jacqueline S known as a Clive, which is extremely adept in mimicry.",
    "tf_idf_text": "alien planet toshiyuki kat jukki hanada january high school student baseball playeryukitaka tsutsuimoves apartment shock alien namedprince bakahas already invite inside prince baka explain escape pod crashlanded earth two night ago proof alien prince baka even give yukitaka controller make escape pod explode distancemiho edogawaswings next door give yukitaka welcome gift news later report casualty yukitaka allow prince baka stay overnight prince baka retrieve orb see news yukitaka witness ooze blue blood however prince baka heals wound near tree cause bloom next day yukitaka baseball practice police show yukitakas apartment look prince baka yukitaka play police leave tell prince baka want murder prince baka later show yukitaka holographic image orb anarthropodfrom planet jacqueline know clive extremely adept mimicry"
}