{
    "title": "2 \"Run after the man\" Toshikazu Yoshizawa Jukki Hanada January 18, 2011(2011-01-18)[23]",
    "url": "https://en.wikipedia.org/wiki/Level_E",
    "transformers_text": "2 \"Run after the man\" Toshikazu Yoshizawa Jukki Hanada January 18, 2011(2011-01-18)[23]\n\nPrince Baka surprises Yukitaka by saying that the Clive is simply his pet and reflects on what he is as an alien.Captain Craft, Sado and Colin of the Royal Guard Army have landed on Earth with the sole mission of protecting Prince Baka. Miho stops by Yukitaka's apartment to check for hidden cameras. However, Prince Baka secretly escapes from his bedroom, much to Yukitaka's annoyance. Meanwhile, Captain Craft and Sado pass by monk Jinpachi Sakamoto in Konan Town to look for answers. Afterwards, Sado points out to Captain Craft that Earth is the only planet where the Diskunians coexist with the Ellerians. Colin has traced Prince Baka's distress signal to Yukitaka's apartment, while Yukitaka and Miho end up finding Prince Baka in a cafe wearing a different outfit. Prince Baka explains that he killed a thug named Lafferty in an alleyway, disposing the body in a trash can. Prince Baka, Yukitaka and Miho return to the apartment and encounter Captain Craft, Sado and Colin. When Prince Baka retrieves Lafferty's body inside the trash can, Sado realizes that Lafferty is of Diskunian origin.",
    "tf_idf_text": "run man toshikazu yoshizawa jukki hanada january prince baka surprise yukitaka say clive simply pet reflect aliencaptain craft sado colin royal guard army land earth sole mission protect prince baka miho stop yukitakas apartment check hidden camera however prince baka secretly escape bedroom much yukitakas annoyance meanwhile captain craft sado pas monk jinpachi sakamoto konan town look answer afterwards sado point captain craft earth planet diskunians coexist ellerians colin traced prince bakas distress signal yukitakas apartment yukitaka miho end find prince baka cafe wear different outfit prince baka explain kill thug name lafferty alleyway dispose body trash prince baka yukitaka miho return apartment encounter captain craft sado colin prince baka retrieve laffertys body inside trash sado realize lafferty diskunian origin"
}