{
    "title": "4 \"From the DARKNESS\" Yasufumi Soejima Jukki Hanada February 1, 2011(2011-02-01)[23]",
    "url": "https://en.wikipedia.org/wiki/Level_E",
    "transformers_text": "4 \"From the DARKNESS\" Yasufumi Soejima Jukki Hanada February 1, 2011(2011-02-01)[23]\n\nIn their shed, four classmates named Higashio, Itakura, Yamada and Nozaki secretly witness a girl named Yasuda being devoured by an unknown boy. The four of them soon list three possible suspects in their class. When Higashio does not show up to school the next day, Itakura, Yamada and Nozaki seek help from music store clerk Ungo Sakamoto. He gives them a business card addressed to Kyūshirō Yumeno, a detective who works at a rundown hospital. At the hospital, Yumeno explains to Itakura, Yamada and Nozaki that they saw an alien, which requires a large investigation fee. When Itakura goes missing several days later, Yamada and Nozaki finally contact Yumeno, giving up their parents' rings as payment and signing a contract. When Yamada and Nozaki find Higashio and Itakura in an isolated room, it turns out that Ungo tricked all of them into meeting Yumeno. Fortunately, Yumeno reveals that their lead suspect Yamamoto was the culprit, given that aliens do not leave behind fingerprints. Yumeno lets them go after showing them recorded footage of his incredible investigation. They happily share a box of fried chicken the following day. Surprisingly, Prince Baka was behind the production of this short film.",
    "tf_idf_text": "darkness yasufumi soejima jukki hanada february shed four classmate name higashio itakura yamada nozaki secretly witness girl name yasuda devour unknown boy four soon list three possible suspect class higashio not show school next day itakura yamada nozaki seek help music store clerk ungo sakamoto give business card address kyshir yumeno detective work rundown hospital hospital yumeno explain itakura yamada nozaki saw alien require large investigation fee itakura go miss several day later yamada nozaki finally contact yumeno give parent rings payment signing contract yamada nozaki find higashio itakura isolate room turn ungo tricked meeting yumeno fortunately yumeno reveals lead suspect yamamoto culprit give alien not leave behind fingerprint yumeno let show recorded footage incredible investigation happily share box fry chicken follow day surprisingly prince baka behind production short film"
}