{
    "title": "5 \"Here come Color ranger!!\" Yui Umemoto Kazuyuki Fudeyasu February 8, 2011(2011-02-08)[23]",
    "url": "https://en.wikipedia.org/wiki/Level_E",
    "transformers_text": "5 \"Here come Color ranger!!\" Yui Umemoto Kazuyuki Fudeyasu February 8, 2011(2011-02-08)[23]\n\nAfter school, five boys named Yoshiki Shimizu, Taiyo Akagawa, Kunimitsu Yokota, Osamu Momochi and Mayo Mayuzumi are suddenly kidnapped by Prince Baka against their wills. Prince Baka deems the five boys worthy of justice despite their excuses of everyday life. The next day, they all receive bracelets that transform them into color rangers. When Akagawa accidentally activates his red color ranger suit at school, Shimizu and Yokota carry him to the boys' restroom, crossing paths with homeroom teacher Tachibana. Akagawa tells Shimizu and Yokota that he saw Tachibana as an alien. Shimizu and Yokota are ordered to return to class when Tachibana enters, but they pull the fire alarm when Tachibana tries to confront Akagawa, in which Tachibana demands that they see her after school. In the classroom after school, all five color rangers meet using an instructional guide given by Prince Baka to learn about fighting techniques. As Tachibana finally shows up in her alien form, she realizes that the bracelets came from Prince Baka himself. Despite the fact that Tachibana is an assassin, her dream was to become a teacher. Sadly, the key to the bracelets is in the hands of Captain Craft.",
    "tf_idf_text": "come color ranger yui umemoto kazuyuki fudeyasu february school five boy name yoshiki shimizu taiyo akagawa kunimitsu yokota osamu momochi mayo mayuzumi suddenly kidnap prince baka will prince baka deem five boy worthy justice despite excuse everyday life next day receive bracelet transform color ranger akagawa accidentally activates red color ranger suit school shimizu yokota carry boys restroom cross path homeroom teacher tachibana akagawa tell shimizu yokota saw tachibana alien shimizu yokota order return class tachibana enters pull fire alarm tachibana try confront akagawa tachibana demand see school classroom school five color ranger meet use instructional guide give prince baka learn fight technique tachibana finally show alien form realize bracelet come prince baka despite fact tachibana assassin dream become teacher sadly key bracelet hand captain craft"
}