{
    "title": "6 \"Dancing in the trap!!\" Shigeru Kimiya Kazuyuki Fudeyasu February 15, 2011(2011-02-15)[24]",
    "url": "https://en.wikipedia.org/wiki/Level_E",
    "transformers_text": "6 \"Dancing in the trap!!\" Shigeru Kimiya Kazuyuki Fudeyasu February 15, 2011(2011-02-15)[24]\n\nWith only Akagawa reaching level ten in training, the color rangers travel by train to prepare for a showdown against Captain Craft. Upon arrival at Captain Craft's \"safe house\", the color rangers are invited in for some watermelons. Captain Craft types to them that Prince Baka can eavesdrop through their bracelets, asking them to play along to make it sound like a fight. He secretly gives up the key, but the color rangers have no idea how to use it. With no other options left, Captain Craft, Sado and Colin team up to help the color rangers properly use the key to reveal their school crushes and unlock their bracelets. Nonetheless, only Akagawa and Momochi are unable to unlock their bracelets. On the following day at school, the color rangers are trapped in a role-playing game on the planet Calvary created by Prince Baka himself. Their mission is to go to the castle and defeat the Demon King. However, they decide that they must train to reach level thirty before going there. Meanwhile, Tachibana shows concern for the color rangers day and night. After awhile, the color rangers end up surpassing their expectations in reaching their levels.",
    "tf_idf_text": "dance trap shigeru kimiya kazuyuki fudeyasu february akagawa reach level ten train color ranger travel train prepare showdown captain craft upon arrival captain craft safe house color ranger invite watermelon captain craft type prince baka eavesdrop bracelet ask play along make sound like fight secretly give key color ranger idea use option leave captain craft sado colin team help color ranger properly use key reveal school crush unlock bracelet nonetheless akagawa momochi unable unlock bracelet follow day school color ranger trap roleplay game planet calvary create prince baka mission castle defeat demon king however decide must train reach level thirty go meanwhile tachibana show concern color ranger day night awhile color ranger end surpass expectation reach level"
}