{
    "title": "7 \"Game over...!?\" Fumiaki Kōda Kazuyuki Fudeyasu February 22, 2011(2011-02-22)[24]",
    "url": "https://en.wikipedia.org/wiki/Level_E",
    "transformers_text": "7 \"Game over...!?\" Fumiaki Kōda Kazuyuki Fudeyasu February 22, 2011(2011-02-22)[24]\n\nAt the castle, the color rangers encounter King Iidachi saying that the dark dragon knight General Luch, who serves directly under the Demon King, is determined to wed King Iidachi's daughter. He will offer his daughter's hand in marriage to anyone who can vanquish General Luch. Prince Baka is introduced as King Iidachi's daughter named Princess Apparel, much to the annoyance of the color rangers. Unfortunately, Prince Baka says that General Luch is at a much higher level than the color rangers. When General Luch enters the castle, Prince Baka tells the color rangers to head east to the Saint's Shrine in order to be safe from monsters, before he willingly departs with General Luch. Prince Baka manages to steal a rocket skateboard under General Luch's bed after some \"bedroom role-play\". The color rangers and Prince Baka each make it to the Saint's Shrine. The Demon King, a younger form of Prince Baka, approaches them with his desire to make Calvary a safe haven. The color rangers use a \"golden hammer punch\" to blast Prince Baka into outer space for being against this idea. Although the color rangers soon return to Earth, their quest on Calvary is not quite over.",
    "tf_idf_text": "game fumiaki kda kazuyuki fudeyasu february castle color ranger encounter king iidachi say dark dragon knight general luch serf directly demon king determine wed king iidachis daughter offer daughter hand marriage anyone vanquish general luch prince baka introduce king iidachis daughter name princess apparel much annoyance color ranger unfortunately prince baka say general luch much high level color rangers general luch enters castle prince baka tell color ranger head east saint shrine order safe monster willingly depart general luch prince baka manage steal rocket skateboard general luchs bed bedroom roleplay color ranger prince baka make saint shrine demon king young form prince baka approach desire make calvary safe color ranger use golden hammer punch blast prince baka out space idea although color ranger soon return earth quest calvary not quite"
}