{
    "title": "8 \"You're my darling!\" Tetsuo Ichimura Masashi Suzuki March 1, 2011(2011-03-01)[24]",
    "url": "https://en.wikipedia.org/wiki/Level_E",
    "transformers_text": "8 \"You're my darling!\" Tetsuo Ichimura Masashi Suzuki March 1, 2011(2011-03-01)[24]\n\nCaptain Craft, Sado and Colin discuss that Princess Saki of the Macbac Kingdom will be visiting Earth to search for a potential mate with the consequence that humankind will go extinct within a few generations. While Captain Craft, Sado and Colin are formally introduced to Princess Saki, it is shown that Prince Baka is busy collecting flora samples in a forest. Captain Craft, Sado and Colin escort Princess Saki with her two friends to a hotel so she can find a suitable mate there. At the hotel, a girl named Satomi leaves a boy named Mikihisa because their hotel room had separate beds. When Princess Saki and Mikihisa cross paths outside, it is double love at first sight, much to Captain Craft's frustration. Captain Craft tries to stretch the truth in order to prevent Princess Saki and Mikihisa from being together, but Saki's friends manage to outsmart Colin and allow Princess Saki to run away with Mikihisa. After failing to pursue Princess Saki and Mikihisa usingsnowmobiles, Captain Craft, Sado and Colin catch them at the end of a ride on anaerial lift. Captain Craft claims that Mikihisa is really a girl, based on his hotel sign-in sheet.",
    "tf_idf_text": "youre darling tetsuo ichimura masashi suzuki march captain craft sado colin discus princess saki macbac kingdom visit earth search potential mate consequence humankind extinct within generation captain craft sado colin formally introduce princess saki show prince baka busy collect flora sample forest captain craft sado colin escort princess saki two friend hotel find suitable mate hotel girl name satomi leaf boy name mikihisa hotel room separate bed princess saki mikihisa cross path outside double love first sight much captain crafts frustration captain craft try stretch truth order prevent princess saki mikihisa together sakis friend manage outsmart colin allow princess saki run away mikihisa fail pursue princess saki mikihisa usingsnowmobiles captain craft sado colin catch end ride anaerial lift captain craft claim mikihisa really girl base hotel signin sheet"
}