{
    "title": "9 \"Love me tender\" Yukio Nishimoto Masashi Suzuki March 8, 2011(2011-03-08)[24]",
    "url": "https://en.wikipedia.org/wiki/Level_E",
    "transformers_text": "9 \"Love me tender\" Yukio Nishimoto Masashi Suzuki March 8, 2011(2011-03-08)[24]\n\nAfter Captain Craft explains that Mikihisa's first name is Kyōko and therefore female, Princess Saki sadly parts ways with Mikihisa. Princess Saki and her two friends leave Earth, much to Captain Craft's relief. However, Prince Baka returns from his travels, already aware that Princess Saki has recently visited Earth. After Prince Baka finds a listening device in Colin's hair, which Captain Craft immediately destroys, Prince Baka, Captain Craft, Sado and Colin realize that Mikihisa has left her hotel room, in which Prince Baka believes that Princess Saki plans to turn Mikihisa into a male. Captain Craft, Sado and Colin follow Mikihisa's snowmobile tracks deep in the woods, but they are too late when Mikihisa is abducted into Princess Saki's spaceship. Princess Saki injects an unknown virus into Mikihisa. When Mikihisa suddenly wakes up at her house the next day, Prince Baka, Captain Craft, Sado and Colin closely monitor any possible changes, since the four of them cannot inject a vaccine into Mikihisa. Several months later, Mikihisa and Princess Saki reunite under the cherry blossoms, but Prince Baka, Captain Craft, Sado and Colin only created a clone of Mikihisa in order to preserve humankind.",
    "tf_idf_text": "love tender yukio nishimoto masashi suzuki march captain craft explain mikihisas first name kyko therefore female princess saki sadly part way mikihisa princess saki two friend leave earth much captain craft relief however prince baka return travel already aware princess saki recently visit earth prince baka find listen device colins hair captain craft immediately destroy prince baka captain craft sado colin realize mikihisa left hotel room prince baka believe princess saki plan turn mikihisa male captain craft sado colin follow mikihisas snowmobile track deep wood late mikihisa abduct princess sakis spaceship princess saki injects unknown virus mikihisa mikihisa suddenly wake house next day prince baka captain craft sado colin closely monitor possible change since four cannot inject vaccine mikihisa several month later mikihisa princess saki reunite cherry blossom prince baka captain craft sado colin create clone mikihisa order preserve humankind"
}