{
    "title": "en.wikipedia.org_wiki_Jump_Ultimate_Stars",
    "url": "https://en.wikipedia.org/wiki/Jump_Ultimate_Stars",
    "transformers_text": "Jump Ultimate Stars is a 2006 crossover fighting video game developed by Ganbarion and published by Nintendo for the Nintendo DS . [ 1 ] It is the sequel to Jump Super Stars and adds numerous more features. The game boasts 305 characters (56 of which are fully playable) from 41 different Shōnen manga series. Jump Ultimate Stars was released in Japan on November 23, 2006.\n\nThe bulk of the gameplay is based around using manga panels that represent characters to create decks on a four by five grid. Panels come in various shapes and sizes, taking up one to eight blocks. There are three kinds of panels that can be initialized in battle: Battle, Support, and Help panels, with decks needing at least one of each type and an assigned leader before being playable. Battle panels are four to eight block panels that represent playable characters. They are based on various manga panels and are used to represent what kind of special attacks the characters have. Support panels are two or three block panels that represent non-playable characters that can perform actions such as attacks, healing or status effects. Help panels are one block panels that can give different boosts to characters they are placed next to. Each battle panel comes with a certain nature. These natures (Knowledge, Strength, and Laughter) act in a Rock, Paper, Scissors relationship with Strength beating Knowledge, Knowledge beating Laughter, and Laughter beating Strength. The stronger type will deal more damage to the weaker type. New panels can be unlocked by clearing challenges in Story Mode, or evolving existing panels using gems collected in Story Mode to unlock new paths and panels, such as stronger variations of Battle panels.\n\nBattles commence in arenas made to look like the page of a manga. Each arena has a unique background, obstacles based on the different manga series, and contain a variety of different platforms. Many are static while others will move, break, or disappear and reappear randomly. Certain walls and floors are also destructible. During battles, players use their Battle komas to attack opponents, defeating them once they have taken enough damage or have knocked them off the stage.\n\nJump Ultimate Stars has been changed slightly from the gameplay of Jump Super Stars . Jump Ultimate Stars gives battle characters the ability to dash and to do a new attack while guarding, which, instead of breaking the guard of the opponent, forces them to change characters, and can be identified by a green glow coming out of the characters which executes it. Also, certain seven and eight panel koma (along with certain five and six panel koma) obtain a visual difference during battle as opposed to the appearance of the one to six koma of the very same character; some of these variations also bring a totally different set of attacks to the character (e.g. Luffy becomes Luffy (Gear 2nd) for his Level 7 & 8 koma, Naruto Uzumaki becomes Kyubii Naruto for his Level 7 & 8 koma, and Ichigo becomes Bankai Ichigo for his Level 7 & 8 level koma). Battle characters now have a new ability known as Ultimate Actions (UA). These UA are different for each character, as some recover health, other recover SP, while others can be used to dodge enemy attacks. Another new feature added is the Evolution Chart. This area allows players to upgrade their characters by spending gems (currency earned for KO'ing opponents) to buy a new koma. Each character has a chart, starting from the one block help koma and branching off into the two and three block Support and the four to eight block Battle koma. Some characters have alternate block paths which unlock a different type for that character (e.g. Goku as a Laughter type instead of a Power type), while others can be used to unlock koma for characters from the same series, quizzes for the series, and new worlds in the Story Mode.\n\nThis is a list of represented series in Jump Ultimate Stars . Most of the main characters from each series appear as characters within the game. Note that almost all of the Battle characters are also Support and Help characters. This is also true for Support characters being Help characters. However, the exceptions are Sasuke Uchiha , Raoh, Frieza, Majin Buu and Heihachi Edajima; these characters do not have a Support character koma, but they do have their Help koma alternative. The asterisk marks newly included series. There are 24 returning series with the addition of 17 new ones, concluding 41 in total.\n\nJump Ultimate Stars garnered \"generally favorable reviews\", according to review aggregator site Metacritic . [ 2 ]",
    "tf_idf_text": "jump ultimate star crossover fight video game develop ganbarion publish nintendo nintendo sequel jump super star add numerous feature game boast character fully playable different shnen manga series jump ultimate star release japan november bulk gameplay base around use manga panel represent character create deck four five grid panel come various shape size take one eight block three kind panel initialized battle battle support help panel deck need least one type assign leader playable battle panel four eight block panel represent playable character base various manga panel use represent kind special attack character support panel two three block panel represent nonplayable character perform action attack heal status effect help panel one block panel give different boost character place next battle panel come certain nature nature knowledge strength laughter act rock paper scissors relationship strength beat knowledge knowledge beat laughter laughter beat strength strong type deal damage weak type new panel unlocked clearing challenge story mode evolve exist panel use gem collect story mode unlock new path panel strong variation battle panel battle commence arena make look like page manga arena unique background obstacle base different manga series contain variety different platform many static others move break disappear reappear randomly certain wall floor also destructible battle player use battle komas attack opponent defeat take enough damage knock stage jump ultimate star change slightly gameplay jump super star jump ultimate star give battle character ability dash new attack guard instead break guard opponent force change character identify green glow come character executes also certain seven eight panel koma along certain five six panel koma obtain visual difference battle oppose appearance one six koma character variation also bring totally different set attack character luffy becomes luffy gear level koma naruto uzumaki becomes kyubii naruto level koma ichigo become bankai ichigo level level koma battle character new ability know ultimate action different character recover health recover others use dodge enemy attack another new feature add evolution chart area allow player upgrade character spend gem currency earn koing opponent buy new koma character chart start one block help koma branch two three block support four eight block battle koma character alternate block path unlock different type character goku laughter type instead power type others use unlock koma character series quiz series new world story mode list represent series jump ultimate star main character series appear character within game note almost battle character also support help character also true support character help character however exception sasuke uchiha raoh frieza majin buu heihachi edajima character not support character koma help koma alternative asterisk mark newly include series return series addition new one conclude total jump ultimate star garner generally favorable review accord review aggregator site metacritic"
}