{
    "title": "en.wikipedia.org_wiki_Curse_of_the_Sacred_Sword",
    "url": "https://en.wikipedia.org/wiki/Curse_of_the_Sacred_Sword",
    "transformers_text": "One Piece: The Cursed Holy Sword ( Japanese : ONE PIECE 呪われた聖剣 , Hepburn : Wan Pīsu Norowareta Seiken ) is a 2004 anime fantasy action-adventure film directed by Kazuhisa Takenouchi and written by Yoshiyuki Suga. It is the fifth feature film in the One Piece film series which mostly focuses on Straw Hat Pirates member Roronoa Zoro .\n\nZoro is lured away from the crew by henchmen of his childhood friend Saga. In search of Zoro, the Straw Hats encounter the young priestess Maya. Luffy and Usopp becomes lost and meet Saga, while Saga's men attack Maya's village. Zoro, alongside them, takes three purple orbs from Maya, which none of Saga's men can touch. Luffy fights Saga, but during the encounter falls off a high cliff, causing Usopp to jump after him. Zoro returns to Saga with the orbs and disposes of them in a well.\n\nLuffy and Usopp find a tunnel system and explore it where they stumble upon the orbs and take them along. While in the village the remaining Straw Hats hear about the evil Seven-Star Sword, that has taken control of Saga, and the stolen orbs needed to seal the sword's power, when Luffy and Usopp emerge from the ground in front of them. After hearing the story, the Straw Hats decide to help. Zoro learns that Saga is controlled by the Seven-Star Sword and that Saga plans to make him the sword's first sacrifice. They start a fight during which Zoro attempts to destroy the cursed blade.\n\nUsing the orbs, Maya performs a ritual to keep the sword's power from fully awakening. Saga defeats Zoro, but before he can kill him, the ritual catches his attention and hurries to interrupt it. With the sword's power unfolding, Saga fights Luffy a second time. During their fight, the sword crumbles and its power is transferred into Saga's body. Zoro appears where he takes over for Luffy and defeats Saga. After the cursed power leaves Saga's body and his mind is freed from the evil influence, the Straw Hats set sail for their next adventure.\n\nShueisha created a film comic adaptation of the film, titled Gekijōban One Piece: Norowareta Seiken ( 劇場版One Piece ―呪われた聖剣― , meaning One Piece The Movie: The Cursed Holy Sword ) [ n 1 ] and released it in two volumes on July 2, 2004 ( ISBN 4-08-873707-5 and ISBN 4-08-873708-3 ). [ 2 ] [ 3 ]",
    "tf_idf_text": "one piece curse holy sword japanese one piece hepburn wan psu norowareta seiken anime fantasy actionadventure film direct kazuhisa takenouchi write yoshiyuki suga fifth feature film one piece film series mostly focus straw hat pirate member roronoa zoro zoro lure away crew henchman childhood friend saga search zoro straw hat encounter young priestess maya luffy usopp become lose meet saga sagas men attack mayas village zoro alongside take three purple orbs maya none saga men touch luffy fight saga encounter fall high cliff cause usopp jump zoro return saga orbs disposes well luffy usopp find tunnel system explore stumble upon orb take along village remain straw hat hear evil sevenstar sword take control saga steal orb need seal sword power luffy usopp emerge ground front hear story straw hat decide help zoro learn saga control sevenstar sword saga plan make sword first sacrifice start fight zoro attempt destroy curse blade use orbs maya performs ritual keep sword power fully awaken saga defeat zoro kill ritual catch attention hurry interrupt sword power unfold saga fight luffy second time fight sword crumble power transfer saga body zoro appear take luffy defeat saga cursed power leave saga body mind free evil influence straw hat set sail next adventure shueisha create film comic adaptation film title gekijban one piece norowareta seiken one piece mean one piece movie curse holy sword release two volume july isbn isbn"
}