{
    "title": "en.wikipedia.org_wiki_I%C3%B1aki_Godoy",
    "url": "https://en.wikipedia.org/wiki/I%C3%B1aki_Godoy",
    "transformers_text": "Iñaki Godoy Jasso (born 25 August 2003) is a Mexican actor who is known for his role as Juan Ruiz in The Imperfects (2022) and Monkey D. Luffy in the Netflix live-action adaptation of One Piece (2023-present). [ 1 ]\n\nIn 2016, at the age of thirteen, he landed his first major role in the American Spanish-language Telemundo series La querida del Centauro , where he played Amadeo \"El Gato\". He continued having small and supporting roles in series such as Blue Demon (2016), Por la Máscara: La Serie Web (2018), No Fear of Truth (2019), and Los elegidos (2019), until at the age of fourteen, he reached his first leading role with his film debut in Go Youth! released in 2020. The same year, the latter was nominated for best film at the 18th edition of the Morelia International Film Festival . He was later in MexZombies , presented at the Toronto After Dark Film Festival , and No Abras La Puerta . Along with the aforementioned releases, on television he appeared in the series ¿Quién mató a Sara? , in its first two seasons, and in his first English-speaking production, The Imperfects , both produced by Netflix.\n\nGodoy was announced as the lead role of Monkey D. Luffy in Netflix's One Piece live-action adaptation in 2021. [ 2 ] The series premiered in 2023.",
    "tf_idf_text": "iaki godoy jasso bear august mexican actor know role juan ruiz imperfects monkey luffy netflix liveaction adaptation one piece present age thirteen land first major role american spanishlanguage telemundo series querida del centauro play amadeo gato continue small support role series blue demon por mscara serie web fear truth los elegidos age fourteen reach first leading role film debut youth release year latter nominated best film edition morelia international film festival later mexzombies present toronto dark film festival abras puerta along aforementioned release television appear series quin mat sara first two season first englishspeaking production imperfect produce netflix godoy announce lead role monkey luffy netflixs one piece liveaction adaptation series premier"
}